00:00 Концепция собеседования
3:09 var, let, const
3:59 Основные типы JS
4:29 Оператор typeof
5:35 Преобразование типов
7:25 Задачи с преобразованием
11:20 Про + и parseInt
12:10 Function expression/declaration
13:30 Методы работы с контекстом - bind(), call(), apply()
14:34 Наследование
16:10 Пример с наследованием классов
17:27 Наследование классов
17:54 try/catch/finally
18:08 Отлов ошибки в setTimeout
20:05 Цепочка промисов
20:30 Пример с .then
22:09 Event Loop
25:22 Замыкание
27:16 Про React
27:34 Про версию React
27:53 Направленность передачи данных в React
28:40 Рассуждения о передаче данных из дочернего компонента в родительский
32:20 Разница props и state
33:15 Virtual DOM
34:57 Пример с Virtual DOM
36:48 Жизненный цикл компонента
38:24 High Order Component(HOC)
40:01 Пример с HOC
40:54 Про стэйт-менеджеры/useContext
41:23 Какую проблему решают стэйт-менеджеры
41:52 Пример со стейт-менеджером
42:20 Что такое margin/padding
43:04 Схлопывание отступов
43:36 Селекторы
44:50 Препроцессоры
46:21 Сложность алгоритма
47:00 Примеры сложности алгоритмов
47:15 Линейная сложность O(n)
47:26 Константная сложность О(1)
51:04 Квадратичная сложность О(n^2)
51:21 Логарифмическая функция O(log n)
52:40 Основные компоненты браузера
54:12 Механизм рендера в браузере
58:00 О команде и роли в ней
58:54 О взаимодействии в команде
1:00:15 Про взаимодействие со смежными специалистами
1:01:43 Про самую сложную задачу
