10 общих вопросов
Вот общие вопросы, с которыми вы можете столкнуться на собеседовании с back-end разработчиком. Цель этих вопросов - помочь потенциальному работодателю лучше узнать вас:

Почему вы заинтересованы в этой должности?

Как вы узнали о нашей компании?

Что вы можете рассказать нам о себе?

Как бы вы описали свой стиль работы или управления?

Предпочитаете ли вы работать индивидуально или как член команды?

Как вы следите за тенденциями развития back-end разработки??

На вашей последней должности, каковы были ваши основные должностные обязанности?

Где вы видите себя в профессиональном плане через пять лет??

Какими словами ваши коллеги могли бы описать вас?

Что вас больше всего радует в этой работе??




11 вопросов об опыте и биографии
Помимо общих вопросов, потенциальный работодатель, ищущий разработчика программного обеспечения, скорее всего, захочет узнать больше о вашем опыте и технической подготовке. Эти вопросы оценивают ваши стили работы и предпочтения, чтобы оценить ваш предыдущий опыт:

Как вы начали заниматься кодированием?

В чем ваша самая сильная сторона как кодера?

Если бы вы возглавили технологическую компанию, как бы вы управляли ее разработчиками??

Расскажите о случае, когда кто-то критиковал вашу работу, и объясните, как вы на это отреагировали.

Как вы доносите негативную обратную связь до членов вашей команды разработчиков?

Приходилось ли вам работать над командным проектом, в котором вы чувствовали, что выполняете большую часть работы?? Как вам это удалось?

Расскажите о достижении в области кодирования, которым вы больше всего гордитесь?

С каким самым сложным решением вы столкнулись в своей карьере??

Каков ваш опыт работы с объектно-ориентированным программированием (ООП)?

Какой ваш любимый язык программирования и почему?

Каков ваш опыт работы с GoTo, и предпочитаете ли вы структурированное программирование?




10 углубленных вопросов
Интервьюеры также могут захотеть получить представление о ваших особых способностях. Подготовка к углубленным вопросам может позволить вам сообщить о своих знаниях и рассказать о своих непростых навыках. Вот некоторые углубленные вопросы, которые может задать ваш интервьюер:

Как бы вы объяснили разницу между дизайном и архитектурой?

Дайте определение терминам стек и куча. Что такое переполнение стека?

В чем разница между связностью и сцеплением?

Когда полезен рефакторинг?

Что означают термины высокая связность и свободная связность ?

Каковы плюсы и минусы хранения доменной логики в хранимых процедурах?

Как вы думаете, почему объектно-ориентированное проектирование является предпочтительным подходом??

Чего вам не хватает в вашем любимом языке разработки? Как вы справляетесь с этими пробелами?

Что общего между классами и закрытиями?

Когда полезны анонимные функции?




6 вопросов для собеседования с back-end разработчиком с примерами ответов
Скорее всего, вы столкнетесь с вопросами на собеседовании, которые могут подчеркнуть широту ваших знаний. Успех вашего собеседования с back-end разработчиком может зависеть от того, насколько хорошо вы представите себя и свой опыт. Работодатели ценят честность и часто хотят видеть, как вы справляетесь с ситуациями, требующими исследования и сбора информации.

Перед собеседованием обязательно изучите основы разработки back-end. Полезно также потренироваться отвечать на вопросы собеседования и узнать о передовом опыте проведения интервью. Вот несколько примеров вопросов для собеседования на должность back-end разработчика с образцами ответов:




1. Каковы семь уровней в системной модели OSI?
Такие специфические для сети вопросы, как этот, требуют прямых фактических ответов. Интервьюеры используют их для оценки ваших базовых знаний сетевых терминов и процессов. В своем ответе постарайтесь продемонстрировать как теоретические, так и практические знания.

Пример: В модели Open Systems Interconnection отслеживание того, как информация перемещается от одного приложения через физическое устройство к программному обеспечению в другом компьютере, требует перемещения через семь абстрактных уровней с определенными функциями. Эти уровни - физический, канал передачи данных, сетевой, транспортный, сеансовый, презентационный и прикладной.




2. Что такое обратный прокси?
Интервьюеры могут задавать подобные вопросы, чтобы лучше понять ваши знания. Этот вопрос может позволить вам расширить и смежные темы. Например, после объяснения обратного прокси вы также можете обсудить его противоположность - прямой прокси.

Пример: Обратный прокси действует как посредник, получая ресурсы с сервера и возвращая их клиенту, так что кажется, что информация исходит от самого прокси-сервера. Прямой прокси-сервер, также являющийся посредником, - это то, что клиент ставит между собой и другим сервером.




3. В чем разница между потоками и процессами?
Интервьюеры задают такие вопросы об основополагающих знаниях, как этот, чтобы проверить вашу конкретную компетентность. Вы можете использовать подобные вопросы как возможность показать, что у вас есть практическое понимание ключевых терминов бэкенда.

Пример: Процесс - это активная выполняемая программа, в то время как поток - это легкий процесс, которым планировщик может управлять самостоятельно. Нити также составляют процессы. Поскольку потоки быстрее переключаются между контекстами, ОС может остановить один поток и запустить другой гораздо быстрее, чем останавливать и запускать процесс.




4. Какие шаги вы предпримите, чтобы использовать mysqldump для восстановления MySQL?
Ожидайте, что интервьюеры включат в интервью несколько вопросов по языкам, чтобы проверить ваши навыки кодирования. Ответьте простыми словами, изложив свой подход к вопросу программирования. Если интервьюеру нужны технические подробности, он обычно спрашивает о них.

Пример: Во-первых, я бы создал новую базу данных с помощью MySQL и дал ей то же имя, что и утерянной базе данных. Я бы проверил, находится ли имя базы данных в корневом каталоге, а затем определил, нужно ли указывать имя сервера.




5. Если у вас ограниченный объем памяти, как вы будете обрабатывать большой объем данных??
Открытые вопросы, подобные этому, обычно имеют несколько правильных ответов, и интервьюер хочет увидеть ваш уникальный подход. Подумайте, как бы вы решили этот вопрос в реальных условиях, поделитесь своим мнением и объясните, почему вы выбрали именно такой ответ.

Пример: Я бы разбил большой объем данных на небольшие фрагменты. Я бы сделал это с помощью внешней сортировки или сортировки слиянием. Я думаю, это был бы самый быстрый и простой вариант.




6. Определите и объясните эти девять кодов ошибок ответа сервера: 200, 201, 204, 301, 400, 401, 404, 409 и 500.
Ваш интервьюер обычно спрашивает об этом, когда хочет узнать глубину ваших знаний об ошибках. Обращайтесь к каждой части по порядку, объясняя, что означает код и что вызвало ошибку.

Пример: 200 означает ОК , и все прошло хорошо. Сообщение 201 Создано означает, что система создала ресурс по запросу клиента. Код 204 No Content означает, что сервер не отправил ответный статус. Сообщение 301 Moved Permanently означает, что действие, вызванное клиентом, изменило URI ресурса. Ошибка 400 Bad Request означает ошибку на стороне клиента.

Если клиент не предоставил правильную аутентификацию, вы видите код 402 Unauthorized . Сообщение 404 Not Found означает, что ресурс не найден. Непоследовательное или невозможное состояние возвращает код 409, Конфликт. Ошибки на стороне сервера генерируют код 500, описываемый как Внутренняя ошибка сервера .
