Автор статьи

Лиана Санамян

Редактор и автор портала Otzyvmarketing.ru.

Все статьи  Бизнес
Чек-лист вопросов на собеседовании системному аналитику
Дата обновления: 27.11.2024  Время чтения: 7 мин.


Какие вопросы задать системному аналитику на собеседовании, чтобы точно оценить уровень специалиста, его навыки и соответствие вашим требованиям. Мы уже рассказывали о вопросах к собеседованию на тестировщика и Python-программиста. В этой статье поговорим о найме аналитиков.

Своим опытом, а также вопросами и рекомендациями по ответам, поделился руководитель отдела аналитики ГК «Технократия» Алексей Аксянов. Совместно мы собрали 60 вопросов, которые обычно задают системным аналитикам при найме. 

SEO, Директ, VK Ads, Авито и Wildberries — в одном кабинете

PromoPult ведёт рекламу на автопилоте:

один логин вместо пяти;
без абонентской платы и агентских комиссий — платите только за то, что используете;
возврат до 19% от расходов бонусами.
Реклама. ООО "Клик.ру". ИНН 7743771327. erid:2VtzqxFCx5k
Алексей Аксянов
Алексей Аксянов
Материал будет полезен не только рекрутерам, но и соискателям на должность системного аналитика — поможет в подготовке перед ответственным интервью.

Перейдем к вопросам для аналитика на техническом собеседовании.

Первый этап: вводные вопросы
Для начала мы всегда стараемся выяснить, правильно ли человек понимает, кто такой системный аналитик. Поэтому мы всегда задаем на старте вопрос: «Кто такой системный аналитик (СА) и кто такой бизнес-аналитик (БА)? Чем они занимаются и в чем разница между ними?»

Надо отметить, что в разных компаниях обязанности на этих должностях бывают сильно перемешаны. Где-то есть аналитик, который делает все, где-то только БА или только СА. Поэтому нам важно понимать ожидания специалиста по должности, в первую очередь, как он сам себя позиционирует.

Далее спрашиваем про опыт кандидата: зачастую в резюме он бывает скудно описан, мы же хотим узнать не просто, что он делал на прошлой работе, но и какие результаты это принесло, какие достижения были и чем он гордится.

При этом можно оценить, насколько у человека хорошо развит навык самопрезентации — это как раз один из важных софт-скилов, необходимых аналитику (публичные выступления, самопрезентация).

Также мы спрашиваем про карьерные ожидания и цели: почему решил поменять работу (а может, и вид деятельности), что не устраивало на прошлом месте, чего не хватало. Это нужно, чтобы понять, что он ожидает и сможем ли мы закрыть его потребности развития на этой позиции в нашей компании.

Вопросы по soft skills для системного аналитика
Открытость мышления, способность выходить за рамки задачи, умение работать с неопределенностью, а также работать в команде — важные софты для любого аналитика.

Аналитик (и системный, и бизнес) переводит неформализованные требования заказчика в структурированный, понятный описанный алгоритм для разработчика.

Чтобы эти требования собрать, нужно общаться как с заказчиками, так и с отделом разработки, потом провести груминг — то есть защитить свой проект перед командой, выслушать их комментарии и согласовать проект. Поэтому коммуникативные навыки крайне важны для аналитиков.

Чтобы выявить у соискателя эти скиллы, можно задать, например, такие вопросы:

Как ты представляешь идеальную команду? Кто в нее входит, какие у каждого роли?
Этот вопрос дает понять ожидания соискателя — то, в каком формате ему комфортно работать — и соответственно, сразу оценить, совпадает ли это с тем, как выстроена работа у нас.

Готов ли ты работать в небольшом проекте, где возможно придется выполнять смежные обязанности, в том числе бизнес-аналитика, ради выполнения общей задачи проекта?
Важно, чтобы человек понимал, что разработчики у нас не фулстек, а с разделением на фронт и бэкенд, а также что есть продуктовые команды с небольшим числом людей, в которых может не быть бизнес-аналитика и технического писателя. Кандидату должно быть комфортно работать в такой команде.

Как ты будешь действовать, если проект-менеджер заболел или ушел в отпуск, а проект нужно сдать в срок? Сможешь ли на короткое время взять на себя управление командой?
Тут мы можем оценить управленческие и лидерские навыки кандидата, сможет ли он аккумулировать в себе экспертизу по проекту и передавать ее коллегам или новым сотрудникам. То есть может ли он в перспективе стать ментором, онбордить новичков и т.д.

Что тебя драйвит и мотивирует в работе?
Этот вопрос часто позволяет определить будущий трек развития кандидата, например: инициативный лидер, ответственный исполнитель, ментор, «говорящая голова» для конференций.

Чем ты однозначно не хочешь заниматься?
Этим вопросом мы выясняем стоп-лист по каким-либо проектам или конкретным задачам. Например, кандидат не хочет работать на проекте, где нужно делать задачи по техподдержке или писать документацию по ГОСТу. Лучше это озвучить сразу — так нам будет проще понять, насколько ему будет комфортно с нашими проектами и процессами. По количеству и «категоричности» ответов можно оценить, насколько хорошим командным игроком станет кандидат.

Команда отдела аналитики
Команда отдела аналитики
Вопросы по hard skills для системного аналитика
Есть стандартные области знаний в аналитике, которые должны знать и системные и бизнес-аналитики. Соответственно, спрашиваем об этом и тех, и тех. В частности, это работа с требованиями и про интерфейс (более значимо для БА), раздел про нотации (универсально для обоих), блок про архитектуру и базы данных, а также интеграции систем (более весомо для СА).

Внутри каждого блока есть конкретные хард-скиллы, которые работодатель оценивает. Мы здесь ввели стандартную классификацию: выставляем баллы от 0 до 3. Чтобы понять, насколько человек опытный и соответствует ли своему уровню, мы составили перечень вопросов от простых до самых сложных.

В процессе собеседования мы задаем из этого списка релевантные грейду, на который претендует кандидат. То есть человеку, который идет на middle+ (и мы на первом этапе убедились в его уровне), естественно не задаем вопросы для джуна.

Теперь перейдем к конкретным вопросам на хард скиллы, распределим их по областям знаний.

НОТАЦИИ

Мы ожидаем, что аналитик хорошо знает две основные нотации: это Нотация BPMN и Нотация UML.

Примеры вопросов для джуна:

Что это за нотации?
В чем их отличия друг от друга?
Какие виды и типы диаграмм в них есть?
Назвать какие-то из этих диаграмм и описать их.
Примеры вопросов для мидла:

Расскажи подробно про диаграмму последовательности (это одна из основных UML диаграмм, которые рисует СА)
Как отобразить альтернативные сценарии в этой диаграмме (блоки alt, loop и т.д.)?
Расскажи (или нарисуй), как показать на диаграмме синхронный и асинхронный вызов?
Расскажи про диаграмму состояний — для чего она и какие элементы на ней есть?
Примеры вопросов для сеньора:

Расскажи про специфические диаграммы, например, диаграмма компонентов, диаграмм объектов?
Используешь ли в работе синтаксис PlantUML?
Какие из UML-диаграмм можно автоматизировать для создания кода и/или артефактов будущей системы?
СУБД и АРХИТЕКТУРА

Здесь проверяются навыки работы с системами управления базами данных (СУБД) и с SQL. Джуну достаточно знать теорию и иметь базовый практический опыт в SQL

Расскажи про реляционные и нереляционные базы данных
Какие есть команды для работы с данными в таблице?
Какие запросы ты применял, расскажи про свой опыт?
Для middle специалиста:

Пользовался ли ты механизмом Join в SQL, какие команды там есть для работы с таблицами
Что можешь сказать из своего опыта про оптимизацию работы базы данных?
Что такое индекс, как он работает и для чего он нужен?
Для уровня senior:

Соискателям старшего уровня мы даем уже сложные кейсы, например, на оптимизацию запросов. Тут проверяется понимание того, в каких случаях какой вид запросов нужно применять и почему.

Архитектура приложений:

чем отличаются и что общего у монолитной и микросервисной архитектур?
расскажи о прочих паттернах архитектуры (SOA, оркестрация, хореография)
транзакции, ACID, SAGA
поделись своим опытом проектирования архитектуры с нуля
Проектирование ER:

расскажи про ER-диаграмму, её уровни и отличия от диаграммы классов
что можешь сказать про элементы и кратность связей в диаграмме?
что такое нормализация и денормализация БД?
какой у тебя был практический опыт на проекте, расскажи о нем подробно
РАБОТА С ТРЕБОВАНИЯМИ

Методики выявления требований:

какие знаешь основные методики и какие использовал в работе?
расскажи подробно про одну из методик
что знаешь про протоколирование и контроль соблюдения договорённостей?
Виды требований:

что знаешь об иерархии видов требований (по Вигерсу или другим классификациям)
приведи примеры по основным видам требований
как собрать с нуля нефункциональные требования?
Формализация требований:

user story
use case
ТЗ и ГОСТы, по которым они оформляются
user story map и customer journey map
Документирование требований и постановка задач:

опиши структуру идеальной статьи и задачи для разработчика
расскажи, как версионировать требования
как поддерживать требования в актуальном состоянии
ИНТЕГРАЦИИ СИСТЕМ

Способы интеграции (на уровне БД, API, понимание брокеров сообщений)
Проектирование API (описание простых и сложных запросов, Open API, версионирование сервисов)
Архитектурный стиль REST (методы, структура запроса, паттерны проектирования, коды ответов, идемпотентность)
Структуры данных (XML, JSON)
Тестирование API (Swagger, Postman, тестирование на мобильных устройствах)
UI / UX

Базовое представление UX/UI
Проектирование GUI (взаимодействие с API, локализация)
Продуктовая аналитика и метрики (инструменты, метрики, как их добавить в систему)
ОБЩИЕ ЗНАНИЯ И ОПЫТ

Методологии разработки (гибкие и негибкие)
MVP, приоритизация (как составить и приоритизировать фичлист)
Оценка трудоёмкости (как оценить трудозатраты аналитика)
Работа с git, CI/CD (опыт работы, чтение кода)
Работа с мобилкой (понимание особенностей мобилки при проведении аналитики)


ЧИТАЙТЕ ТАКЖЕ
Чек-лист вопросов на собеседовании по SQL
11.03.2024
Рекомендации, как подготовиться к собеседованию
Первая и главная рекомендация, в частности, она касается начинающих специалистов — ни в коем случае не пытаться зубрить теорию. Без осмысления вопроса и понимания, как это возможно применить на практике — зубрежка бесполезна.

Можно даже неидеально знать теорию, но при этом гораздо важнее уметь самостоятельно думать, логически мыслить, не стесняться рассуждать и задавать уточняющие вопросы на собеседовании.

Это критически важно, особенно для аналитика. Суперполезный скилл, который не оценить цифрами, но он дает жирный бонус кандидату при трудоустройстве. Любой работодатель будет обращать внимание в первую очередь на живой ход мыслей соискателя, а не на то, как он красиво рассказывает теорию.

Автор статьи

Лиана Санамян

Редактор и автор портала Otzyvmarketing.ru. Опыт работы в digital-маркетинге более 5 лет, с текстами работаю более 8 лет. Магистр филологии и ...

Опубликовано
26.04.2024

Обновлено: 27.11.2024
ЕЩЕ ПО ТЕМЕ
Чек-лист вопросов на собеседовании 1С-программисту

Чек-лист вопросов на собеседовании бизнес-аналитику

Александр Кириллов, CosmoChanger: «Самой популярной валютой остается Bitcoin»

ТОП-16 конструкторов смет – обзор программ

Подсматриваем стратегию конкурентов в рекламе: рекомендации сервиса getUNIQ

Комментарии
Добавить комментарий
Текст комментария

Подпишитесь на нас в соцсетях
Узнавайте о новостях и событиях там, где вам удобно


Вконтакте

Telegram

YouTube

PromoPult (SeoPult)
Прежде чем выбрать — попробуйте сами
14 дней SEO в PromoPult бесплатно. Без карты и подписки. Один кабинет для SEO, Директа, VK Ads и Wildberries.

Начать бесплатно
реклама



otzyvmarketing
Авторитетные отзывы от специалистов интернет-рынка

Контакты
Реклама на сайте
FAQ для сервисов
Виджеты для сервисов
 Добавить компанию
Пользовательское соглашение
Правила сайта
Профессии
Промокоды
Кабинет представителя
© 2015-2026 otzyvmarketing.ru

