Middle - 
Senior - 
Fullstack react javascript по градациям - 
Frontend по градациям - 
  
---------------------------------------------------------------------------------------------
[ПОВЕДЕНЧЕСКИЕ ВОПРОСЫ]:
----------------
⋙ ❍ Опишите ключевой опыт работы в роле Frontend разработчика: проект, основные задачи, команда? ✔

⋙ ❍ Обозначьте Ваш технический стек? ✔

⋙ ❍ Как вы работаете с REST API в вашем проекте? ✔

⋙ ❍ Какие методы оптимизации производительности вы используете в React-приложении? ✔

⋙ ❍ Как вы внедрили CI/CD в ваш проект? ✔

⋙ ❍ Можете ли вы рассказать о своем образовании и опыте в области программирования? ✔

⋙ ❍ Достижение в Метрики? ✔

⋙ ❍ Что было на бэкенде? ✔

⋙ ❍ Что было бы интереснее? ✔

⋙ ❍ На фронте что лучше из фреймворков? ✔

⋙ ❍ Какие ближайшие планы попробовать и что изучить? ✔

⋙ ❍ Когда нарабатывала коммерч. опыт разработки, ты работала в одиночку с готовыми приложениями или одна собирала под ключ или работала в команде? ✔

⋙ ❍ как был организован рабочий процесс в команде? Кто ставит задачу, как происходил производственный процесс на работе? ✔

⋙ ❍ Как сливали результаты работы? ✔

⋙ ❍ ! Какие фреймворки и библиотеки вы использовали в своих проектах? ✔

⋙ ❍ ! Какое было ваше последнее достижение в работе над фронтендом? ✔

⋙ ❍ ! Над какими проектами вы работали? Как это выглядело? ✔

⋙ ❍ В каком направлении вы хотели бы развиваться, когда дело доходит до разработки интерфейса? ✔

⋙ ❍ Вы работали в команде во время проекта по программированию? ✔

⋙ ❍ Как вы научились программированию? ✔

⋙ ❍ Были ли вы на курсах программирования? ✔

⋙ ❍ Какие источники вы используете? ✔

⋙ ❍ Можете похвастаться своими проектами? ✔

⋙ ❍ Что волнует или интересует вас в программировании? ✔

⋙ ❍ С какой последней технической проблемой вы столкнулись и как вы ее решили? ✔

⋙ ❍ Приходилось ли ранее делать pet-проект, либо реализовать/проектировать проекты с нуля, если да, какими инструментами пользовались? ✔

⋙ ❍ Возможно ли сделать GET запрос из браузера? Раскройте ответ. ✔

⋙ ❍ Является ли React “реактивной” библиотекой? Раскройте ответ. ✔

⋙ ❍ Опишите ситуации в которых происходит ререндер компонентов в React? ✔

⋙ ❍ Какую проблему решают стейт-менеджеры? ✔

⋙ ❍ Есть ли у вас опыт использования TypeScript (или аналогов), если да: ? ✔

⋙ ❍ Расскажите, на каких проектах считаете использование TypeScript оправданным? ✔

⋙ ❍ Как на ваш взгляд правильно описывать типы (почему?): ✔

⋙ ❍ Сначала описать типы а потом реализацию? ✔

⋙ ❍ Сначала написать реализацию а потом типы? ✔

⋙ ❍ При создании или поддержке нового веб-сайта, можете ли вы объяснить некоторые из методов, которые вы использовали для повышения производительности? ✔

⋙ ❍ Если у вас есть 5 разных таблиц стилей, как лучше всего интегрировать их на свой сайт? ✔

⋙ ❍ Сколько ресурсов браузер загрузит с данного домена одновременно? ✔

⋙ ❍ Перечислите 3 способа уменьшить загрузку страницы (воспринимаемое или фактическое время загрузки)? ✔

⋙ ❍ Объясните, что такое ARIA и средства чтения с экрана и как сделать веб-сайт доступным/Объясните, что такое ARIA и скринридеры, а также как сделать сайт доступным?? ✔

⋙ ❍ Объясните некоторые преимущества и недостатки анимации CSS по сравнению с анимацией JavaScript? ✔

⋙ ❍ Что вы изучили вчера/на этой неделе? ✔

⋙ ❍ Самое крутое, что вы когда-либо делали и чем гордитесь? ✔

⋙ ❍ Можете ли вы назвать сети по умолчанию? ✔

⋙ ❍ Если у вас есть 5 разных файлов со стилями, какой лучший способ интегрировать их в сайт? ✔

⋙ ❍ Можете ли вы описать разницу между прогрессивным улучшением и изящной деградацией? ✔

⋙ ❍ Как можно оптимизировать загрузку внешних ресурсов на странице? ✔

⋙ ❍ Сколько ресурсов браузер может одновременно загружать с одного домена? ✔

⋙ ❍ Какие есть исключения? ✔

⋙ ❍ Назовите три способа уменьшения времени загрузки страницы (воспринимаемого или реального)? ✔

⋙ ❍ Опишите, как бы вы реализовали примитивное слайд-шоу/Опишите, как вы можете создать простую страницу слайд-шоу? ✔

⋙ ❍ Если бы у вас была возможность освоить новую технологию в этом году, что бы это было? ✔

⋙ ❍ Объясните важность стандартов и комитетов по стандартам? ✔

⋙ ❍ Что такое FOUC (Flash Of Unstyled Content)? Как его избежать? ✔

⋙ ❍ Какие преимущества и недостатки у CSS и JavaScript анимаций? ✔

⋙ ❍ Что означает CORS и какую проблему решает? ✔︎

⋙ ❍ Какова роль веб-разработчика? Какие наиболее важные аспекты работы и почему? ✔︎

⋙ ❍ Какой ваш любимый сайт? Почему? (подробный анализ сайта/продукта) ✔

⋙ ❍ Как вы следите за изменениями в отрасли? ✔

⋙ ❍ В чем вы специализировались? ✔

⋙ ❍ Каков ваш самый высокий уровень образования? Где вы учились? ✔

⋙ ❍ Посещали ли вы курсы дизайна? ✔

⋙ ❍ Есть ли у вас опыт разработки программного обеспечения? ✔

⋙ ❍ Создавали ли вы собственное программное обеспечение? Есть ли у вас пример? ✔

⋙ ❍ Сколько лет вы занимаетесь программированием? ✔

⋙ ❍ Как вы использовали ООП на своей последней должности? ✔

⋙ ❍ Какой из фреймворков больше нравится? ✔

⋙ ❍ и почему React? ✔

⋙ ❍ Расскажите о прошлом проекте, который вы выполняли с помощью Docker? ✔

⋙ ❍ Как давно вы используете Docker? ✔

⋙ ❍ Приходилось ли вам раньше управлять несколькими библиотеками? ✔

⋙ ❍ Можете ли вы объяснить какие-либо распространенные методы или недавно решенные проблемы безопасности внешнего интерфейса? ✔

⋙ ❍ Чем отличается новичок разработчик от великого разработчика? ✔

  
---------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------
[НЕУДОБНЫЕ/КАВЕРЗНЫЕ ВОПРОСЫ]:
----------------
⋙ ❍ Назовите одну сложную проблему, решение которой доставило вам удовольствие? ✔

⋙ ❍ Перечислите свои три сильные стороны? ✔

⋙ ❍ «Каковы ваши самые сильные стороны?» ✔

⋙ ❍ «Какие у вас слабые стороны?» ✔

⋙ ❍ «Как вы решаете конфликты в команде?/Как вы справляетесь с конфликтными ситуациями?» ✔

⋙ ❍ Что вас интересует в этой должности? ✔

⋙ ❍ Как обеспечить эффективное общение с членами команды? ✔

⋙ ❍ Какие планы, что попробовать, изучить? ✔

⋙ ❍ Как был организован производст. процесс, рабоч. день? ✔

⋙ ❍ Система контроля версий/Что ставили в качестве контроля версий? ✔

⋙ ❍ Как сливали результат работы? ✔

⋙ ❍ Что вы узнали о нашей компании? ✔

⋙ ❍ Есть ли у вас опыт работы в команде? ✔

⋙ ❍ Были ли вы раньше наставником младшего разработчика? ✔

⋙ ❍ «Почему вы ушли с предыдущего места работы?» ✔

⋙ ❍ «Как складывались отношения с коллегами и руководством на предыдущей работе?» ✔

⋙ ❍ «Почему вы хотите работать в нашей компании?» ✔

⋙ ❍ «Кем вы видите себя через пять лет?» ✔

⋙ ❍ «Почему вы считаете, что подходите для этой позиции?» ✔

⋙ ❍ «Какой последний промах вы допустили в своей работе?» ✔

⋙ ❍ Как вы справляетесь с трудными членами команды? ✔

⋙ ❍ Какие системы контроля версий вы знаете? ✔

⋙ ❍ Как вы справились с разногласиями с начальником или коллегой? ✔

⋙ ❍ Какие ресурсы вы используете для получения последней информации о разработке и дизайне интерфейса? ✔

⋙ ❍ Что вы больше всего любите в ваших инструментах разработки? ✔

⋙ ❍ Кто из фронтенд-сообщества вас вдохновляет? ✔

⋙ ❍ Какая ваша любимая “фишка” Internet Explorer? ✔

⋙ ❍ Какой кофе вы предпочитаете? ✔

⋙ ❍ Что вас привлекает в программировании? ✔

⋙ ❍ С какой технической сложностью вы недавно столкнулись и как с ней справились? ✔

⋙ ❍ Какие методы для повышения производительности вы использовали при создании или обслуживании сайта? ✔

⋙ ❍ Можете ли вы описать некоторые методы SEO, которые вы использовали в последнее время? ✔

⋙ ❍ Можете ли вы объяснить общие принципы относительно фронтенд-безопасности или недавние проблемы, которые вы решили? ✔

⋙ ❍ Какие действия вы лично предприняли в недавних проектах для повышения удобства использования вашего кода? ✔

⋙ ❍ Расскажите о предпочитаемой среде разработки? ✔

⋙ ❍ С какими системами контроля версий вы знакомы? ✔

⋙ ❍ Можете ли вы описать порядок действий при создании новой веб-страницы? ✔

⋙ ❍ Каков ваш опыт в облачных вычислениях? ✔

⋙ ❍ Работали ли вы с какими-либо другими контейнерными технологиями? ✔

⋙ ❍ С какими программными платформами вы имеете наибольший опыт работы? ✔

⋙ ❍ Как вы участвовали в проекте Docker в прошлом опыте работы? ✔

⋙ ❍ У вас есть какие-нибудь личные проекты? Какого рода? ✔

⋙ ❍ Если вы присоединились к проекту, где для форматирования используются табы, а вы привыкли использовать пробелы, как вы поступите? ✔

⋙ ❍ Если бы вы могли освоить одну технологию в этом году, что бы это было? ✔

⋙ ❍ Какие действия вы лично предприняли в последних проектах, чтобы сделать код более удобным для сопровождения? ✔

⋙ ❍ Можете ли вы описать некоторые из лучших практик или методов SEO, которые вы использовали в последнее время? ✔

