---------------------------------------------------------------------------------------------
[Middle Legend]:
---------------------------------------------------------------------------------------------
~ До Outsource (обучение) ~
Училась с 2019 года полтора года, попала на стажировку в Астэн 3 мес, но не стала подписывать договор о неустойке при увольнении раньше срока, чем 2 года, я хотела получить опыт, я не знала про эти условия на собеседовании, поставили условие уже в моменте
Потом я несколько мес. искала работу джуном в аутсорс студии 1, 2 проекта в течении полтора года и вырастаю в мидла +/-, имея при себе полтора года опыта со стажировкой, постоянно приходилось прыгать по небольшим проектам с нуля, хотелось сесть и работать на конкретном крупном проекте и попасть в продукт, углублять знания в крупном проекте, не прыгать
Зашла через аустафф в продукт
Заходила в аутсорс, чтобы получить больше насмотренности, сейчас уже есть важная компетенция - насмотренность уже есть, сейчас хочется углублять знания, поэтому я пришла к вам на собес, не хочу прыгать по проектам , максимально задержаться и сидеть много лет
Позже иду в аустафф, где меня отдают/продают в продукт, где я как раз погружаюсь в один продукт
Но позже хочу работать уже в штате, в аутстаффе бюджет может закончиться, аутстафф сократить, я могу ждать долго новый проект, проект может поменяться без моего желания, хочется понимать и осознавать определённость, в какую компаниюиду и в какой проект, и над чем работаю продолжит. время, остваться с этими коллегами в штате, и влиять на продукт,
поэтому я иду к вам, или в продукт на невижимость или финтех
---
~ Outsource (история) ~
До ковида начала изучать программирование, решила для себя, что нужно срочно искать работу, полгода готовилась к собеседованиям и первой работе,
Смогла попасть в небольшой аутсорс, срочно писали сайт для редактирования видео, и 2, проекты на полгода каждый с нуля и больше стека
Я была участником команды и росла внутри компании, я видела как пишутся коммерческие проекты с нуля до релиза, у меня был код-ревью.
Было очень много инностр.клиентов ушла, компания понесла убытки, нам пришлось искать работу
И я нашла продуктовую компанию и до сих пор там работаю, 3,5 лет, я максимально погружена в проект, досконально знаю все нюансы, понимаю, как мои решения 3,8 лет назад в самом моём начале в этой компании как они сейчас повлияли на проект технически и архитектурно, я знаю, как это всё исправить, я предыдущие ошибки не допущу в вашем проекте
В продуктовую компанию резко потребовался разработчик, так как многие уехали из-за сво, нельзя было работать из-за границы, а я в Москве, и смогла спокойно трудоустроиться и работать в этой Компании
Хотела поработать в штате небольшого коммерческого проекта и потом дальше идти в крупные продуктовые компании типа озона, финтеха с опытом работы, что я работаю в продуктовой компании
Последние 3, 5 года делала продуктовые продукты (релизы сопоставить), уменьшилось бюджетирование, стало меньше задач, подогнали приложение к аналогу сайта и больше не растут (подтверждение релизами)
Очень много доработок, рефактора, много внутр. изменений, нежели внешних и продуктовых задач, поэтому я иду в продукт, поэтому хочется работать в штате в чём-то крупной в большой продуктовой компании
---
~ Общая презентация (профи от авось) ~
---------------------
У меня более 4-х лет опыта во фронтенд разработке/Уже более 4-х лет работаю фронтенд-разработчиком
Работала в основном в аутсорсинговых компаниях, чтобы поднабраться/получить как можно больше разнообразного опыта и изучить широкий спектр технологий и подходов к разработке проектов разного масштаба, чобы расширить свои знания и быстрее развиваться.
Такой опыт/путь помог мне научиться работать в команде и быстро адаптироваться к новым проектам и самостоятельно решать задачи.
Всегда смотрела и вдохновлялась на старших коллег и тимлидов с 10-летним и 15-летним опытом/годами опыта, задавалась вопросом, как достичь их уровня, чтобы понять, как вести проекты от начала до конца и самостоятельно разворачивать/запускать сложные проекты на продакшен
С такими мыслями я пришла в свою последнюю компанию, где работаю до сих пор, около 3,5/4 лет. Это продуктовая компания с офисами/несколькими филиалами в Москве и Санкт-Петербурге, которая сотрудничает с крупными клиентами.
Я работала в Московском офисе, на тот момент я хотела офис, чтобы больше общаться с коллегами и работать в команде.
На текущем месте работы/за 3 года/это время там/я была на двух проектах в двух разных командах/участвовала в нескольких проектах.
Здесь я пришла в команду 2 вторым мидлл фронтенд разработчиком, активно участвовала в проектировании и улучшении кодовой базы, полностью отвечая за разработку и структуру кода, а также в процессах, связанных с оценкой и планированием задач.
За полтора года работы/в качестве мидлл разработчика/меня перекинули на другой проект (достижения в метриках).
Компания выиграла тендер на развитие и разработку (конкр. со старым релизом №1) проекта  - предыд. проект отдали (№2) и спокойно перевели меня на другой крупный продуктовый проект (№3)
Поработала с фудтехом, эдТхом, потом перешла в недвижимость (ритейл(чаты и консультации))
Делала все продуктовые задачи, которые можно посмотреть в моём резюме, могу подробнее о них рассказать, если будет интересно
Помимо этого, я работала над внутр. проектами: Мне доверяли настройку внутр. систем, настраивала процессы и внутр.инструменты, разрабатывала интерфейсы, и публикацию приложений в store/google play, и решала задачи, требующие аналитического подхода к деталям.
Много писали, было много ошибок и нюансов, Этот большой опыт дал мне возможность лучше понять, как работают процессы изнутри.
Мне нравится писать продуманный код и искать способы улучшить производительность в своей части кода/структуре проекта
Хочу пойти в крупную продуктовую компанию, потому что уже есть опыт работы в продукте с внутренними процессами и есть насмотренность в разных доменных областях, /работаю ка аутсорс или аутстаффер/, а мне всегда хотелось полноценно работать в штате компании над новым крупным и интересным проектом, развиваться и расти как мидлл, чтобы был другой стек, ответственность, другая доменная область, возможно возьму Эдтех по релевантному похожему опыту, также могу откликаться на Е-коммерс, или совершенно другое противоположное, но непосредственно в штате
---
Сейчас я рассматриваю разные предложения и выбираю лучшие условия для профессион. роста, чтобы продолжить развиваться как специалист и работать над интересными проектами
/Сейчас рассматриваю много предложений и смотрю, где лучше условия, несмотря на офферы и выберу самый лучший!
У меня сейчас несколько собеседований на разных этапах, хочу в конце недели определиться, куда мне идти
---
- А что Вам было бы интересно подробнее узнать ?
- Что для вас более ценно, а давайте я вам подробнее расскажу ?
---------------------------------------------------------------------------------------------
