const history = Array.from([...result.history])
 02.02.2021 19:57
Другие вопросы по теме
Хранимая процедура для удаления строки, где это условие истинно:
Какова может быть цель первичных ключей для всех таблиц, полученных из одной таблицы?
Данные больше не сохраняются в таблицу в моей базе данных SQLite
MongoDB (JS), выполняйте операции запроса для одного свойства документа, если оно доступно, иначе используйте другое свойство
Как найти товар с максимальным количеством заказа в каждом регионе?
SQL Server тройное отношение многие ко многим
Как очистить кеш после обновления базы?
Внешний ключ ссылается на первичный ключ в весенней загрузке
Вставить пустой массив int в таблицу куста
Почему это partialFilterExpression выдает ошибку?
Похожие вопросы
Отправляйте большие вложения (> 5 МБ) с помощью клиента Gmail API Node.js
Получить ошибку, метод не разрешен
Указывает ли использование ЦП, полученное из node.js os.cpus() в экземпляре контейнера докеров, ЦП хоста или ЦП контейнера?
Потоковая передача данных в дополнение Node.js C++ с помощью N-API
Можно ли найти по ключу в сиквеле PostgreSQL?
Отправка Ajax-запроса данных формы на узел/экспресс
Как «обратный формат»
Mongo объединяет результаты поиска на основе уникального свойства подколлекции с количеством?
Вью | Проблемы с vue-moment.js
Лучший способ сопоставить глубокий объект с новым объектом

04.04.2019 16:35
Другие вопросы по теме
Как удалить повторяющиеся вложенные объекты, сравнивая их значения
Потоковая передача файла через SFTP-соединение с клиентом
Проблемы с шифрованием Nodejs с модулем npm «crypto»
Почему многоуровневые асинхронные функции не перехватывают ошибку, возникающую на самом низком уровне в узле?
NodeJS fs – не удается прочитать внешний файл json
Как я могу поймать ЛЮБУЮ ошибку из formidable.js в узле?
MongoDB: динамические счетчики
Ошибки при использовании функции Lambda для удаления записи из DynamoDB, но запись по-прежнему удаляется
Как обрабатывать строку запроса Node Js AWS Lambda
Файл конфигурации .npmrc не читает переменную среды для загрузки модуля частного узла
Похожие вопросы
Как преобразовать SVG-путь
Как я могу взять строки текстового поля и поместить их в набор элементов с выравниванием по левому и правому краю, разделенных на «:» для каждой строки?
Методы Vue JS не срабатывают
Как я могу изменить этот вывод функции qr перед возвратом
Массив строк, добавляющих запятые при вставке в HTML
Плавная прокрутка в тени DOM
Как удалить повторяющиеся вложенные объекты, сравнивая их значения
Как добавить несколько объектов Json в один массив из цикла
Для доступа к объекту требуется setTimeout?
Является ли каждая функция в JS замыканием?
 
13.08.2018 07:41
Вам также может потребоваться учитывать размер документа, сохранение идентификатора пользователя для каждого продукта или строкового идентификатора продукта для каждого пользователя может привести к отключению памяти и не очень хорошо масштабируется. Rdbms будет лучшим решением этой проблемы.

Nodejs, mongodb найдите с помощью forEach и обновите
Spring Boot с доступом к MongoDB - обновление нескольких записей / документов из конечной точки rest api
Mongo DB - поиск и подсчет занимают больше времени для выполнения
Последователи / Структура подписок в MongoDB
Loop Childens Custom Mongodb
Как получить id нового предмета ngrx
Импортировать вложенный MongoDB в Pandas
Как подключить Docker-контейнер к mongodb
Обновить массив с несколькими условиями в mongodb
Приложение Node / Express зависает при взаимодействии с MongoDB, ошибок нет
Похожие вопросы
Значение Long в JPARepository?
Perl не может подключиться к базе данных
Оставить проект базы данных приложения
База данных INNER JOIN
Как подключить RocksDB с помощью java
Mongo DB - поиск и подсчет занимают больше времени для выполнения
Последователи / Структура подписок в MongoDB
Как я могу разрешить другим компьютерам доступ к базе данных моей программы?
Хранить данные в таблице базы данных или массиве
Обеспечение стандартов безопасности для базы данных доступа ms


 21.07.2021 10:37
Другие вопросы по теме
Эффективный разбор объекта хранилища данных в Python
Какие улучшения я могу внести в базу данных посещаемости студентов NoSQL?
Ограничение размера документа Couchbase, предпочтительно хранить общие данные
Есть возможность хранить данные в HDFS с ключом-значением?
Сертификаты Scylla для администраторов/архитекторов/разработчиков
Couchbase spring data jpa для создания составного первичного ключа
Как получить метаданные снимка Firestore?
Структура списка контактов пользователя
Одновременное использование @Document и @Entity
Дизайн базы данных — вопрос о моделировании ERD для Graph в AWS
Похожие вопросы
Azure: назначение ролей с помощью шаблона ARM контейнеру хранилища
В визуальной студии, как вы можете увидеть планировщик при загрузке шаблона руки в визуальную студию
Вызов workItemTrackingHttpClient.CreateWorkItemAsync() вызывает различные исключения при развертывании в облаке
Azure SSIS IR — работа с файлами во временной папке IR-узла
Как использовать хранимую процедуру с серверной службой Azure Mobile .Net?
Как использовать Azure Notification Hub без обновления приложения IOS
Как реализовать аутентификацию формы с помощью MVC 5 и автоматического масштабирования Azure
AzureMapsCodeSamples не может работать на локальном диске
Выходная привязка функции Azure Cosmos DB — настраиваемые параметры JsonSerializerSettings
Ошибка устойчивой функции Azure «Функции активности в настоящее время не зарегистрированы!»

13.05.2019 10:52
Другие вопросы по теме
Операция BatchWriteItem: предоставленный ключевой элемент не соответствует схеме
Cloudformation: параметризовать имя параметра?
Kubernetes CoreDNS периодически разрешает имена
Terraform — загружать файл на S3 при каждой подаче заявки
Наличие нескольких файлов main.go для развертывания приложения на основе AWS Lambda
Вызов функции Lambda из приложения React, сгенерированного Amplify, без использования шлюза API
Инициировать сигнал тревоги AWS, когда вызов шлюза API достигает 29-секундного тайм-аута и возвращает ошибку 504
Рекомендации по проектированию перед развертыванием в AWS?
Объекты S3 без производительности префикса
Как сделать команду aws доступной для sh при использовании модуля оболочки ansible?

MongoDB: отличные значения от объектов в подмассиве
Проверить дубликаты определенного поля для массива документов с внутренним массивом
Усовершенствования агрегатных функций для включения нескольких полей без поля _id
Insert_many не работает при добавлении еще одного случая
Как правильно сделать seed mongoDB в NestJS, используя mongoose и воспользовавшись моими уже определенными схемами
Вложенный массив Mongo Aggregate, поиск
Коллекция не показывает свои значения с помощью .find()
Как вставить значение из базы данных в тег "а" в атрибут href
Очень большое количество подключений к MongoDB
Как найти длину массива mongodb

19.04.2018 20:44
Другие вопросы по теме
Предоставляет ли OrientDB HTTP API функцию удаления базы данных?
Пакетные команды OrientDB для уникальных ребер и вершин
Orient Db AssertionError OCachePointer.incrementReadersReferrer
Запрос Orientdb для получения всех вершин, соединенных ребром определенного типа
Ошибка OrientDB Console.bat с недопустимым паролем имени пользователя для команды удаления базы данных
Использовать временный идентификатор записи во время транзакции
Oriendb Select @ rid из таблицы возвращает -2: 0
Как улучшить этот запрос OrientDB для максимальной производительности?
Orientdb создает java.lang.String не может быть приведен в базу данных проверки и базы данных восстановления
OrientDB: выберите край, где out = (выберите ??) не работает
Похожие вопросы
Невозможно восстановить определенные таблицы на определенных узлах в Cassandra
Spring Data API для запросов без использования ORM
Есть ли в Кассандре шаблон для этой задачи?
Ключи нескольких диапазонов для таблицы DynamoDB
Проблема с производительностью с CouchDB Mango Index
MUMPS для миграции базы данных Cache
Гибридные приложения: какая стратегия БД «PouchDB + CouchDB» или Couchbase Mobile?
Поиск записей по значению или условному значению в Nosql со 100 миллионами записей
Префикс RavenDB ID и REST API
Вес поискового запроса MongoDB

 10.09.2020 14:03

Как сохранить нулевые значения в конце сортировки в Mongoose?
Не удалось найти пакет libsystemd-dev во время установки ScyllaDB в ubuntu 14
Хранение сложных данных в качестве ключа в базе данных NoSQL?
Несколько потоков пытаются одновременно писать в одном хранилище данных без Sql
Aerospike ACID - Как узнать окончательный результат транзакции по таймаутам?
MongoDB - полезен ли индекс для коллекции, в которой будет только запрос findOne?
Тестирование БД
Стратегия архивирования данных MongoDB
Отношения "многие ко многим" RavenDb: структура и индекс документа
Правильный дизайн в базе данных документов Cloud Firestore
Похожие вопросы
Ошибка с WSGI при развертывании приложения Flask в Azure
Определение сборки для приложения Django в VSTS
Многофакторная аутентификация при входе в Windows 10 с учетной записью Azure AD
C# Application Insights - несколько экземпляров TelemetryClient
Как правильно назначить узлы менеджера роя?
Хранилище Azure: фильтр запросов к таблицам работает в эмуляторе, но не в Azure
Как вернуть файл в настраиваемом соединителе Azure Logic Apps
DistributedExchangeOperation <ShuffleMoveOperation>
Есть ли способ в Sql Server найти, какие столбцы в представлении не индексируются
Глубокая ссылка на текстовый файл в Azure Data Lake Store


 11.04.2019 09:20
Другие вопросы по теме
Сделайте groupby, а затем присоединитесь к Bigquery
Сложное моделирование БД в firestore
Проблема MongoDB в запросе, возвращающем значение от пользователя
Приложение для знакомств. Какая структура базы данных мне нужна в Firebase Firestore, чтобы запрашивать всех пользователей, кроме тех, кому я не нравлюсь?
Как сделать поворот на MongoDB?
Как моделировать данные в Cassandra, чтобы избежать бесполезного дублирования
Как установить несколько экземпляров CouchBase на один Linux-сервер?
Как запросить связь серий действий, инициированных пользователями, из SQL или NoSQL?
Моделирование нескольких отношений «многие ко многим» в Dynamodb
Хранение больших объемов запрашиваемых JSON
Похожие вопросы
Возникла проблема с генерацией ответа на запрос слота
Расположение лямбда-функции AWS приводит к InvalidToken-Error
RDS не поддерживает создание экземпляра БД со следующей комбинацией
AWS CloudFormation: «Параметр [subnetIds] недействителен»
Как исправить ошибку подписки на тему SNS с помощью node js и конечной точки http
NodeJs не может перезвонить ответ AWS Secrets Manager
DynamoDB Client.Scan() не возвращает параметр LastEvaluatedKey
Как преобразовать в json после получения из AWS DynamoDB getItem() в среде python3.7?
Как сделать API AWS AppSync GraphQL общедоступным при использовании Amazon Cognito для аутентификации?
Как загрузить в AWS S3 с помощью тегов объектов


27.06.2019 20:12
Другие вопросы по теме
Что лучше по производительности при запросе данных 50 ГБ? Это MYSQL SELECT с условием или Dynamodb SCAN с выражениями FiLTER?
Количество запросов друида для нескольких столбцов
Как мне структурировать базу данных firestore во флаттере, чтобы легко получить доступ к другим коллекциям, связанным с пользователем?
Как экспортировать все коллекции в базу данных с URI?
Значение атрибута обновления Dynamodb среди связанных элементов
Включить узел Entry в обход AQL Graph
Как обновить объект в монго через PHP
Ручная сортировка в базе данных NoSQL
Моделирование «многие ко многим» в Cassandra или другой базе данных nosql
SEMBAST - Как удалить определенный массив из моей БД?
Похожие вопросы
Как убедиться, что все основные узлы EMR всегда содержат файл хранилища ключей?
Взимает ли AWS плату за время запуска инстанса RDS?
Отсутствуют записи CloudFront для функций Lambda в Route 53
Как назначить роль экземпляру EC2, запущенному в рамках автоматического масштабирования
Экспорт существующих сигналов тревоги AWS CloudWatch в шаблон CloudFormation
Рекомендации по развертыванию развертывания kubernetes в разных средах и обработке номеров сборок в конфигурации
Как продлить срок действия токена доступа или идентификатора на 10 лет, как написано в документации?
Не удается получить доступ к переменной среды в функции Lambda
Что лучше по производительности при запросе данных 50 ГБ? Это MYSQL SELECT с условием или Dynamodb SCAN с выражениями FiLTER?
Ошибка Cors с AWS Lambda и .Net Core WebAPI


06.07.2019 11:20
Другие вопросы по теме
Удаление всех документов в коллекции путем сравнения индекса даты с текущей датой
Как подсчитать количество дубликатов для каждой страны с помощью мангуста?
Concat с последующим сохранением в Mongoose ничего не делает
Используйте $match для полей из двух отдельных коллекций в агрегированном запросе mongodb
Условие соответствия документа запроса mongodb во всех элементах массива?
Express - JWT Cookie не сохраняется в браузере
Как я могу сделать модель комментария с помощью мангуста?
Значения Push/Pull для вложенного массива мангуста
Mongoose предотвращает дублирование идентификационных номеров на основе document.count()
Хуки не работают на updateOne при использовании Typegoose только для сохранения вызываются операции
Похожие вопросы
Удаление всех документов в коллекции путем сравнения индекса даты с текущей датой
Как мне запустить проект Angular nodejs и MongoDB, загруженный с Github, в моем браузере?
Как подсчитать количество дубликатов для каждой страны с помощью мангуста?
Получить документы с соответствующими значениями в заданном поле в mongodb
Используйте $match для полей из двух отдельных коллекций в агрегированном запросе mongodb
Правильный способ использования MongoDB node.js `insertMany`, чтобы он не блокировался
Пул соединений в MongoDB с джонго
Условие соответствия документа запроса mongodb во всех элементах массива?
Непрерывно запускать конвейер агрегации MongoDB
Node mongo подсчитывает элементы запроса


 16.07.2019 03:31
Другие вопросы по теме
Фильтр MongoDB Compass (запрос)
Как получить данные из адреса состояния/проверить из пилы
Как применить $setunion для этой агрегации?
Spring mongo - сумма полей из массива и проверка больше, чем
Запрос на исключение пустых значений, но я получаю их
Повторное использование соединения в пуле соединений с базой данных
Как я могу использовать оператор $out после $inwind в MongoDB
Создание универсального делегата с использованием отражения
Nodejs: должен ли запрос поиска для выбора n последних записей выполняться асинхронно
Проблемы при создании приложения mangodb с Spring Boot

Похожие вопросы

Пакетный скрипт для переименования файлов «.txt», используя «дату», найденную в файле
Как правильно разделить server.js?
Как мне предотвратить событие, пока код не будет выполнен через импорт/экспорт?
Как сохранить только часть двойной кавычки в строке в Javascript?
Очистка результата html-страницы.. не в правильном порядке
IpcMain: event.reply не является функцией
При импорте почты sendgrid она не работает
Функция отлова ошибок по параметрам, которую мы передаем в качестве аргумента
Discord.js Бот, который говорит что-то на канале, который выбирает пользователь
Как прервать вставку коллекции метеоров в хук перед?

 
23.04.2018 18:20
Другие вопросы по теме
Кассандра: удалить последнюю запись со статическим столбцом
Запрос DynamoDB возвращает нулевые результаты
MongoDB - сбой подключения к графическому интерфейсу после обновления с бесплатной версии до M10?
Сортировать результаты get ()
Как сохранить текстовый файл NoSQL DB? Какой NOSQL мне следует использовать? Как интегрировать его с колбой в Python?
Как подключить приложение весенней загрузки с использованием hibernate и mongodb
Couchbase n1ql простое внутреннее соединение с использованием неключевых элементов
Restdb.io запрашивает родительский дочерний массив, получает все, где адрес электронной почты клиента jos@gmail.com
Как присоединиться к запросам (а не коллекциям) в MongoDB?
Appengine ndb динамический выбор
Похожие вопросы
Отправка во вложенный массив в Mongo с Laravel
Как использовать mongodb и mysql вместе в веб-проекте SpringMVC
Mongo Connector не синхронизируется должным образом
Набор Mongo DB не работает
Вызов вложенных разделов в Mongo DB
Связь между коллекцией mongo DB (заполнение)
Как разобрать документ на Json - драйвер Mongo scala
Ember получает данные из MongoDB с помощью NodeJS
Как отсортировать числовое поле по номеру в MongoDB?
Как получить данные из одного поля схемы в другое новое поле схемы


 17.04.2020 07:12
Другие вопросы по теме
CosmosDb: канал закрыт
Оптимизировать MySQL для запросов с регулярными выражениями или лучшую DMBS для более быстрых запросов с регулярными выражениями?
Анализ временных рядов с помощью искры
Как использовать Mongodb mapReduce для выбора?
NodeJS: обработка транзакций с базами данных NoSQL?
Ubuntu - Установка ScyllaDB - Отсутствует дополнительный пакет libsystemd (или libsystemd-daemon) - Неверная версия GCC. Scylla требуется GCC> = 7.3 для компиляции
Найти документ по частичному строковому значению внутри элемента массива в MongoDB из Azure
OOAD и Кассандра. Как?
Обновить предыдущие записи в Mongo (лучшая практика)
Firestore запрашивает много документов
Похожие вопросы
Добавьте текст с 1-й строкой, который записывается во внешний файл
DocuSign C# REST API Прикрепление документов с подписывающими сторонами к существующему конверту
Игра WPF C# Hangman: заполните недостающие буквы
Как поделиться списком объектов, не давая возможности изменять их состояние?
Реализация абстрактного свойства Enum в дочернем классе
Проблема с IOC в .NET.Core 2.0 для неизвестного конструктора
Как WPF решает те же проблемы с ElementName?
Как получить весь текст заголовка из datagrid в wpf C# с помощью кода позади
Доступ к QueryString, значениям параметров маршрута в .net core webapi
Log4net не регистрируется после выпуска как приложение Winforms ClickOnce


 19.01.2020 13:52
Другие вопросы по теме
UnhandledPromiseRejectionWarning: ValidationError
Юнит-тест node.js мангуст мокко чай синон
Не может установить значение «подтверждено» в значение «истина» при подтверждении электронной почты с помощью jwt и mongoose
Ошибки мангуста при заполнении
Запретить изменение поля с помощью схемы Mongoose
Mongoose, findByIdAndUpdate, Обновить все, кроме одного?
Удаление поддокумента mongodb в определенную дату
Как обновить строку и отключить какое-то поле
Mongoose Извлекает объекты по значениям их свойств из массива (возможно, пустого)
Слияние массивов из нескольких документов MongoDB
Похожие вопросы
Ошибка: не удается найти модуль ieee754 - при выполнении команды lb в Loopback js
Ошибка при использовании vue create my-project: неожиданный конец ввода JSON во время синтаксического анализа
Как изменить html файл на основе параметров запроса
Mac OS X, Node устанавливается Nvm, но не может использовать модуль, установленный глобально
UnhandledPromiseRejectionWarning: ValidationError
Подколлекции firestore добавляют nodejs, которые не работают
Как отладить зависший экспресс-сервер?
Как извлечь текст с помощью Cheerio
Цикл пропуска записи в базе данных Mongo
Node.js: Juggling Async (Learnyounode). Рекурсия в функциях обратного вызова не работает должным образом


 01.06.2018 16:03
Другие вопросы по теме
Клонирование коллекции mongodb из Rails Mongoid
Совокупный счетчик условий сопоставления элементов массива
Сопоставление массива координат в запросе MongoDB
$ concat с полями поиска?
Получить только вложенный объект из MongoDB с помощью Spring Data mongoDb или шаблон mongo
Условное определение того, работает ли сервер Node внутри контейнера Docker
Запрос не учитывает диапазон дат, переданный в параметрах
Сравнение значения из переменной со значениями из данного столбца, чтобы проверить, существует ли значение в MongoDB
Объединить поля массива в одно поле массива mongo
Отображать субмассив документа в MongoDB в виде таблицы в php

Похожие вопросы

Как работать с node.js и Dialogflow
Node js динамически требует выдачи страниц
Как проверить, аутентифицирован ли пользователь в Firebase и Express / Node.js?
Couchbase: ошибка: невозможно выполнять операции с ведром выключения
Рабочий процесс разработки Reaction NodeJS
Как преобразовать строку или данные в QR-код в Node Js
Использование импорта es6 вместо require в node.js
Обещание внутри для каждого
Невозможно установить узел с помощью nvm в Windows
Используйте node js за корпоративным прокси

Использование базы данных для приложения Node.js, которое запускается в терминале


18.06.2018 07:55
Другие вопросы по теме
Как создать ребра сразу после вставки вершины в одном SQL-запросе в OrientDB?
MySQL - выберите из 2 таблиц, где пара столбцов в результате должна быть основана на условном выражении
Выбрать данные из JSON
Подсчет экземпляров и отображение в новом столбце с SQL
Стандартный SQL Google BigQuery - предложение IN работает в BigQuery, но не в командной строке
Как использовать "ORDER BY FIELD" для сортировки результата SQL
SQL INNER JOIN несколько таблиц и столбцов
Операторы SQL JOIN с GROUP BY
Вставленное значение оставалось равным 0
Как предоставить Select для ВСЕХ таблиц во ВСЕХ базах данных на сервере?
Похожие вопросы
Python3 opencv не сохраняет читаемое видео
Как пропустить или игнорировать строки над заголовком?
Как получить clientx при обновлении аудио
Angular 2 использовать пакет javascript в машинописном тексте
Почему я получаю сообщение 406, не принимаемое сервером в статусе на стороне клиента, и даже мой контроллер Spring не вызывает?
Любопытство по поводу синтаксиса реакции (?) Или javascript
Javascript Android Chrome прослушивает, чтобы выбрать событие изменения
Расширяемый div laravel 5 jquery
Мангуст не присоединяется к двум коллекциям
Разница в поведении стрелочных функций и функций в Javascript


 27.07.2018 17:26
Другие вопросы по теме
Избегайте наличия более 1500 столбцов в таблице Postgres
Как эффективно хранить общую статистику посещений для истории пользователей?
Как сохранить синхронизацию таблиц в другой базе данных?
Включите таблицу обзоров в схему базы данных
Как хранить ответы API произвольной структуры в DynamoDB
Дизайн базы данных: перечислить все комбинации или использовать матрицу
Нормализация с помощью столбца имеет избыточность и полностью зависит от первичного ключа
Ограничить данные одной таблицей в базе данных быстрее или менее интенсивно?
Как создать базу данных для службы чата, которая хранит историю
Предложение / обратная связь по дизайну базы данных для отслеживания рабочего задания на нескольких станциях
Похожие вопросы
Сколько типов плоских файлов мы можем использовать в SQL-Loader в Oracle?
Что произойдет в модели RPC, если результат не будет распакован на клиентской заглушке?
Laravel получение данных из базы данных занимает слишком много времени
DateTime не вставляется в базу данных с помощью jsp
Какова стратегия непрерывного резервного копирования БД
Веб-сайт вылетает в одной сети, но работает везде
Избегайте наличия более 1500 столбцов в таблице Postgres
Неопределенная ошибка Laravel при получении данных из базы данных
Соединение ODBC с MS Access в Ruby (.accdb)
Отдельные пути чтения / записи базы данных в Dropwizard / JDBI

Plan
Duration → 60 minutes minimum (2 hours is better)

What do these 12 programming languages say about you?
Tell me what your favorite language is, and I’ll tell you who you are.
medium.com

Phases
0–5 (10min) → introduction, General Questions
5–30 (25min) → Tech Knowledge
30–55 (25min) → Coding question
55–60 (5min) → Wrap-up
5 must-haves to get high-quality code with an offshore developer!
You tried hiring an Indian developer, and received the first deliverables, they were terrible. Sounds familiar? Your…
medium.com

General
Introduction. A couple of minutes about what you’re most interested in and excited about.
Tell me about your previous most exciting task.
Tell me about a tech project you’ve worked on in your spare time.
What are the benefits and the drawbacks of working in an Agile environment?
Did you perform code reviews? How do you approach code reviews and which process do you follow? Please send examples (3–4) of your code review comments.
Have you ever been assigned a task you were not familiar with? How did you handle it?
JavaScript, TypeScript:
What is the difference between == and ===? What to use when?
Difference between var, let & const? What to use when?
What is bind, call, apply and what's the difference?
What is Typescript? Why use it over JavaScript?
What are Generics?
How do you use TypeScript on Node.js projects?
What is the difference between arrow function and normal functions?
Node
Are you familiar with child_process module? What is it?
What is the difference between spawn and exec, forks? What are use cases?
Is there any reason to use child_process for intensive i/o work?
Worker threads, cluster module? What are use cases?
Why are top-level variables not global in modules?
What are cyclic module dependencies in Node?
When is it acceptable to use synchronous filesystem methods (like readFileSync)? Why do we use async usually?
What will the Node app do when the call stack and event loop queues are empty?
Coding is outdated, learn AI prompts
Code is only a transient way of communication between humans and machines in computer history, the future of coding is…
medium.com

Data structures
Which data structures did you recently use?
Difference between Array and HashMap (Dictionary)?
Speed of Insert/Access/Delete operations in Array and HashMap? Provide Big O for those operations.
MongoDB and Redis:
Why use MongoDB instead of SQL?
How do we typically model data in MongoDB? → embedded documents VS different collections, access pattern design, etc
How to search for complex nested and linked data in MongoDB? Give examples of previous experience with complex aggregates.
How to debug a slow aggregate in MongoDB?
What are use cases for Redis?
Can we expire a record from Redis?
SQL
Which SQL database did you use? Which do you prefer and why?
What is denormalization? When do we need it? What are the normal forms?
How to query data from two tables in a single query?
What is the difference between LEFT and RIGHT joins?
How do we debug a slow SQL query?
How do we fix a slow SQL query?
Microservices
How would you implement transactions in microservices architecture?
How would you implement communication between microservices?
How a single developer dropped AWS costs by 90%, then disappeared.
It’s Christmas and I just finished my last audit of a SaaS client. His story is worth telling. It’s a story about…
medium.com

React
What is Virtual DOM?
Did you work with SSR in React? How does it work?
What are fragments in React?
What are the rules of React hooks?
How to debug react app?
How can we pass data from one component to other components in React?
What is the most complex component have you ever made?
Have you ever used portals, render props, refs other React features?
CSS, HTML
What’re the difference between block, inline and inline-block elements?
How do you write CSS? Using some methodologies like Atomic CSS, or BEM? Or using Styled Components?
How do you specify units in the CSS? What are the ways to do it?
What is a CSS preprocessor?


Вопросы для Junior

1. Назовите основные принципы ООП.

2. Что такое наследование, инкапсуляция, абстракция, полиморфизм: приведите примеры (желательно из собственного опыта). От какого класса неявно наследуются все классы в .NET? Разрешено ли множественное наследование в C#?

3. Что такое рекурсия?

4. Что такое лямбда-выражение?

5. Что такое параллельное программирование (многопоточность) и его назначение? Какие классы используются?

6. Что такое JSON?

7. Как вы понимаете REST?

8. Расскажите о SPA concept.

9. Какие GoF-паттерны использовали?

10. Какая разница между GET и POST HTTP методами?

11. Какую проблему решает Docker? Каковы его плюсы и минусы?

12. Чем принципиально отличаются unit-тесты от интеграционных тестов?

 
Обработка исключений

13. Что такое Exception?

14. Для чего служат try, catch, finally? В каком случае может не выполниться блок finally?

15. Что такое call stack? Какие ключевые слова вы знаете?

 
Платформа .NET

16. Что такое ASP.NET?

17. Какие существуют типы Action filters?

18. Что такое Web Service?

19. Что такое CLR?

20. Что такое сборщик мусора (Garbage Collector) на базовом уровне?

21. Что такое делегат?

22. Отличается ли Delegate от Action?

23. Что такое LINQ и для чего используется? Приведите несколько примеров применения LINQ.

24. Что такое пространство имен (namespace) и зачем это нужно?

 
Типы данных, коллекции и структуры данных

25. Какие типы данных вы знаете?

26. Какие примитивные типы знаете?

27. Что такое Nullable-тип?

28. Что такое тип значения, а что такое тип ссылки? Что из этого class, а что struct? В каком участке памяти они хранятся?

29. Чем отличаются value от reference type? String - это reference или value?

30.В чем отличие между string builder и string?

31. Что такое дженерики? Какие проблемы они решают?

32. Что такое boxing / unboxing?

33. Что такое Array, List, HashSet, Dictionary? Приведите примеры использования этих структур данных. Какая сложность операций с ними (поиск, вставка, удаление)?

34. Какие знаете коллекции?

35. Что делает оператор yield?



Классы, структуры и интерфейсы

36. Что такое класс?

37. Чем отличается класс от абстрактного класса?

38. Чем отличается абстрактный класс от интерфейса? Для чего нужны интерфейсы и какие задачи они выполняют?

39. Какие вы знаете модификаторы доступа?

40. В чем разница между обычным классом и статическим?

41. В чем разница переопределения метода между ключевыми словами new и override?

42. Какое различие между const и read only?

43. Разница между структурой и классом. Приведите примеры структур.

44. Может ли экземпляр структуры храниться в куче (heap)? Как это сделать?

 

Асинхронность

45. Что такое асинхронность и чем она отличается от многопоточности?

46. Какие есть ключевые слова для использования асинхронности в коде?

47. Что означают ключевые слова async / await?

 

Базы данных

48. Разница между реляционными и нереляционными базами, плюсы и минусы использования обоих вариантов.

49. Что такое индексы в RDBMS?

50. Какие типы JOIN существуют в SQL?

 

Тестирование

51. Для чего нужны unit-тесты?

52. Какие преимущества и недостатки использования unit-тестов?

53. Из каких трех логических блоков состоит unit-тест?

 

Вопросы для Middle
 

Общее

54. Вы набираете google.com в браузере. Расскажите как можно подробнее, что происходит в это время на HTTP-уровне?

55. Как работает HTTPS?

56. Как вы понимаете SOLID?

57. Какие протоколы сериализации вы знаете и где они применяются?

58. Что такое в вашем понимании чистая функция? Какие у нее преимущества?

Выбери специальность и получи бесплатный доступ к курсам на 3 дня:
С чего начать?
Frontend Developer
Верстальщик сайтов
59. Что такое dependency injection и зачем оно нужно?

60. Что такое cohesion и coupling (связанность и связность)?

61. Что такое IaaS, PaaS, SaaS и каковы различия между ними?

62. Какие способы отладки программы вы используете?

63. Какие знаете паттерны? Объясните суть перечисленных.

64. В чем суть паттерна Singleton? Почему его еще называют антипаттерном?

65. Для чего нужен паттерн Strategy?

66. Какие ключевые различия между распределенными системами и монолитными?

67. Какие паттерны проектирования распределенных систем вы знаете?

68. Какие есть принципы работы Message bus? Почему могут возникать дубликаты в очередях?

69. Какие принципы построения идемпотентных сервисов знаете?

70. Расскажите, как работают асинхронные методы? Чем асинхронность отличается от параллелизма?

 

Платформа .NET

71. Какие исключения нельзя остановить в блоке catch?

72. Какая разница между .NET Standard Class Library и .NET Core Class Library?

73. Объясните разницу между отложенным и немедленным исполнением в LINQ. Приведите примеры.

74. Для чего нужен метод ConfigureServices в Startup.cs?

75. Какая разница между services.AddTransient и services.AddScope в ASP.NET Core?

76. Что такое Kestrel?

77. Опишите ASP.NET MVC request pipeline.

78. Как в ASP.NET WebAPI настроить кэширование ответов на HTTP-запросы?

 

Управление памятью

79. Что такое куча и стек? Различия, принцип работы.

80. Как работает сборщик мусора?

81. Зачем нам зарезервированное слово using в C#, если в .NET есть автоматическое управление памятью? Как с этим связан disposable-паттерн и зачем такой сложный паттерн для managed и unmanaged ресурсов?

82. Какие особенности работы с Large Object Heap?

 

Типы данных, коллекции и структуры данных

83. Когда генерируется дженерик-класс конкретного типа - при выполнении программы или во время компиляции?

84. Что такое рефлексия?

85. Расскажите о коллекции LinkedList <T>. Чем она отличается от других коллекций?

86. Что такое индексатор?

87. Что такое immutable object? Какие преимущества дает использование immutable object? Предложите способ реализации его в .NET.

88. Когда использовать StringBuilder, а когда string? Как работает StringBuilder?

89. Что такое балансирование деревьев?

90. Что такое Key-value структуры?

100. Что такое хэш-функция и зачем нужны хэш-таблицы?

101. Какими свойствами должна обладать идеальная хеш-функция?

102. Что такое коллизии и как с ними бороться?

103. В чем заключается сложность CRUD-операций в Dictionary <K, V> в .NET?

104. Где хранятся массивы? Массивы примитивных типов?

105. В чем отличие между массивом (T [ ]) и списком (List <T>)?

106. В чем разница между IList <T> и IEnumerable <T>?

107. Зачем нужны Enumerable, Observable, AsyncEnumerable и какие модели получения данных они реализуют?

108. В чем разница между IEnumerable и IQueryable?

109. Что такое enum flags?

 

Базы данных

110. Расскажите о нормальных формах в СУБД.

111. Что такое индекс в БД?

112. Когда следует использовать индексы? Преимущества и недостатки.

113. Какие типы индексов существуют? Чем они отличаются?

114. Что такое ACID?

115. Какие вы знаете уровни изоляции транзакций?

116. Что такое план выполнения запроса (execution plan) в MS SQL?

117. Проблема: запрос долго выполняется. Какие есть методы ее диагностики и решения?

118. Как ORM (Entity Framework или Entity Framework Core) транслируют C# код в язык запросов базы данных? Что для этого используется?

 

Параллелизм

119. Для чего использовать Task.ConfigureAwait?

120. Например, есть веб-сервер, который по HTTP-запросу делает выборку из базы данных. Всего на сервере 16 тредов (threads). Каждый HTTP-request выполняет запрос в базу и ожидает результатов, в этом случае тред блокируется. Можно ли оптимизировать эту работу средствами .NET?

121. Зачем нужен ThreadPool? Опишите механику работы: как поток выделяется и возвращается обратно в ThreadPool.

 

Вопросы для Senior
 

Общее

122. Какие ещё практики, кроме ООП, использовали (AOP, FP и т. д.)?

123. Назовите три самые сложные проблемы, которые вам приходилось решать. Как вы это сделали, как пришли к этому решению?

124. Что такое слабосвязанный код? Чем он лучше сильносвязанного кода? Как бы вы достигали более слабой связности кода?

125. Использование статических классов повышает или понижает связность кода?

126. Как можно измерить performance кода? Влияет ли факт замеров на производительность?

127. Для чего используются и как работают multi-stage билды в Docker?

128. Как понять, что какая-то часть кода утилизирует много памяти или долго выполняется? Что может быть ботлнеком в разных случаях? Какие есть способы уменьшения памяти и трафика памяти?

129. Как бы вы реализовали cross-cutting concern (например, логирование, валидация, транзакции)?

130. Расскажите о Rest Maturity Model.

131. Что такое CPU и IO-bound задачи?

132. Что такое маршалинг?

133. Как работает async / await (подробно)? Почему нельзя использовать async void методы?

 

Платформа .NET

134. Как работает lock? Можно ли использовать структуры внутри выражения lock?

135. Что такое Expression Tree?

136. Как работает сборщик мусора (подробно)? Почему в GC три поколения, а не, скажем, пять, десять или два?

137. Как бы вы организовали трассировки Web API сервисов?

138. Как в .NET Core можно настроить хранение секретов на компьютерах разработчиков и на рабочих средах?

139. Как бы вы организовали процесс CI/CD .NET Core сервисов для их деплоймента в облачную инфраструктуру?

140. Как включить CORS в AspNetCore?

 

Типы данных, коллекции и структуры данных

141. Как реализованы дженерики?

142. Как создать собственный immutable-тип?

143. Как работает IEnumerable <T> (подробно)?

144. Какой алгоритм использует коллекция STACK?

145. Какие структуры данных вы реализовывали сами для платформы .NET? Расскажите, чем они отличались от стандартных реализаций.

146. Чем отличается интерфейс от абстрактного класса? В каких случаях вы использовали бы и то, и другое?

147. Почему в структуре нет конструктора по умолчанию?

 

Базы данных

148. Как БД сохраняет данные?

149. Какие типы БД вы знаете?

150. Как и когда БД лучше использовать?

151. Что такое денормализации?

152. Когда и какие уровни изоляции транзакций можно использовать?

153. Как в популярных СУБД реализованы принципы ACID (SQL Server, PostgreSQL и т. д.)?

154. Приходилось ли вам оптимизировать запрос в БД? Если да, то как?

155. Опишите, какие вы знаете потенциальные проблемы, связанные с параллельными запросами к БД.

156. Какую базу данных вы бы использовали для реализации distributed lock механизма? Расскажите детали реализации.

 

Микросервисы

157. Какую проблему решают микросервисы?

158. Какие есть способы коммуникации микросервисов?

159. Расскажите варианты реализации распределенных транзакций в микросервисах.

160. Что такое circuit breaker?

161. Каким образом вы будете налаживать систему, состоящую из множества микросервисов, если нужно отследить полный путь обработки запроса?

162. Что такое брокеры сообщений? Что такое at-least-once, at-most-once семантика? Есть ли какие-то брокеры, которые гарантируют exactly-once семантику?

163. Как должен работать код клиента брокера в зависимости от выбранной семантики?

164. Какие инструменты для работы с очередями вам известны (как в .NET, так и отдельные продукты), какой инструмент/продукт вы бы выбрали и почему?

 

MS Azure

165. Какие виды сервисов бывают в Service Fabric?

166. Какие особенности и ограничения Azure Table Storage?

167. Как бороться с проблемой холодного старта в Azure Functions?

168. В чем отличие очередей и топиков в Azure Service Bus?

