Вся команда ушла
команда обанкротилась
проект закрылся, так вышло 

Оригинал java 
Личный вклад, достижение, а не команда.
К каждому вопрсу + факт ситуации с работы (кейс), на работе.

Закрытие боли вакансии: Много говорить и по делу. 
Активнее рассуждать вслух (поток мыслей)
Интересно и ёмко. 
Задачи и требования + проекты. 
Теория + кейсы.
  
  
От Топ java разработчмка


Я работаю java разработчиком более 3х лет. 
  Последние 1,5 лет я работаю в компании "Company Name".
  Изначально пришла туда мидлом, и доросла до senior (сеньёра).
Компания, в основном, занимается, ....
  ... Много проектов и команд.
  Конкретно я работала в команде, занимающейся разработкой (системы для отслеживания посылок).
  Т.е. когда приходишь отправлять посуду в сдэк, (описание проекта), мененджер вводит данные в нашу систему. 
  Когда он отправляет заявку, то заявка обрабатывается уже другими менеджерами.
  И мы вот делали эту систему, чтобы визуализировать все данные по посылке, постоянно обновлять статус и бымтро реагировать на любые изменения.
  По большей части в команде (личный вклад) Я занимался работой с геоданными, с картами и полигонами. Также залезала в другие части проекта. 
  Делала отчёт, документооборот, рааботала со статусной моделью. 
  Каждый член команды у нас был довольно универсален.
  При этом каждый был экспертом в своей части, на которую он посвящал большую часть времени. 
  
  Архитектура у нас микросервисная,  проект высоконаруженный. Также у меня есть опыт менторинга, 
  я успешно заонбордила двух новых ребят в проект. 

  Стек у нас стндартный, java, postresql, kafka, reddis. docker, kuber

  Команда у нас состочла из 12 человек. 3 бэкендера, 3 фроентендера, 2 аналитика, 2 тестировщика, тиилид и продакт-менеджер + devops , но рне командный,
    а между проектами.

    Работали ппо стандартному скраму (процессы) двухнедельными спринтами, мне вообще проект и команда нравились (ппричина),
    но в it сейчас кризис, и компания начала затягивать пояса. 
Некоторым членам команды Она (компания) предложила уйти по соглашению сторон с 3мя окладами, в том числе и мне. 
    При этом руководствовалась она не продуктивностью сотрудника, а временем работы на проекте. 
    Сейчас у нас на проекте ростаются только старички, которые работают уже 4-й год.
(почему и ищу работу)
    В связи с этим пришлось выходить на рынок, нужно работать. Вот и увидел Вашу вакансию (чем понравилпсь)
      Она мне понравилась тем, что вы также работаете с геоданными, у вас современный и актуальный стек, микросервисная архитектура и также высоконагруженный проект. 
        Мне это очень понравилось.
        Стек сильно похож на тот, гден я и работал. 
        Если ндо рассказать подробнее, болле детально, говорите, расскажу!
 (личный вклад)
