От Топ java разработчмка


Я работаю java разработчиком более 3х лет. 
  Последние 1,5 лет я работаю в компании "Company Name".
  Изначально пришла туда мидлом, и доросла до senior (сеньёра).
Компания, в основном, занимается, ....
  ... Много проектов и команд.
  Конкретно я работала в команде, занимающейся разработкой (системы для отслеживания посылок).
  Т.е. когда приходишь отправлять посуду в сдэк, (описание проекта), мененджер вводит данные в нашу систему. 
  Когда он отправляет заявку, то заявка обрабатывается уже другими менеджерами.
  И мы вот делали эту систему, чтобы визуализировать все данные по посылке, постоянно обновлять статус и бымтро реагировать на любые изменения.
  По большей части в команде (личный вклад) Я занимался работой с геоданными, с картами и полигонами. Также залезала в другие части проекта. 
  Делала отчёт, документооборот, рааботала со статусной моделью. 
  Каждый член команды у нас был довольно универсален.
  При этом каждый был экспертом в своей части, на которую он посвящал большую часть времени. 

  
  (личный вклад)
