---------------------------------------------------------------------------------------------
[НЕУДОБНЫЕ/КАВЕРЗНЫЕ ВОПРОСЫ]:
----------------
⋙ ❍ Назовите одну сложную проблему, решение которой доставило вам удовольствие? ✔

⋙ ❍ Перечислите свои три сильные стороны? ✔

⋙ ❍ «Каковы ваши самые сильные стороны?» ✔

⋙ ❍ «Какие у вас слабые стороны?» ✔

⋙ ❍ «Как вы решаете конфликты в команде?/Как вы справляетесь с конфликтными ситуациями?» ✔

⋙ ❍ Что вас интересует в этой должности? ✔

⋙ ❍ Как обеспечить эффективное общение с членами команды? ✔

⋙ ❍ Какие планы, что попробовать, изучить? ✔

⋙ ❍ Как был организован производст. процесс, рабоч. день? ✔

⋙ ❍ Система контроля версий/Что ставили в качестве контроля версий? ✔

⋙ ❍ Как сливали результат работы? ✔

⋙ ❍ Что вы узнали о нашей компании? ✔

⋙ ❍ Есть ли у вас опыт работы в команде? ✔

⋙ ❍ Были ли вы раньше наставником младшего разработчика? ✔

⋙ ❍ «Почему вы ушли с предыдущего места работы?» ✔

⋙ ❍ «Как складывались отношения с коллегами и руководством на предыдущей работе?» ✔

⋙ ❍ «Почему вы хотите работать в нашей компании?» ✔

⋙ ❍ «Кем вы видите себя через пять лет?» ✔

⋙ ❍ «Почему вы считаете, что подходите для этой позиции?» ✔

⋙ ❍ «Какой последний промах вы допустили в своей работе?» ✔

⋙ ❍ Как вы справляетесь с трудными членами команды? ✔

⋙ ❍ Какие системы контроля версий вы знаете? ✔

⋙ ❍ Как вы справились с разногласиями с начальником или коллегой? ✔

⋙ ❍ Какие ресурсы вы используете для получения последней информации о разработке и дизайне интерфейса? ✔

⋙ ❍ Что вы больше всего любите в ваших инструментах разработки? ✔

⋙ ❍ Кто из фронтенд-сообщества вас вдохновляет? ✔

⋙ ❍ Какая ваша любимая “фишка” Internet Explorer? ✔

⋙ ❍ Какой кофе вы предпочитаете? ✔

⋙ ❍ Что вас привлекает в программировании? ✔

⋙ ❍ С какой технической сложностью вы недавно столкнулись и как с ней справились? ✔

⋙ ❍ Какие методы для повышения производительности вы использовали при создании или обслуживании сайта? ✔

⋙ ❍ Можете ли вы описать некоторые методы SEO, которые вы использовали в последнее время? ✔

⋙ ❍ Можете ли вы объяснить общие принципы относительно фронтенд-безопасности или недавние проблемы, которые вы решили? ✔

⋙ ❍ Какие действия вы лично предприняли в недавних проектах для повышения удобства использования вашего кода? ✔

⋙ ❍ Расскажите о предпочитаемой среде разработки? ✔

⋙ ❍ С какими системами контроля версий вы знакомы? ✔

⋙ ❍ Можете ли вы описать порядок действий при создании новой веб-страницы? ✔

⋙ ❍ Каков ваш опыт в облачных вычислениях? ✔

⋙ ❍ Работали ли вы с какими-либо другими контейнерными технологиями? ✔

⋙ ❍ С какими программными платформами вы имеете наибольший опыт работы? ✔

⋙ ❍ Как вы участвовали в проекте Docker в прошлом опыте работы? ✔

⋙ ❍ У вас есть какие-нибудь личные проекты? Какого рода? ✔

⋙ ❍ Если вы присоединились к проекту, где для форматирования используются табы, а вы привыкли использовать пробелы, как вы поступите? ✔

⋙ ❍ Если бы вы могли освоить одну технологию в этом году, что бы это было? ✔

⋙ ❍ Какие действия вы лично предприняли в последних проектах, чтобы сделать код более удобным для сопровождения? ✔

⋙ ❍ Можете ли вы описать некоторые из лучших практик или методов SEO, которые вы использовали в последнее время? ✔
