---------------------------------------------------------------------------------------------
[МОИ ВОПРОСЫ]:
---------------------------------------------------------------------------------------------
(Мои Топ вопросы в 5% лучших кандидатов):
---------------------
✎ Nlp приём, на 3+ собесе сработает, внимательно запомнить ответ!
✎! Поклониться головой и Обращаться к человеку по имени - знать имя тим лида!!!:
✎! Узнать ценности компании заранее и обсудить их
✎! must have/категорически неприемлемо: работать с 9-18.00 и ходить в офис каждый день
✎! should have/неприятно, но есть перевес в плюсы: дмс для меня и моей семьи
✎! nice to have/приятные, но необязательные
✎! При задачах всегда задавать уточн. вопросы, молча писать - это сразу минус
✎! После вопросов тимлиду, тогда и писать код
✎! Спросить про тесты, сразу или после? (сначала код, потом тесты)
---------------------------------------------------------------------------------------------
✎! Научится хорошо говорить
✎! Спросить, кто лид на проекте и просить ссылку на портфель! (в команду к человеку)
✎! Загуглить имя конторы, изучить ценности компании кратко (как мини конституция), 3, 4, 5 пунктов (так делают 5% кандидатов)
✎! Взять ценность 1/5 из компании - подготовить рассказ, что это значит для тебя
- Я погуглила и для каждой я смогу вам что-ниб. рассказать!
✎! 1. N рассказ, как это для меня, и готовый рассказ отрепетировать, читать 50/50
✎! 2. На каждую ценность небольшой рассказик - ответить по каждому пункту !
✎! При повед. интервью 3 раза надо произвести wow - эффект (желательно!, тогда тебя запомнят)
✎! Быть в курсе ценностей компании, быть в курсе о сфере
---------------------------------------------------------------------------------------------
✎! Подготовить 3 вопроса работодателю:
✎!work-life balance?
✎! Какой график, мониторинг рабоч. часа, estimate?
✎! Если не успеваю?
✎! Программы слежения за рабочим столом (строго нет)?
✎! форма, соц. пакет, оформление, расположение офиса, сколько раз и надо ли приезжать?
✎! Задержки и частота?
---------------------------------------------------------------------------------------------
➥ Представьте, что я нанята на эту работу, что вы мне посоветуете, чтобы я была успешна в течении 1-3 месяцев?
➥ Как вы видите идеального кандидата на эту роль?
➥ Какие задачи даёте на испытательный срок?
---------------------------------------------------------------------------------------------
(Мои вопросы Hr об условиях работы):
---------------------
✎ Стоит спросить, есть ли место, где можно "тихонько посидеть и поработать", потому что бегать из переговорки в переговорку не лучший вариант.
✎ Если придется все-таки сидеть в общей комнате, то стоит изучить, где вы будете сидеть, чтобы не оказаться рядом с сотрудниками, работа которых связана с общением голосом.
✎ Зп - называть средний уровень зп! (уметь аргументировать высокую зп)!
-----
➥ В каком формате проходит тех. интервью?
➥ Можно ли работать удаленно из дома?
➥ Сколько времени я буду проводить в офисе или работать из дома и сколько в командировках?
➥ Будут ли оплачиваться такие командировки и как?
➥ Если работа в офисе (и вам так хочется), уточнить, есть ли отдельный кабинет (личный(для любителей тишины) или для команды) или офис открытого типа (open office), общее пространство с переговорками?
➥ Если в таком пространстве есть какие-то большие комнаты, в которых можно работать командно(+)?
➥ Насколько гибкий график работы?
➥ Есть ли какое-то формальное время работы, когда вы должны быть "онлайн"?
➥ Если такое имеется, насколько можно от него отходить (пропасть на пару часов в обед, приехать попозже и т.д.).
➥ Нужно ли "отмечаться" об отсутствии (достаточно ли кинуть сообщение в общий чат или нужно какое-то формальное одобрение начальника)?
✎ Возможно, вам будет предоставлена полная свобода, и вы сможете работать когда угодно, если задачи будут закрываться, но хорошо это уточнить.
➥ Ведется ли учет времени работы разработчика?
✎ Например, по контракту вы работаете 40 часов в неделю, но ведет ли работодатель учет отработанного вами времени? Достаточно ли вести учет времени в системе управления проектом?
➥ Как дела с переработкой?
➥ Как часто приходится перерабатывать?
✎ Посидеть выходные раз в год, когда залило серверную - это нормально, работать по 10 часов каждый день месяцами из-за нереалистичных обещаний начальства - нет. Оплачиваются ли переработки и как? Есть ли возможность взять отпуск в качестве компенсации за переработку? Здесь возвращаемся к вопросу об учете времени - как работодатель будет знать, что вы работали больше 40 часов в неделю и имеете право на доп. отдых?
➥ Дресс-код на работе?
➥ Какой длины испытательный срок?
✎ Как правило, это 1-3 месяца, но я видел случаи с 6 месяцами. Наличие такого длинного испытательного срока может быть подозрительным, и стоит задуматься. На испытательном сроке вас могут уволить с предупреждением за неделю или даже несколько дней (в зависимости от законодательства страны), что может быть неприятно, если имеются серьезные финансовые обязательства.
➥ Компенсация?
➥ Какие условия отпуска?
✎ Например, есть ли какие-то ограничения, когда можно брать отпуск. Возможно, будет нельзя (или "не одобряется начальством") брать отпуск в новогодний период, когда онлайн-магазин под нагрузкой и страшно, что все упадет, или в конце финансового года и так далее. Хорошо узнать, можно ли брать длинный отпуск (взять все дни подряд). Как происходит одобрение отпуска? Начальник кликает мышкой и готово? Или заявление идет длинной вереницей по череде начальников, каждый из которых не торопится отпускать вас на отдых? Хорошо понимать, может ли начальник отказать в отпуске и какие для этого могут быть причины. Есть ли возможность взять неоплачиваемый отпуск (случилась беда, и вы не можете работать месяц)?
➥ Какие условия больничных?
✎ Зависит от законодательства страны, но хорошо проговорить, чтобы не было сюрпризов. В некоторых странах болеть может быть очень дорого :)
➥ Выделен ли бюджет на образование?
✎ Если есть какой-то конкретный лимит на каждого инженера, то замечательно - вы сами можете решить, как его потратить (годовая подписка Pluralsight, O'Reilly Media или две конференции, например). Если оговоренного бюджета нет, то оплатит ли фирма покупку книг и курсов? Как выглядит процесс "давания добра" (начальник пишет "ок" в чате или опять череда заявлений и одобрений идет по бухгалтериям)?
➥ Кого вы ищете и т.п.?
➥ какие у вас критерии успеха?
➥ какие у меня будут перспективы?
➥ насколько большая команда?
➥ Как проходят процессы в компании?
➥ Продукт, команда, история?
➥ какая была самая сложная задача?
➥ трудовой день пошагово?
➥ Плавающее утро?
➥ Штрафы за опоздание?
➥ Задержки или overtime?
➥ чем занимается компания?
➥ Какая корпоративная культура в компании?
➥ Карьерный рост?
➥ Как будет выглядеть мой рабочий день?
➥ У кого именно я буду в подчинении?
➥ Почему это место оставил предыдущий сотрудник?
➥ В чем основная проблема или оссобенность вакансии, на которую я претендую?
➥ Будут ли переработки?
➥ Насколько важна эта работа для компании?
➥ Какие возможности имеются для профессионального роста?
---------------------------------------------------------------------------------------------
(Чего ждёт от вас руководитель, какие задачи нужно будет решать):
---------------------
➥ Как бы вы описали динамику вашей команды?
➥ Что вы можете сказать мне о людях, с которыми я буду работать?
➥ Кому я буду подчиняться напрямую и как бы вы описали их стиль управления?
➥ Что бы вы назвали самым большим успехом вашей команды?
➥ С какими еще отделами сотрудничает эта команда?
➥ Как ваша команда разрешает конфликты?
➥ Каковы самые сильные и слабые стороны этого отдела?
➥ Какова текучесть кадров в этом отделе?
➥ Есть ли у вас переработки? / или по-хитрому, как строится рабочий день разработчика?
➥ насколько жёсткие дедлайны?
➥ как вы определяете сроки?
➥ как происходит отчёт по проделанному?
➥ какие-то внезапные форс-мажоры, когда один разраб не успевает,или задерживается, уйти, если недоделал, как строго с этим?
➥ как вы отдыхаете?
➥ Кем вы видите себя через 5 лет?
➥ Участие в конференциях?
➥ Примеры реальных задач на последнем спринте [три примера задач в текущем спринте]?
➥ Какая команда?
➥ Включают ли трекер отслеживания времени?
---------------------------------------------------------------------------------------------
[Мои Вопросы о приёме на работу/офер]:
---------------------
➥ Каковы следующие шаги в процессе найма?
➥ К кому я могу обратиться с любыми вопросами?
➥ Если бы меня наняли на эту должность, когда бы я смог приступить к работе?
➥ Когда я могу ожидать услышать ваше решение по моему заявлению?
➥ Вас беспокоит моя квалификация?
➥ Что есть у других соискателей?
➥ Можете ли вы описать процесс адаптации?
➥ Вакансия открыта под расширение штата или на замену ушедшему сотруднику?
---------------------------------------------------------------------------------------------
[Мои Вопросы, если - стартап]:
---------------------
➥ какие бизнес модели у вашего стартапа?
➥ как работают опционы?
---------------------------------------------------------------------------------------------
[Мои Вопросы, если тимлид (серьёзн. компания и начальник) - ! спросить про бэкграунд у тимлида:
---------------------
➥ чем занимались ранее, в каких проектах и чем теперь в компании?
➥ какие у вас ожидания?
➥ какой вы начальник?
➥ как часто вы делаете релиз?
➥ как просто это у вас сделать, помогает ли вам ваш тест-coverage?
➥ на сколько процентов у вас тест-coverage в работе?
➥ резюмировать, что на ваш взгляд будет являться успехом, как вы будете оценивать мой успех?
➥ как мы с вами будем вместе работать?
➥ что для вас будет являться идеальным взаимодействием?
➥ как бы вы описали идеального кандидата на эту должность?
➥ как вы будете судить, хороша ли я в том, что вы требуете через 1 месяц, 3 месяца в качестве программиста на javascript?
➥ объектно-ориентир. программирование, как вы будете будете включительно судить, хорошо ли я программирую в ооп стиле?
➥ как вы собираете обратную связь от сотрудников?
➥ у вас написано в вакансии доп. знания ... того-то, насколько вы это применяете в работе на проекте?
➥ какой карьерный рост предполагается с данной позицией?
➥ как бы вы описали культуру в вашей компании (др. плоскость вопроса)?
➥ что вам нравится боольше всего, работая в этой компании?
➥ что можно было бы улучшить в вашей компании?
➥ как вы собираете обратную связь от сотрудников ,есть ли у вас какой-то процесс?
➥ а если у меня будет какая-то обратная связь для вас, к кому мне обратиться?
➥ могу ли я общаться запланировано 1 на 1 с моим старшим начальником?
➥ могу ли я попросить аудиенцию, запланировано ли это (уровень компании)?
➥ какой карьерный рост предполагается с данной позиции?
---------------------------------------------------------------------------------------------
[Мои вопросы о должности]:
---------------------
➥ Какие качества помогли бы мне добиться успеха на этой должности?
➥ Как часто я буду сотрудничать с другими на этой должности?
➥ Есть ли возможности изменить или расширить эту позицию?
➥ Кто основные люди, с которыми я бы регулярно общался?
➥ Какие задачи я бы выполнил в среднем за день?
➥ Что хорошего сделал человек, ранее занимавший эту должность?
➥ Какие изменения вы хотели бы увидеть в том, как выполняется эта работа?
---------------------------------------------------------------------------------------------
[Мои вопросы о производительности/эффективности на рабочей позиции]:
---------------------
➥ Как часто мой менеджер будет доступен для обсуждения моей работы?
➥ Можете ли вы описать формальный процесс оценки эффективности для этой должности?
➥ Как и как часто я могу получать отзывы о своей работе?
➥ Как я могу получить поддержку в постановке целей и ожиданий?
➥ Чего я должен достичь в первые 90 дней, если меня наняли на эту должность?
➥ Как эта компания или команда отмечает успех?
➥ Как вы оцениваете успехи своих сотрудников?
➥ Какие инструменты вы используете, чтобы найти недостатки в производительности вашего кода?
➥ Какие вы знаете способы улучшения производительности при скроллинге на вебсайте?
---------------------------------------------------------------------------------------------
[Мои вопросы о разработке]:
---------------------
➥ Эта компания отправляет сотрудников на конференции?
➥ С какими организациями сотрудничает эта компания для повышения квалификации своих сотрудников?
➥ Организует ли эта компания какие-либо волонтерские возможности?
➥ Предлагает ли компания какие-либо стимулы для обучения новым навыкам?
➥ Как эта компания остается конкурентоспособной в своей области?
➥ Спонсирует ли компания постоянное обучение своих сотрудников?
---------------------------------------------------------------------------------------------
[Мои вопросы об обучении на рабочей позиции]:
---------------------
➥ ! Можно ли ставить развитие soft skills в индивидуальный план развития?
➥ Можете ли вы описать процесс обучения на эту должность?
➥ Как продвинулись успешные сотрудники в этой компании?
➥ Предлагает ли эта компания частые возможности продвижения по службе или обучения на рабочем месте?
➥ Буду ли я иметь возможность следить за своими коллегами и узнавать о других ролях?
➥ Как работа на этой должности повысит мои навыки?
➥ Предлагает ли ваша компания дополнительное обучение для заинтересованных сотрудников?
---------------------------------------------------------------------------------------------
[Мои вопросы тимлиду/команде лично (Про проект и участие команды)]:
---------------------
✎ [Не бояться задавать вопросы!, иначе на работе будут проблемы, чтобы понять подходит ли компания.
✎ процесс переговоров (прозрачность их отношений и моя)].
✎ [изучать компанию и всю поднаготную !заранее, чтобы проверить их на обман].
---------------------------------------------------------------------------------------------
[Что можно и нужно спрашивать у компании, в которую вы претендуете]:
---------------------
➥ Какие продукты они производят?
➥ С какими технологиями они работают?
➥ Каков их режим работы? Скрам, Канбан, Водопад? Как долго длятся спринты и как часто выходят релизы?
➥ Как выглядит средняя команда? Сколько людей там? Back-end + Front-End + PO/PM + тестировщики?
➥ Общее мнение о людях, оборудовании и управлении?
➥ Как работа в этой компании способствует достижению ваших целей?
➥ Как бы вы описали свой стиль управления?
➥ Наставлял ли вас кто-нибудь в этой компании, и если да, то как они повлияли на вашу карьеру?
➥ Что самое интересное в вашей работе?
➥ Что самое сложное в вашей работе и как вы преодолеваете эти трудности?
➥ Как долго вы работаете на этой должности и почему продолжаете здесь работать?
---------------------------------------------------------------------------------------------
[Вопросы о корпоративной культуре (поможет вам определить, совпадают ли ваши ценности с потенциальным работодателем,
Что вы заинтересованы в том, чтобы познакомиться с другими людьми и стать частью сообщества)]:
---------------------
➥ Как эта компания продвигает свои основные ценности?
➥ В каких тимбилдингах участвует ваша команда?
➥ Каким образом эта компания поддерживает своих сотрудников?
➥ Есть ли в этой компании традиции на рабочем месте?
➥ Какие изменения вы увидели в этой компании за время работы?
➥ Каковы характеристики человека, который преуспеет в среде этой компании?
➥ Как команда, в которой я буду работать, поддерживает цели компании?
➥ Какое количество инженеров в компании, как они распределены по командам, сколько человек в моей команде?
➥ Есть ли возможность ! переходить с проекта на проект (или между продуктами/сервисами)?
➥ Какой компьютер у меня  будет и можно ли выбрать?
➥ Как выглядит ! мое рабочее место (в офисе)?
➥ Если работаете из дома, компенсирует ли компания обустройство домашнего рабочего пространства (покупку мониторов, например)? *
➥ Если из офиса, можно ли отовариться парочкой мониторов для рабочего места за счет фирмы?
➥ Можно ли участвовать в опенсорс-проектах (pet-проектах)?
✎ Достаточно подписать некоторое соглашение о том, что ваши проекты не помешают бизнесу компании (если вы работаете над платным приложением для учета финансов, то нельзя будет пилить такое же, но бесплатное приложение).
➥ Кто будет являться собственником продукта интеллектуальной деятельности, чтобы потом не было проблем с лицензией для вашего опенсорс-продукта/сервиса.
➥ Как проходят performance review, если такие есть, и как часто?
✎ Если такие оценки работы инженера проходят пару раз за год, то это нормально. Я бы насторожился, если ревью чаще 3 раз в год. Но, может быть, это делается просто потому, что так захотел директор, а по факту это формальность. А может быть будут считать количество закрытых тикетов в Jira и вешать фотографии в коридоре у секции "сотрудник месяца".
✎ Хорошо бы спросить, с какой целью они проводятся, и какие действия предпринимаются по итогам (повышение грейда и зарплаты, премии) и, главное, по каким критериям проводится оценка производительности разработчика. Если в фирме есть четко прописанные грейды, как например, у CircleCI и Capgemini или что-то в духе Engineering ladders (с зарплатной вилкой и требуемым набором компетенций), это замечательно, потому что будет куда расти по зарплате и компетенциям. Если нет, то не страшно, но хорошо бы спросить у нанимающего менеджера, как человек собирается отслеживать ваш прогресс как инженера (про отслеживание собственного роста писал в этой статье.
➥ Как выглядит испытательный срок, что от меня ожидается?
✎ В некоторых вакансиях это уже прописано, но такое встречается довольно редко. Обычно это краткое описание того, что от вас ожидается в течение ближайших месяцев. Например:
✎ Через 1 месяц: настроите среду разработки, разберетесь, где все лежит, познакомитесь с коллегами;
✎ Через 3 месяца: закончите первые задачи, сами выкатите что-то в продакшн, что-то почините в продакшн;
✎ Через 6 месяцев: поучаствуете в планировании дорожной карты продукта, начнете менторить кого-то из коллег, выступите на внутренней конференции.
✎ Если такое есть, то здорово, потому что это убирает все вопросы о том, что нужно сделать, чтобы пройти испытательный срок - нужно просто двигаться по этому списку.
➥ А сможете ли вы быть полезны на новой работе? Всё ли вам известно про график, зарплату, сферу ответственности?
✎ Не стесняйтесь расспросить о новом месте.
✎ Выясните, чего ждёт от вас руководитель, какие задачи нужно будет решать.
➥ как настроены процессы?
➥ как делаются задачи?
➥ как выполняются дедлайны?
➥ если какие-то факапы (провалы) и что предпринимаете?
➥ чем буду заниматься (сколько соотношения тестов в работе с кодом)?
➥ как я буду расти как специалист?
➥ сам проект, структура проекта и атмосфера?
---------------------------------------------------------------------------------------------
[Мои вопросы тимлиду лично]:
---------------------
➥ Какие были проекты?
➥ что нравилось, не нравилось?
➥ как устроено кросс-ревью в вашей компании, что вы делаете в процессе?
➥ Как устроен процесс принятия пул реквестов?
➥ Сколько человек должно запрувить его?
➥ Все друг друга ревьювят или только лид проекта?
➥ Как происходит планирование задач на спринт?
➥ Как проходить тестирование?
➥ как спускаются задачи?
➥ чем отличаются бенефиты в вашей компании?
➥ чем ваша компания отличается от остальных?
➥ почему в вашей компании круто работать (друг. плоскость вопроса)?
➥ Как устроена архитектура проекта?
➥ Как вы делаете коммиты и т.д.?
---------------------------------------------------------------------------------------------
[Мои вопросы про процессы]:
---------------------
➥ Как происходит процесс разработки?
➥ Что случается, если не укладываетесь в спринт?
➥ У вас scrum? Расскажите, как вы его используете?
➥ Какие встречи у вас есть?
➥ Какие артефакты scrum?
➥ Кто за что отвечает?
➥ Какие технологии используете?
➥ Как происходит процесс взаимодействия с другими командами?
➥ Надо ли писать тесты?
➥ Или разрабы всё починят?
---------------------------------------------------------------------------------------------
[Вопросы для снижения рисков на собеседовании (яндекс)]:
---------------------------------------------------------------------------------------------
Вопросы Hr/оффер (яндекс):
---------------------
➥ Какой был график работы - (гибрид)?
➥ Какой график работы?
➥ Вопросы про иcпыт. срок, сколько, оформление как?
➥ как проходить онбординг?
➥ какой конкретно продукт, сервис?
➥ штат, команда?
➥ большие спринты?
➥ какие должности?
➥ где офис - добираться, адрес?
➥ где проходит рабочее место?, (строго тишина)
➥ Сколько людей на собесе? и с кем конкретно?
➥ Как проходить адаптация на работе?
➥ Как часто у вас появляются вакансии?
➥ Как оформляются отпуска?
➥ Оформление найм?
➥ Фидбэк после?
➥ Как буду работать в компании (процессы адаптации и постановка тз, сроки и срочности)?
➥ что для вас важно при работе с сотрудником?
➥ какой он идеальный кандидат?
➥ Что почитать?
➥ К чему мне готовиться?
➥ Будет ли ментор для адаптации?
➥ критерии испыт. срока, вопрос - что мне сделать, чтобы пройти испыт. срок?
➥ где и с кем рядом работа?
➥ методика организации работы?
---------------------------------------------------------------------------------------------
Вопросы от кандидата (яндекс):
---------------------
➥ Где будет компания/Куда идёт компания?
➥ Что она будет делать через 10 лет?
➥ Как мы будем взрывать рынок? (Важность бэка)
➥ Как устроено Performance Review? (досконально изучить этапы)
➥ Какую методологию используете и как она проводится?
➥ Какие скиллы оцениваются (связанные с процессом компании)?
➥ Как решаются конфликты?
➥ Что по годовым обзорам от Hr (360)? Спрашивать, что волнует и интересно.
➥ review от коллег?
---------------------------------------------------------------------------------------------
Об испытательном сроке (яндекс):
---------------------
➥ Сколько продлится мой испыт. срок?
➥ Какие задачи будут стоять передо мной на это время?
➥ Кто будет мне помогать/будет ли ментор? (мидлам не дают)
➥ Кто будет оценивать мою успешность?
➥ По каким критериям будет оцениваться моя успешность?
---------------------------------------------------------------------------------------------
О должности (яндекс):
---------------------
➥ Каковы мои среднесрочные цели: что нужно будет сделать за полгода - год?
Каковы ожидания от меня?
➥ Какой типовой список задач будет у меня на день или на неделю?
➥ Какова структура и величина дохода? Какой прогноз по его росту?
➥ Как можно развиваться из этой должности? Профессионально и карьерно.
Что для этого нужно будет сделать?
➥ Кто занимал эту позицию до меня и куда он или она делась?
➥ Как давно вы ищете человека на эту позицию? Насколько срочно он вам нужен?
➥ Как часто нужно перерабатывать и оплачивается ли это?
➥ Если ли дежурства в нерабочее время? Оплачиваются ли они?
➥ Нужно ли будет ездить в командировки?
➥ Как будет выглядеть моё рабочее место? Какое оборудование мне выдадут?
---------------------------------------------------------------------------------------------
О команде (яндекс):
---------------------
➥ Какой состав команды? Чем каждый из них занимается?
Как давно эти ребята работают в проекте?
➥ Команда локальная или распределённая? Если ли возможность удалённой работы? Гибридной?
➥ По какому графику работает команда?
➥ Какие каналы связи использует команда? Общается ли в нерарбочее время?
➥ Как устроены процессы в команде?
➥ Какие решения являются командными, а какие принимаются конкретными людьми?
➥  Есть ли у команды общие активности помимо рабочих?
➥ Есть ли у меня возможность познакомиться с командой до принятия оффера?
---------------------------------------------------------------------------------------------
О проекте (яндекс):
---------------------
➥  Каковы долгосрочные цели проекта?
➥ Какой ближайший роадмап, дедлайны, краткосрочные цели?
➥ Насколько проект важен для компании? Есть ли риск закрытия проекта?
Что в этом случае случится с командой?
➥ Какие в проекте основные проблемы и риски?
➥ Кто является стейкхолдерами проекта?
➥ Какие успешные истории были в проекте за последние два года?
Благодаря чему или кому они случились?
---------------------------------------------------------------------------------------------
О компании (яндекс):
---------------------
➥ Все интересующие вас вопросы соцпакета: будет ли ДМС, спортзал, больничные, отпуска, сырки на кофепоинте?
➥ Как устроена система должностей и грейдов? Как компания помогает сотрудникам развиваться?
➥ Есть ли в компании профессиональное обучение? Как оно устроено?
➥ Есть ли в компании внутренние ротации? Насколько они распространены?
➥ Миссия, ценности, конституция. Что для компании важно?
Что она несёт в мир? Чего ищет в сотрудниках?
➥ Все юридические вопросы - каковы детали будущего трудового договора?
Можно ли прочесть образец договора заранее?
---------------------------------------------------------------------------------------------
О личности начальника (яндекс):
---------------------
➥ Каков был ваш карьерный путь? Расскажите о себе.
➥ Какое развитие вы планируете для себя? Как это повлияет на ваших подчинённых?
➥ Что мотивирует вас в работе?
➥ Какие ваши сильные и слабые стороны как руководителя?
➥ Какие основные качества вы цените в коллегах?
➥ Что вы делаете, емли подчинённый не соответствукт вашим ожиданиям?
➥ Когда вы в последний раз увольняли человека? За что?
➥ Есть ли в вашей практике истории об успешном росте подчинённых на руководящие позиции?
➥ Каковы основные достижения ваших подчинённых за последний год?
➥ Как вы помогаете подчинённым соблюдать work-life balance?
➥ Как я буду получать обратную связь? Насколько часто у нас будут встречи 1-1?
➥ Как вы будете получать обратную связь от меня?
➥ Как вы ставите задачи подчинённым? Какой стиль управления предпочитаете?
---------------------------------------------------------------------------------------------
Не только вопросы (яндекс):
---------------------
➥ ! Отказ от ответа на вопрос - это тоже ответ
➥ ! Следите не только за ответами на ваши вопросы, но и за невербальной коммуникацией
➥ ! Не стесняйтесь спросить рекомендации бывших и нынешних сотрудников этой компании
➥ ! Поищите отзывы о компании в интернете
➥ ! Поищите будущих коллег в соцсетях
➥ ! Опасайтесь начальников, не готовых уделить вам время при рассмотрении оффера или отказывающихся отвечать на ваши вопросы
---------------------------------------------------------------------------------------------
Бонус Вопросы (яндекс):
---------------------
✎ Больше вопросов - лучше !
➥ Какие требования?
➥ Для кого?
➥ Кто пользователь?
➥ Какая нагрузка?
➥ Сколько данных поступает на вход?
---------------------------------------------------------------------------------------------
Итоги (яндекс):
---------------------
Собеседование - процесс двусторонних переговоров, подготовьтесь к нему и не стесняйтесь активно участвовать!
➥ ! Задавать вопросы на собеседованиях выгодно для вас
➥ ! Нанимающей стороне тоже выгодно, чтобы вы их задавали
➥ ! Список вопросов лучше составить заранее
➥ ! Про самое важное нужно узнать как можно раньше, а про второстепенное после подтверждения взаимного интереса
---------------------------------------------------------------------------------------------
