Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Каждый раз, когда человек начинает изучать нечто новое, он сталкивается с трудностями. Нужно выделить время для нового занятия, определить цель, преодолевать препятствия, забывать, заучивать и снова забывать новые знания. Дарья Абрамова, CEO онлайн-школы программирования «Кодабра», рассказывает о том, как лучше изучать новое с научной точки зрения.
Онлайн школа программирования для детей "Кодабра"
Онлайн школа программирования для детей "Кодабра"
Блоги
Теги:
Нетленка
Исследование
Мозг
Физика
Спорт
Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Прокачиваем память и внимание
Выберите свою технику для запоминания информации. Чаще всего в обучении используют интервальные повторения, систему Лейтнера и активное вспоминание.

Техника интервальных повторений основана на теории Эбингауза — изученная информация постепенно забывается, если не повторять ее в нужное время. Ученые периодически пытаются вычислить самые эффективные «точки» для повторений. Пока стоит пользоваться схемой «1-7-16-35», то есть повторять материал через день, неделю, 16 и 35 дней.

Система Лейтнера — это усложненный метод интервальных повторений. Он удобен для запоминания сложных терминов или иностранных языков. Также с его помощью можно выучить команды и функции, используемые в программировании. Ученику нужно завести 3 коробки. Сначала в первую коробку складываются слова, которые ученик не знает или знает плохо. Их нужно повторять каждый день. Как только ученик выучил слово, он складывает его во вторую коробку. Слова из второй коробки повторяют каждые три дня. Успешно выученные слова отправляют в третью коробку, невыученные в первую. Слова из третьей коробки повторяют каждые пять дней. Практику продолжают до тех пор, пока все слова не окажутся в третьей коробке.

Активное вспоминание проще всего использовать не для запоминания конкретных терминов, а для изучения большой темы. Нужно прочитать несколько раз учебный материал, а затем не механически повторять его, а запоминать активно. Например, можно написать эссе по прочитанному материалу, пересказать его другу или составить список вопросов, основанный на материале и отвечать на него.

Стройте связи между изученными понятиями. Исследования показывают, что быстрее обучаются те, кто устанавливает связи между изученными идеями. Для этого проще всего использовать майнд-карты, но можно действовать и по-другому. Главное — постоянно включать изученные термины и определения в общий контекст. Например, можно составить словарь из изученных терминов и записать их на одном листе — это уже помогает образованию связей между понятиями.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Помогайте своему вниманию. С одной стороны, для интенсивного обучения, нужно отвлечься от всех раздражителей и сосредоточиться на занятиях. С другой стороны, воля и внимание — исчерпаемые ресурсы и чем дольше вы концентрируетесь на одном предмете, тем сложнее это получается. Поэтому стоит постоянно менять техники обучения и даже изучать несколько тем параллельно. Переключайтесь — решите задачу по программированию, потом повторите несколько сложных команд, а потом напишите простое приложение или функцию. Также можно изучать два языка программирования параллельно — это также поможет переключаться, а заодно станут понятны общие принципы программирования и взаимосвязи между языками.


pixabay.com
Используем педагогические техники
Занимайтесь даже если достигли успеха. Обучение это бесконечный процесс, поэтому не стоит останавливаться, если кажется, что вы уже освоили навык. Если не повторять его регулярно, он забудется или ухудшится. Исследования показывают, что у людей, изучающих жонглирование, увеличилось количество серого вещества в долях, отвечающих за зрительную память. Когда они перестали практиковать новый навык, количество вещества уменьшилось.

Используйте предыдущие навыки, чтобы освоить новые. Причем эти навыки могут быть из совершенно разных областей. Понятно, что, изучив один язык программирования, не так сложно освоить следующий. Но также вам пригодятся знания по математике, физике, английские слова, а может быть и что-то еще.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Объясняйте то, что узнали, другим людям. Исследования показывают, что студенты лучше запоминают информацию, когда знают, что ее придется пересказать кому-то. Да не просто пересказать, а сделать так, чтобы тот другой запомнил информацию и хорошо ориентировался в ней. Такие студенты более вовлечены в обучении и инстинктивно используют лучшие мнемонические техники. Поэтому найдите себе «ученика», хорошо запомните информацию и постарайтесь рассказать ее максимально понятно. Тогда скорее всего вы поймете ее сами.

Чаще проходите тесты. Исследования показывают, что тесты помогают актуализировать выученную информацию, причем не только ту, что встречается в тесте. Это не значит, что к тестам нужно усиленно готовиться — достаточно начать отвечать на вопросы и мозг сам подгрузит нужную информацию.


pixabay.com
Организовываем учебный процесс
Поймите, как вам удобнее учиться. Чтобы заниматься эффективно, нужно определить режим занятий, интенсивность, выбрать лучшие способы. Для этого стоит вспомнить все предыдущие начинания и отследить, какие из них прошли успешно и что вы для этого делали. Может быть, вам удобнее заниматься утром и выделять на это час, а, может быть, вы любите учиться несколько раз в неделю, но с большей интенсивностью. Замечайте, получается ли у вас заниматься дома или для этого нужен воркспейс, библиотека или даже кафе. Чем спокойнее и приятнее вам будет заниматься, тем больших успехов вы достигнете.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Избавляйтесь от раздражителей. В принципе, можно заниматься, отвлекаясь на работу или социальные сети. Студенты часто слушаю лекции, параллельно общаясь с однокурсниками. Ученые называют это занятиями с низкой интенсивностью. Они также приводят к успеху, но времени приходится тратить во много раз больше. Лучше найти укромное место, отключить уведомления в телефоне и заниматься. Даже если у вас есть только полчаса, они будут потрачены с пользой.

Смените обстановку. Постарайтесь заниматься не там, где вы работаете. Особенно это важно для тех, кто работает удаленно. Мозг запоминает эмоции, связанные с рабочим местом и, когда вы сядете за учебу, вам покажется, что вы снова работаете, то есть занимаетесь сложными задачами. Найдите другой стол, поменяйте комнату, занимайтесь даже на полу — пусть мозг привыкнет к новой зоне, выделенной специально для учебы.

Занимайтесь спортом. Во время тренировок усиливается обмен веществ, повышается настроение — если поймать это состояние, можно заниматься эффективнее, чем обычно. Но даже если не получается сделать именно так, занимайтесь спортом в любом случае, особенно на свежем воздухе. Это укрепляет организм и помогает ему лучше заниматься.

Чаще читайте бумажные книги. Конечно, IT-навыки проще получить, ища подсказки на интернет-форумах, просматривая видеоролики, но не стоит полностью пренебрегать бумажными книгами. Исследования показывают, что студентам требуется меньше повторений для запоминания информации, если они читают материал с листа, а не с экрана компьютера.
