········
Страх публ. выступления от собственного интереса и от рассказа своих моментов должно трасформироваться в энергию, в актёрской мастерство, в игру, 
 сыграть роль актура и должно превратиться в кураж !!! = база страха и эволюция страха! 
Тревога - это импульс души из подсознательного к развитию необходимых качеств для развития себя в лучшую версию для счпстл. жизни 
ДЗ - записывать себя на диктофон и на камеру, на телефон и на ноут - записывать себя и работать над своими сторонами! 
Спокойно, размеренно, интонационо- окрашено, не заснуть и без истерик, золотая середина, Отражение нашего мышления! 
Избегать заумных слов, понимать должны все ца, понятный всем и детям, учиться говорить о сложном простыми словами и глубоко, это искуство
Сначала думает, даёт паузу, красиво составляет фразу (заметки), кучеряво интонац-окрашено преподносит ! Держаь внимание публики, рарзвлекать, шутить анекдотами, держать фокус
Информация должна быть ценносй и полезной, должна быть нужна другим, зацепить ! 
Увязывать с ассоциацией 
и концентруию, напряжение аудитории 
потряхивания, тремор, стресс: 
········
ПАМЯТЬ:
Прописывать новую инфлормацию,
 перессказать простыми словами, 
 или самому себе перессказ, 
 прорисовать или скетчноутинг
Спорт утрои
Осанка и лфк утром 
Учить нужное, а не стихи, смотреть на англ!
шахматы, настолки 
интелл. музыка
новое из еды, новый опыт, маршрут 
Вспоминать хронологию предыд. дней, недель 
Новые навыки творчества 
Алкоголь только вино по чуть-чуть 
Математика в голове, лепка, шитьё, рисунок 
Никогда не зубрить, а понимать её, отрисовать своё видение, но не зубрить, 
писать правой рукой
Достопримечательности, картины и т.п. 
Сон
Путешествовать
медитировать 
Писать статьи
Создавать ролики в неделю
Читать книги, статьи 
Скетчноутинг виесто конспектов
········
проявление себя через коммуникацию: 
цель говорить = аудитория, формат, момент, учитывать момент и открыто всё вживую комментировать, аля small talks в моменте сегодня в жизнь, в моменте   
страх должен превратиться в кураж 
заготовки с тезисами - структура, план 
первые 8 секунд цепляющие
не торопиться, тихо говорить, с паузами 
Быть проактивным, менять реплики и вставлять их всегда и везде, менять формат, если надо с риском 
задавать формат, я буду говорить 5 минут, устанавливать правила, экономить время людей 
харизма - этовера в самого себя + эмпатия другой стороны 
ВАжен диалог и вовлечение другой стороны, а не монолог, беседа, участие других людей 
путём вопросов и др. интонацией и  момент, важнго задавать уточн. правильные вопросы, говорить о своих чувствах и расстройствах при конфликте 
делать первый шаг и признавать себя в своих ошибках 
Продуывать, что говорить 
ген успещности - не бояться ошибаться и ломаться, не бояться, и вопрос себе - почему нет? позволять себе, пробовать, что интересно и делать лишнее 
Делать всегда больше, чем нужно для себя, живой интерес выслушать и рассказать 
прислушайся к себе, где тебе хорошо 
надеть маску и будет легче, играть другого и быть собой одновременно 50/50
Деньги это вызов и для семьи надо постараться, чтобы она была хорошая 
Не бояться ошибаться и совершать новое, проходить через ошибки, учиться бесстрашию 
Вступить в сообщества, среда обитания, крутиться в этом среди единомышлеников, получать новые контакты, общаться про работу и проекты, другие крупные компании, иметь сеть контактов, обязательный нетворкинг, 
 заводить полезные связи, конференции, форумы, митапы, доклады,  список вопросов со спикерами 1 к 1 ии проводить встречи, прямо с ними на равных общаться, писать ценным публичным людяям, 
 знакомиться, вести свой личный бренд 
Нетворк собесы 
#Сеть человека-паука с такими же, знакеомиться на всех мероптиятиях, знакомить и представить с самыми активными или найти пару человеков-пауков или самому стать человеком-пауком 
Развивать личный бренд, чтобы ко мне тянулись комьюнити 
Выбрать свой любимый формат (посты, статьи, аудио, видео) - свой экспертный канал и везде постить на всех своих лентах линендин, работа будет со всех сторон, куча клиентов  
Не проосто говорить, а красиво рассказывать - это тренировки регулярные - работа с дикцией и зажимами - свой тг блог, канал, заметки с мыслями, делиться с другими людьми, где будут рады и поддерживать 
Научится выражать свои мысли, рассказывать что-либо другим людям, дикция, выражение, взять тему и выдрессировать себя на канален через практику, объяснять это другому простыми словами и убрать проблемы в речи 
Убрать все дефекты речи, свои блоки, только через практику на запись, сценарий рассказа и репетировать на запись и писать и рассказывать хорошо, потренироваться по схеие и пробовать 
Трекер постов, расписание, темы и регулярно привлекать людей в своё сообщество, стать пауком, 
 не бояться проявляться 
Искать темы и интересы общие при общении, играть роль сыщика при нетворкинге, задавать уточняющ. вопросы про работу и его по имени   
Уметь активно слушать - суммировать ответ другого, повторять ответ 
уметь говорить по существу - глагоды и существительные записыапть из головы, поиск синонимом из головы, дать определение словам (фокус и мыслить яснее), 
 проговаривать слова и выражения, слушая других спикеров 
Писать чётко - брать мысль, учиться фразировать е короче и лаконичнее, искать свой стиль письма, через практику  
Сообщество и среда - это энергия, поодерживать связь с людьми по нетворкингу 
Предложить совместное видео с и нтервью или беседу  с публ. людьми 
Искать чаты после конференций 
Медийка по всему миру на англ бонусом 

Не повторять слова, голос в конце должен идти вниз, и идти из глубин, а не переживаться тоненько и слабо, гоыорить чётко и сжато, но в меру, экономить время всех,
 Речь должна быть живой с индивидуальностью, а не мёртввм диктором, живость и харизма, дышать животом во время речи и говорить глубооким спокойным неторопившемся голосом,
камеру воспринимать как глаза друга и говорить как с другом, тогда я буду услышана и будет отклик ! монотонная, детская, сдавленная, тихая - нельзя,
 не скудная примитивная, и не заумная, говорить разными словами, без повторов, без перепрыгивания с тему на тему, 
 умко и ппо существу, то, что зажигает и интересно лично вам вас зажигало 
········
отслеживать эмоцию и заглушить её, погасить, зафиксировать панику и страх, не вестись, а расслабить её меодиками успокоения и прояалять выдержку продолжая, нарастить броню
уметь гасить конфликт 
#Интровертам - Для коимуникации, личного бренда и развития софт-скиллов- делиться знаниями с другими, писать статьи и искать учеников, менторить, обучать других, на любом уровне эеспертности !!!
это и перессказ, и сторителлинг и повторы для себя, телеграмм канал и хабр! привлечение к себе Если своё написать - всё раыно будет польза, хотя бы для себя, потому что много обработок инфы через себя
Только выходя в стресс и став спикером, можно стать увереннее, только начав и привыкнув к стрессу!
Помогает делиться с темой с другими через написание статей, блога, и т.п, через оформление, фронтенд митап или обмуждать новости с другими, с коллегами!
Любим помогать другим, пожтому менторство, обучение других начинающих, и новых членов в команде, погружать в проект!
Можно вырасти в тимлида и учиться у менеджера! 
желание и умение учиться, пробовать и учиться на практике во всём!
Благодарить себя за усилия, говорить спасибо за своми старания каждый раз!
Делать заметки во время собеса 
скорочтение для чтения
МИДЛ - От 200-300, сеньёр от 350
не говорить вилку, а говорить максималку, потому что они выберут миним. планку
Рассказывать не сухую. теорию, а сложное простым языком, и с примерами из рабочей практики с фактами, отличает от джуна, ответ + пример 
На любой повед. вопрос по софтам - говорить про историю из работы, отвечая на этот вопрос ... чат в помощь по историям 
Демонастрирует грейд не по книжке, а на реальную практику 
Практиковаться и пробовать, импровизировать, и адаптироваться в процессе и проявляться, приходит с опытом повторения *  
 ········
Четкая, понятная коммуникация
Чтобы избежать недопонимания, сначала четко сформулируйте свои мысли, добавьте контекст, прежде чем пересказывать ключевую идею. Говорите простым языком, избегайте идиом, фразовых глаголов и сленга – это поможет вам добиться успеха.
········
Подготовка к вопросам
Лучший способ справиться со сложными вопросами – это подготовиться. Составьте список возможных вопросов и убедительных ответов, чтобы держать ситуацию под контролем. Вы можете предугадать до 80% вопросов, которые вам могут задать.
········
Самопрезентация
Используйте трехступенчатую технику самопрезентации на собеседовании: настоящее, прошлое и будущее. Начните с вашей нынешней работы или образования, кратко расскажите о предыдущих местах работы и проектах, над которыми вы работали, и закончите рассказом о своих планах, например, о карьерных целях. 
········
Работа с поведенческими вопросами
Рассказывая о своих гибких навыках и персональных способностях, используйте методику STAR (situation, task, action, result – ситуация, задача, действие, результат), чтобы быть более конкретным. Опишите ситуацию, в которой вы оказались, какую задачу или проблему вам нужно было решить, расскажите о действиях, которые вы предприняли для решения проблемы, и поделитесь результатом.
········
Убеждение аудитории
Чтобы сделать выступление более убедительным, ссылайтесь на факты и избегайте общих описаний. Еще один способ добавить убедительности своей речи – рассказать историю, основанную на вашем реальном опыте, которая была бы близка людям.
········
Вовлечение аудитории
Приглашение к диалогу – это самый лучший способ привлечения внимания аудитории. Вопросы – это универсальный инструмент, который может в этом помочь. Используйте открытые вопросы для небольшой группы или закрытые вопросы для более широкой аудитории.
········
Преодоление страха перед выступлениями
Самый доступный способ справиться со стрессом – дыхание (изучите технику «дыхания квадратом», о которой говорила докладчица). Если вы нервничаете, отвечая на сложные вопросы аудитории, сделайте паузу и обдумайте свои дальнейшие действия. Например, вы можете переадресовать вопрос или пообещать ответить на него после (к примеру, по электронной почте).
········
Юмор
Будьте осторожны с шутками, так как их может воспринимать и разделять ограниченный круг людей. Это может быть не лучшей идеей для смешанной аудитории, где присутствуют люди разного возраста, профессий и культурного происхождения. Чтобы перестраховаться, пошутите над собой или протестируйте свои шутки на фокус-группе.
········
Использование инструментов искусственного интеллекта
ChatGPT поможет улучшить ваши презентации. С его помощью вы можете найти соответствующие факты и примеры, подтверждающие ваши слова, четче сформулировать мысль и найти потенциальные слабые места в вашей аргументации.  
········
я математик и в годы студенчества столкнулся с проблемой поиска понятных объяснений. так случилось, что математиком я стал, вынырнув из сугубо гуманитарной среды и первое время пытался понимать и запоминать на понятных мне ассоциациях. это работало, но крайне медленно и трудозатратно. но уже к 4-му курсу я понял, что могу говорить на языке математики без перевода. думаю, в программировании тоже есть свой метаязык, позволяющий ассоциировать, пересказывать и понимать большинство языков программирования и Фреймворков. жаль, что такой метаязык не преподают в университете и по сути каждый в меру своих способностей вырабатывает его для себя. через обучение и практику конечно.

#Нейросети в помощь при подготовке: 
Рассылка моих резюме всем (автомат): 
https://www.loopcv.pro/ru/
········
Запись собеса тг: 
https://dzen.ru/a/aI5je77Ikyo3xnKQ 
········
https://www.webmd.com/balance/what-is-box-breathing
https://openai.com/index/whisper/
https://vc.ru/hr/663066-hitrosti-hr-kak-avtomatizirovat-process-naima-sotrudnikov-v-telegram
········
Deep fake лица
https://github.com/hacksider/Deep-Live-Camэ
*** 
https://interviewing.io/
https://www.adzuna.co.uk/jobs/prepper
Площадки для собесов настроить: 
https://360.yandex.ru/blog/articles/kak-pravilno-provodit-sobesedovanie-onlajn-sovety-dlya-rabotodatelej-i-hr-menedzherov
https://telemost.yandex.ru/
https://yandex.ru/support/yandex-360/customers/telemost/desktop/ru/installation.html#installation
········
Читерство в законе. Как пройти собеседование и устроиться на работу в дивном новом мире
https://habr.com/ru/companies/ruvds/articles/908884/
дочитать про технику запоминания
https://vc.ru/hr/772526-kak-uluchshit-pamyat-it-specialistu#comments
https://tproger.ru/experts/boost-your-memory
https://bbbl.dev/articles/it-memory
https://campus.epam.kz/ru/blog/539
https://www.marieclaire.ru/karera/metod-feinmana-kak-vyuchit-chto-ugodno-i-nikogda-ne-zabyvat/
https://habr.com/ru/companies/first/articles/861506/
https://habr.com/ru/companies/ruvds/articles/908884/
········
Задачи с моков 
https://www.youtube.com/watch?v=xdr4rjXbuSQ&list=PLXZzYzG2cy7xzK9kwtFUyRG5gpOt8aOoX&index=18
········
Тренировка и восполнение знаний теории и практики
https://learn.javascript.ru/while-for
https://leetcode.com/
https://www.codewars.com/kata/5a55f04be6be383a50000187
········
Итак, как программисту улучшить свою память?
Изучили что-то новое — примените на практике. А лучше ещё несколько раз.
Объясняйте изученный материал другим людям.
Попробуйте использовать ассоциации для запоминания. Чем «ярче» ассоциация, тем больше вероятность запоминания.
Снизьте количество стресса — он негативно влияет на процесс освоения новой информации. То же касается перегруженности и постоянной многозадачности.
Заведите ежедневник и чек-лист на день. Старайтесь сократить количество информации, которую надо держать в голове.
Больше отдыхайте и высыпайтесь. Сон способствует усвоению информации.
Добавьте в свою жизнь больше физической активности. Участвовать в марафонах не обязательно, можно ограничиться простыми прогулками.
Питайтесь правильно. Сладости и фаст-фуд лучше ограничить. Добавьте в рацион овощи и белковую пищу.
Пейте больше воды. Чаи, кофе и соки воду не заменяют. А про сладкие газировки с их количеством сахара лучше вовсе забыть.
И помните, что программисту не под силу выучить всё, тем более что это «всё» постоянно расширяется. Есть основные вещи вроде синтаксиса языка или шаблонов проектирования, которые нужно держать в голове, чтобы эффективнее выполнять свою работу. Запомнить такие вещи лучше всего поможет практика. Для остального есть Google.
········
В чем главный секрет работы метода?
Зубрежка, как техника обучения, не эффективная, потому что механическое запоминание не дает возможности понимать саму суть предмета, темы или явления. В процессе человек концентрируется на сложных моментах, профессиональных терминах, заучивая их. И впоследствии мозг избавляется от заученной информации, воспринимая ее как ненужную.

Техника Фейнмана основывается на понимании — это и есть основа. Нужно добраться до сути, осмыслить и углубиться настолько, чтобы затем объяснить информацию простыми словами даже школьнику. Когда вы будете способны объяснить сложное просто, мозг запомнит информацию навсегда (читайте также: «С пользой для мозга: 6 привычек, которые сделают вас умнее»).
Как учиться по технике Фейнмана
Разберём технику по шагам. Представьте, что вы готовитесь к экзамену и нужно выучить непростую тему.

Вот что можно сделать:

Шаг 1. Определитесь с темой.
Возьмите чистый лист, запишите название темы и всё, что вы уже знаете о ней.

Шаг 2. Объясните тему.
Представьте, что объясняете тему ребёнку. Чтобы упростить себе работу, можно обозначить подтемы — и для каждой подготовить небольшое объяснение. Ключевое правило: писать (или рассказывать) нужно максимально простым языком.

Старайтесь избегать сложных слов — за ними скрывается наше незнание и неумение свободно объяснить какую-либо концепцию. А ещё лучше объяснять быстро, чтобы воображаемый слушатель не устал и не отвлёкся от слишком долгой речи. Это полезный приём, ведь если что-то непонятно — сразу собьёшься, будешь долго размышлять над формулировками.

Шаг 3. Найдите свои пробелы в знаниях.
Это, скорее всего, произойдёт само собой в процессе объяснения. Например, вроде бы понятное сложное слово никак не получится заменить на что-то попроще. Значит, что-то в нём вам неясно. Выпишите все «тёмные места», а ответы ищите в книгах, учебниках, интернете или в беседе с экспертами.

Шаг 4. Перескажите историю.
Когда все пробелы заполнены, можно связать уже готовые элементы темы в историю. Её лучше рассказать вслух, как будто выступая в школьном классе, а ещё использовать побольше примеров и аналогий (как с тем же динозавром). Если в речи случаются запинки и упорно возвращаются «тяжеловесные» слова, значит, вам что-то ещё не до конца ясно и стоит вернуться к предыдущему пункту.

Что сведет на нет любую подготовку?
Какой бы ни был прекрасный метод запоминания (по Фейнману или любой другой), усилия могут не привести к желаемому результату. Если вы хотите эффективно запомнить информацию, не стоит:

готовиться, учить, тренироваться при включенных гаджетах (телевизор, телефон и другие) — вы будете постоянно отвлекаться на раздражители, сигналы сообщений, звуки и не сможете нормально освоить необходимую информацию;

учиться глубокой ночью, после активного дня, когда очень хочется спать, — уставший мозг будет не способен нормально понимать и структурировать новые знания;

зубрить — это монотонное занятие, которое убивает мотивацию на корню, рождает скуку и нежелание учить;

заниматься без перерыва — длительное обучение принесет только усталость и раздражение, обязательно нужно делать паузы, переключаться, можно пройтись пешком, проветрить комнату или потанцевать под любимую музыку.
 
Чертоги разума (дворец памяти)

Пять интервальных повторений
Один из самых простых способов запоминания, который не требует ни карточек, ни исписанных блокнотов и ручек. Для него вы можете использовать любой тайм-менеджер или просто будильник.

Итак, вы выучили новую тему. Отдохните и повторите ее снова через час. А потом еще раз – через 8 часов. И еще раз – через 24 часа. Потом через 3 дня, 5 дней – и наконец после последнего, пятого, повторения, материал должен надежно отложиться в долгосрочной памяти. Это – один из самых популярных и эффективных методов, о которых можно услышать на разномастных вебинарах о «секретных техниках спецслужб». И он отлично работает – проверено на себе. 

Куда более полезным для современного разработчика является умение быстро находить нужную информацию и грамотно формулировать поисковые запросы, а также способность выбирать из огромного потока информации только нужную и достоверную часть. Как развить эти навыки? На мой взгляд, они могут прийти только с опытом, есть лишь несколько небольших советов:

Прежде чем искать ответ на свой вопрос, проговорите его, убедитесь, что он максимально лаконичен и полностью отражает суть вашей проблемы.
Если вы хотите найти что-то в документации, то определитесь, к какой категории относится ваша проблема, чтобы не терять времени на блуждание по разным разделам.
Ну и самое главное: когда копируете код со StackOverflow, копируйте из ответа, а не из вопроса.
Действительно важная информация, которую нужно помнить разработчику, всегда очень абстрактна и описывает не конкретные реализации, а основные концепции. Этой информации не так много, и запомнить её может каждый без особых усилий, а всякие мелочи вы всё равно забудете через пару недель после того, как перестанете с ними работать. Можно, конечно, упражнения разные поделать, их в сети описано бесчисленное множество, осталось только найти и выбрать, но зачем?

Аватарка эксперта Нина Бурминская
Нина Бурминская
инженер-программист 1 категории компании ICL Services
Программирование как сфера деятельности — это прекрасный образец каждодневной тренировки памяти. Помнить синтаксис и алгоритмы — ежедневная рутина, которая перерастает в механическую память, когда мозг не включается, а «руки помнят». Естественно, это происходит не за один день и даже не за неделю, этот механический опыт передаётся тщательными тренировками и практическими заданиями.

Поэтому, по моему мнению, для программиста забыть синтаксис, операторы, способы объявления функций и т. д. — это как для строителя забыть, как пользоваться молотком.

Трудности возникают тогда, когда разработчик должен взаимодействовать с несколькими языками программирования каждый день. В этом случае получается путаница и беспорядок. В таких ситуациях на помощь приходят мнемонические правила или ассоциативная память. Например, при объявлении функций на языке C# используются знаки «{}», которые мне напоминают консервы — консервированный C#. Для запоминания некоторых команд мне иногда достаточно повторить их вслух, без правил английского языка (Publish-AppvPackage для PowerShell: публиш апп-в пакет).

Для профилактики некоторые упражнения для памяти всё-таки лучше попрактиковать: в моём случае это посмотреть мельком на телефон и вспомнить, сколько там было времени; также по ходу движения запоминать номерные знаки автомобилей — чем больше, тем лучше; вспомнить, что было вчера — тоже отличный вариант!

Память это, конечно, очень важно, и прекрасно помнить всё, но на случай тотального забытья всегда есть Google!

Аватарка эксперта Олег Шиков
Олег Шиков
декан факультета веб-разработки в GeekUniversity
Хотелось бы сразу предостеречь начинающих программистов от зубрёжки. В отличие от языков, на которых мы разговариваем, в языках программирования очень мало исключений из правил, а количество ключевых слов и конструкций редко превышает сотню. Более того, при написании программ, если вы, конечно, не собираетесь работать в блокноте, всегда можно воспользоваться современными редакторами кода и IDE, которые анализируют код, делают подсказки, отмечают ваши ошибки, тем самым ускоряя разработку.

Но существуют вещи в программировании, которые действительно необходимо выучить по двум причинам. Во-первых, чтобы успешно пройти собеседование, продемонстрировав свои навыки, а во-вторых, просто для того, чтобы не тратить своё время на поиск одной и той же информации. К таким вещам относятся, например, основные алгоритмы и шаблоны (паттерны) проектирования, а также синтаксис и основные функции языка программирования, на котором вы собираетесь писать основную часть времени.

Как же лучше всего выучить эти вещи? Просто вызубрить, не вникая в суть? Вряд ли. Можно либо найти в интернете тренировки для памяти и выполнять упражнения «запомни ряд слов и повтори», «запомни цифры и повтори», либо учить стихи. Да, это бесспорно пойдёт вам и вашему мозгу на пользу, но сделает ли это из вас великого программиста? Скорее всего, нет. А вот что действительно может помочь, так это постоянная практика. Если вы будете каждый день хотя бы по паре часов писать код на своём любимом языке программирования (или на том, с которым вы хотите работать в дальнейшем) и не просто бездумно копировать код с таких сайтов, как StackOverflow, а именно писать, понимая, что делает каждый символ вашего кода, то очень скоро вы поймаете себя на мысли, что пишете по памяти, и вам не приходится каждую конструкцию подсматривать в учебнике/документации.

Кроме того, могу посоветовать «сохранять себе в копилку» интересные конструкции и фрагменты кода для того, чтобы в будущем не писать повторно тот же алгоритм, а подсмотреть у себя же. Такие кусочки принято называть сниппетами кода, от английского snippet — отрывок, фрагмент. Существуют и бесплатные сервисы для хранения таких кусочков кода, например GitHub Gist.

Подводя итог, хочу порекомендовать не заучивать всё подряд, а в первую очередь понимать, что вы пишете и почему ваш код работает именно так, а не иначе. Достаточно выучить самые основные и наиболее часто используемые вещи, и, скорее всего, они сами быстро запомнятся. Остальное важно уметь быстро найти в учебнике или в документации.

Аватарка эксперта Инна Анисимова
Инна Анисимова
генеральный директор PR Partner
Учите иностранные языки. Исследования доказали, что у пожилых люди, владеющих двумя и более языками, способности к запоминанию гораздо выше, чем у тех, кто говорит только на родном.
Подключайте эмоции. Забудьте про зубрёжку, все люди с хорошей памятью ассоциируют пустую информацию (цифры например) с какими-либо яркими явлениями (цветом, воспоминанием об эмоциональном событии).
Высыпайтесь. Способности мозга напрямую зависят от того, насколько хорошо его обладателю удалось отдохнуть прошлой ночью. Можете провести эксперимент: сыграйте в «Мемо» после бессонной ночи и хорошо выспавшись — результаты будут очень разными.
Делегируйте задачи левой руке. Не обязательно становиться левшой, но если выполнять простейшие действия не правой, а левой рукой, то мозг перезагружается и начинает работать активнее.
Поживите вслепую… Если иногда выключать зрение в безопасных местах, сидя на лавочке в парке, принимая душ, прогуливаясь по знакомой кухне, то можно через некоторое время обнаружить улучшение когнитивных способностей.
Откажитесь не только от алкоголя, но и от сладкого. Если со спиртным всё ясно, то про сахар многие не думают. Недавно был проведен эксперимент: мыши, напичканные сладким, должны были выбраться из лабиринта, с успехом преодолённого ранее. Никто из подопытных с задачей не справился.
Аватарка эксперта Виталий Чижков
Виталий Чижков
руководитель группы разработки проектов Тверского технологического центра Accenture
Про улучшение памяти написано столько книг и методик, что если их все прочесть, то забудется последнее. На фоне популярности биохагинга с его ноотропами, мнемонических техник, интервальных повторений, эффекта Зейгарник, методов Цицерона и Айвазовского, программисты часто забывают об основе когнитивной функции — здоровье мозга. А оно неразрывно связано со здоровым образом жизни. Поэтому хорошую память следует искать не в психологии, а в физиологии нашего тела. Без умеренной физической нагрузки, хорошего питания, качественного сна и отсутствия вредных привычек вряд ли удастся запомнить что-то надолго.

Вторая основа хорошей памяти — это отсутствие стресса, при котором процесс освоения новой информации теряет в качестве. Перегрузка и режим постоянной многозадачности также ухудшают способность к запоминанию. Для такой психологически напряженной области как программирование это особенно актуальные проблемы. Поэтому следует ответственно относиться к планированию времени, дипломатичности общения с коллегами, активному отдыху и поддержанию work-life баланса.

Модификация памяти — это формирование связей и спецификаций нейронов. А нейрофизиология — очень молодая наука, теоретическая база которой во многом строится на эмпирических наблюдениях. Это значит, что все существующие продвинутые методики запоминания ничего под собой не имеют и на длительном промежутке времени не изучались. К любому методу и совету в этой области нужно относиться с осторожностью.

Аватарка эксперта Юлия Чернова
Юлия Чернова
руководитель направления обучения и развития персонала в DINS
Наша память — уникальный механизм работы с информацией, который имеет ряд особенностей, например:

сгруппированная и структурированная информация запоминается лучше, чем разрозненные факты;
связь информации с эмоциями способствует запоминанию;
механизм забывания, согласно исследованиям Эббингауза, устроен таким образом, что большая часть информации забывается уже в ближайшее время после получения, если ей не пользоваться;
когда наша оперативная память перегружена, то вероятность, что информация из неё эффективно перейдёт в долгосрочную память, снижается.
Как же использовать эти особенности для более эффективного запоминания? Рекомендую применять 3 простых принципа:

Увеличьте количество и регулярность повторений. Лучше всего запоминается то, что вы не просто заучили, а пересказали другим людям, причём в самое ближайшее время после получения информации. Это помогает структурировать материал, выстроить его в логические цепочки и укрепить нейронные связи (мозгу будет проще найти этот «файл» в дальнейшем).
Используйте ассоциации для запоминания. Система хранения информации в нашей голове похожа на шкаф. Чаще всего вы будете пользоваться теми полками, которые расположены или организованы максимально удобно, а также теми, на которые часто ссылаются ярлыки на других коробках. Если вам нужно закрепить в памяти что-то новое, воспользуйтесь яркой ассоциацией. Например, когда вы хотите запомнить конструкцию для комментариев типа /*…*/, представьте, что она похожа на ошарашенное лицо. Такое ошарашенное лицо будет у разработчика через год, если он не оставит комментариев и захочет снова разобраться в коде.
Разгрузите свою оперативную память. Фиксируйте текущие задачи, идеи, договорённости, чтобы высвободить ресурсы мозга для запоминания действительно важного. Больше отдыхайте и высыпайтесь, ведь именно во время сна информация из кратковременной памяти переходит в долговременную.
Для того чтобы глубже погрузиться в тему развития памяти и исследований относительно особенностей мышления, рекомендую посмотреть на YouTube лекции психолога Татьяны Черниговской или прочитать книги «Помнить всё» Артура Думчева, «Как запоминать (почти) всё и всегда» Роба Иставэй. Именно эти материалы мы используем сами для подготовки внутреннего обучающего курса «Работа с информацией», который призван помочь коллегам организовать входящий поток задач, звонков, писем, документов, научиться быстро и качественно выделять главное, запоминать нужное и забывать ненужное.

Аватарка эксперта Юлия Бачурина
Юлия Бачурина
Нутрициолог, диетолог, специалист по детскому питанию
Память необходима программисту для выполнения его профессиональных обязанностей. Но из-за специфики работы именно память становится уязвимой. Сидячая работа, ненормированная загруженность, нервное напряжение, невозможность полноценно принять пищу не лучшим образом влияют на способность к запоминанию.

Несколько простых правил помогут сохранить и улучшить память.

Пейте норму воды. В день необходимо выпивать 1,5–2 литра. Посчитать свою норму можно просто — 30 мл на 1 кг веса. Вода необходима для хорошей работы головного мозга. Чай и кофе не относятся к норме жидкости, так как они обладают мочегонным эффектом.
Скорректируйте питание — добавьте рыбу, орехи, яйца, каши из цельного зерна. Мозг — самый жирный орган в теле, его нужно кормить. Необходимо ограничить сладости, выпечку и фаст-фуд.
Найдите время на физическую активность. Будут это пробежки или прогулки, плавание или велосипед, танцы или бокс — не важно. Главное — заставлять кровь бежать быстрее.
Высыпайтесь и отдыхайте. Мало кто может похвастаться отличной памятью и быстротой реакций после бессонной ночи.
Решайте задачи, разгадывайте кроссворды, учите стихи. Мозг — как мышца. Чем больше его нагружать, тем больше он может выполнить нагрузки.
Отличные результаты даёт пальчиковая гимнастика. При выполнении ассиметричных движений руками улучшается кровоснабжение головного мозга и связи между двумя полушариями. Всего 5–7 минут в день и через месяц виден результат.
Хорошо работают травки — красный клевер, гинкго билоба, куркума, элеутерококк. Их можно пить отварами, можно найти в капсулах. Эффект заметен через 2–3 недели.
Улучшение памяти — это труд, требующий времени, сил и осознанности. Но награда за усилия достойная.
Будьте здоровы!

Итак, как программисту улучшить свою память?
Изучили что-то новое — примените на практике. А лучше ещё несколько раз.
Объясняйте изученный материал другим людям.
Попробуйте использовать ассоциации для запоминания. Чем «ярче» ассоциация, тем больше вероятность запоминания.
Снизьте количество стресса — он негативно влияет на процесс освоения новой информации. То же касается перегруженности и постоянной многозадачности.
Заведите ежедневник и чек-лист на день. Старайтесь сократить количество информации, которую надо держать в голове.
Больше отдыхайте и высыпайтесь. Сон способствует усвоению информации.
Добавьте в свою жизнь больше физической активности. Участвовать в марафонах не обязательно, можно ограничиться простыми прогулками.
Питайтесь правильно. Сладости и фаст-фуд лучше ограничить. Добавьте в рацион овощи и белковую пищу.
Пейте больше воды. Чаи, кофе и соки воду не заменяют. А про сладкие газировки с их количеством сахара лучше вовсе забыть.
И помните, что программисту не под силу выучить всё, тем более что это «всё» постоянно расширяется. Есть основные вещи вроде синтаксиса языка или шаблонов проектирования, которые нужно держать в голове, чтобы эффективнее выполнять свою работу. Запомнить такие вещи лучше всего поможет практика. Для остального есть Google.
 
Метод Цицерона и чертоги разума
За этими двумя названиями скрывается один и тот же метод запоминания через ассоциации и визуализацию. Сейчас объясним, чем отличаются эти способы.

Чтобы запомнить множество новых терминов и определений, используйте «дорогу Цицерона»: вспомните путь, которым вы часто ходили – знакомую дорогу из университета или на работу. А теперь к каждой опорной точке (остановке транспорта, магазину, клумбе) привяжите один новый факт и придумайте ассоциацию – яркую и живую.

Затем, чтобы вспомнить все нужные факты, вам нужно мысленно «пройтись» по вашей дороге, последовательно вспоминая все точки, за которыми вы закрепили часть информации. Например:

Факт: в одном мегабайте – 1024 килобайта.
Ассоциация: На рынке решил купить яблок, спросил у продавщицы сколько яблок в одном ящике — оказалось, 1024. Думал купить кило, но пришлось взять весь МЕГАграмм. 
Если вас всегда удивляло, как математики запоминают 1000 и больше символов числа 𝛑, то секрет заключается в методе Цицерона.

Чертоги разума – это та же дорога Цицерона, но в меньших масштабах. В этом методе, вместо дороги, вам нужно представить знакомую комнату, а опорными точками будут объекты, расположенные в ней. Ходить по комнате следует в одном и том же направлении.


Ассоциации даже там, где их нет
Еще одним способом выправить кривую запоминания в свою сторону является построение ассоциаций. Какие мысли у вас возникают при упоминании циклов, условий? Какие — при упоминании методов изученной библиотеки или фреймворка? Хорошо, если в вашей голове возникают не только воспоминания о том, какое меню на шапке документации было в момент изучения. Яркие и необычные ассоциации способны в значительной степени увеличить длительность хранения информации.

Если вы знаете языки программирования или технологии, то старайтесь проводить взаимосвязи между старыми и новыми знаниями. Например, для меня «каналы» в языке Golang похожи на библиотеки реактивности в RxJS. А метод useMemo из фреймворка React JS крайне сильно напоминает computed из мира Vue. Выстраивая ассоциации, вы оптимизируете свою память — по сути, у вас уже есть знания, и вы их лишь освежаете.

Видите различия в том, что вызывает у вас ассоциации? Так даже лучше. Различия увеличивают контрастность. В процессе «игры» в «Найди отличия» вы сможете еще сильнее углубить свои знания в каждой из двух связанных технологий.

Жду ответы в комментриях ;)
Жду ответы в комментриях ;)
И не обязательно ассоциации будут возникать только в схожих областях. Продавец в ларьке никак не связан с IT-отраслью, однако, это не помешало нам найти что-то общее между ними.

Немного измененные способы ассоциативного запоминания можно найти и в других применениях и примерах. Многие читатели наверняка знают такие словосочетания, как «дворец памяти»/«римская комната»/«метод Цицерона». Это методики запоминания большого объема информации, основанные на построении ассоциативных связей с хорошо знакомыми местами. Более подробную информацию легко найти в интернете по соответствующим поисковым запросам, чем и предлагаю заняться в свободное время.

Слова или тезисы мысленно расставьте в хорошо знакомом помещении в строго определенном порядке. Потом стоить вспомнить комнату — в голове воспроизводится информация.
Слова или тезисы мысленно расставьте в хорошо знакомом помещении в строго определенном порядке. Потом стоить вспомнить комнату — в голове воспроизводится информация.
Что не похоже, то дополняет друг друга
Не всегда легко получается найти взаимосвязи между объектами. Если вы впервые изучаете новую технологию, и ранее не сталкивались ни с чем похожим, быть может, ваши знания начнут дополнять друг друга. Например. Ранее вы занимались бэкенд-разработкой, теперь решаете изучать фронтенд. На теме отправки запросов вы можете сильно упростить себе задачу тем, что вспомните, как раньше вы работали с приемом запросов. Ранее вы могли прочитать из запроса заголовки — значит, наверняка в браузере их можно отправить. И это не единственный случай. Ищите моменты, где ваши знания соприкасаются с тем, что вы уже изучали ранее. Создавайте в своей голове комплексную картину происходящего.

Ссылки вместо полноценных знаний
Разработчики большинства языков программирования хорошо позаботились об эффективности использования программами ресурсов вычислительной машины и оптимизировали процесс хранения и передачи сложной информации. Во многих языках сложные структуры данных. Объекты, массивы и классы передаются не по значению, а по ссылке. Программа не получает новую информацию целиком, а получает знание о том, где эта информация хранится. «Вес» ссылки с точки зрения памяти — значительно меньше, и машина не перегружается при работе с ними. Человеческий мозг тоже очень хорошо работает со «ссылками».

Если после прочтения документации о новой консольной программе, вы помните наизусть все ее параметры и возможности, то вас можно только поздравить и похвалить. Быть может, вы добились этого, опробовав способы, перечисленные выше, а может, вам было настолько интересно, что изучение прошло на одном дыхании. Но если это не так, то вам будет полезнее — не вызубрить все целиком, а запомнить то, где эти знания можно снова легко найти. Запомните поисковый запрос, который вы писали при поиске статьи, оглавление или название отдельной главы — это поможет при восстановлении в памяти вашего пути к требуемой информации.

Возвращаясь этим способом к ранее прочитанному материалу, старайтесь в работе не копировать его вслепую. Например, вы помните, где быстро посмотреть точное написание нужного вам метода библиотеки — вместо копирования кода с сайта, попробуйте его подсмотреть и повторить самостоятельно или хотя бы переписать. Тогда вы начнете изменять «кривую запоминания» в свою пользу, повторяя раз за разом изученное. Со временем уже не придется никуда подглядывать, так как вы уже будете хорошо все помнить и сами.

Если вы сможете обращаться к ссылкам в вашей памяти и повторно находить информацию со скоростью, сопоставимой с изъятием информации из «чертогов разума», то ваша эффективность как IT-специалиста не будет страдать. Наоборот, перед вами откроются огромные возможности по изучению нового — с совершенно иной скоростью и продуктивностью.

Заключение
После прочтения этой статьи вы не начнете по щелчку пальцев покорять новые вершины знаний без усилий и напряжения, однако, пробуя методику за методикой, начнете увеличивать свою эффективность раз за разом, делая ее всё выше и выше.

Вряд ли, пробежавшись по этой статье глазами спустя неделю, вы вспомните все главы из нее. Как ни парадоксально, к самой статье необходимо применять те же методики, чтобы лучше ее запомнить. Используйте на практике способы улучшения памяти, вспоминайте, что похожего вы читали ранее.

А, быть может, вам ранее встречалась статья, в которой эта информация была дополнена еще чем-то интересным? Если и нет, то попробуйте запомнить, о чем здесь написано, и возвращайтесь сюда, когда будете испытывать трудности с запоминанием нового, в своей карьере и жизни.
 
Мнемоника: музыка и акронимы
Помните надоедливую рекламу йогурта по телевизору? Там еще мелодия такая веселая...

Маркетологи давно знают о силе мнемонике: скрытые воспоминания легко пробуждаются ассоциациями с музыкой, цветами и запахами. Этот инструмент можно использовать с пользой для себя.

Тяжело запомнить все законы булевой алгебры? Придумайте акроним! Например: Cuddly Alpaca Impolitely Imitates Angry Duck (Commutative, Associative, Identity, Idempotent, Annulment, Distributive). Кроме законов алгебры, метод акронимов можно применять для любых списков, где важен порядок (цвета радуги или расположение планет Солнечной системы).

Подготовьте плей-лист для учебы. Для каждой темы подберите 2-3 песни – их нужно слушать на повторе, чтобы сформировалась устойчивая связь с выученным материалом. Музыку и ритм мозг запоминает намного лучше, чем сухую информацию – поэтому перед экзаменом будет достаточно послушать плей-лист и мысленно «пробежаться» по всем темам.

Пять интервальных повторений
Один из самых простых способов запоминания, который не требует ни карточек, ни исписанных блокнотов и ручек. Для него вы можете использовать любой тайм-менеджер или просто будильник.

Итак, вы выучили новую тему. Отдохните и повторите ее снова через час. А потом еще раз – через 8 часов. И еще раз – через 24 часа. Потом через 3 дня, 5 дней – и наконец после последнего, пятого, повторения, материал должен надежно отложиться в долгосрочной памяти. Это – один из самых популярных и эффективных методов, о которых можно услышать на разномастных вебинарах о «секретных техниках спецслужб». И он отлично работает – проверено на себе. 

Изучил сам — расскажи другу
Когда вы изучаете что-то новое, постарайтесь относиться к своим знаниям не как к секретам и «своей прелести», а наоборот. Вы сделаете себе очень ценный подарок, если после прочтения новой документации или прослушивания лекции, попробуете пересказать его содержание своим друзьям. В тот момент, когда вы что-то рассказываете другим, происходит два очень важных для вас процесса.

Во-первых, ваши знания проходят через речевой аппарат вашего организма, который находится в близких отношениях с человеческой памятью. Когда мы говорим, мы активно работаем нашей памятью, удерживаем мысли о том, что хотим сказать, а также переносим «резюме» беседы на длительное хранение в мозг. Озвучивание информации — очень полезно для запоминания.

Вторым же важным процессом является то, что формирование речи — трудоемкий процесс для мозга, подвергающий информацию различным процессам преобразования и обработки. Мы редко говорим бессмысленный набор слов. Наша речь — это структурированная последовательность слов и мыслей. Знания, подвергнутые этому процессу обработки — более систематизированы, в них выделены важные и не очень мысли, они лучше подготовлены к запоминанию, а значит, и к более эффективному хранению в памяти, что в сумме, в значительной степени помогает нам в достижении исходной цели.

Разработчикам программного обеспечения, независимо от возраста, есть чему поучиться и что запомнить. Даже лучшие разработчики могут забыть такие вещи, как имена специальных переменных, значения команд и тонкости синтаксиса, специфичного для конкретного языка, независимо от того, сколько раз они их используют. Поэтому неудивительно, что разработчики часто придумывают свои собственные уникальные методы, чтобы освежить свою память и избавить от необходимости искать что-то в документации.

Недавно я просмотрел Интернет, чтобы узнать, какие мнемотехнические средства используют программисты для выполнения своей работы. Как и следовало ожидать, некоторые из них довольно просты, в то время как другие более креативны. Вот несколько примеров некоторых подходов к программированию мнемотехники.

Логика
Разработчики программного обеспечения - довольно логичные люди, поэтому неудивительно, что они часто полагаются на логическую мнемонику, чтобы запомнить что-то.

"rn или nr? Верните – R перед N” leigh_t

“/s — Позволяет " .* чтобы запомнить множество строк

/m — Позволяет ^ и $ совпадать в середине строки” blakem

“.unshift – увеличивает размер. Слово длиннее, чем .shift

.shift – уменьшает размер. Слово короче, чем .unshift" da02

Песня
Музыка и песни - это всегда отличный способ попытаться что-то запомнить или выучить. Разработчики также часто склонны к музыке, поэтому, естественно, некоторые используют мнемонику, основанную на песнях.

“У меня есть мелодии для обычных фрагментов кода. ‘public static void Main(string[] args)’, который является сигнатурой метода main по умолчанию в C#, представляет собой хип-хоп-бит. Операторы SQL - это всегда металлические мелодии. Javascript - это, как правило, инди-поп.” MichaelAza

Слоганы
Рекламодатели любят использовать слоганы, потому что они легко запоминаются и могут закрепиться в нашем мозгу, нравится нам это или нет. В таком случае нет причин, по которым их нельзя было бы использовать для программирования мнемотехники.

“Я никогда этого не запоминаю. = class и # = id в CSS, поэтому я использую ”скажи нет наркотикам", чтобы помнить, что "хэш - это не класс". hill79

Более креативные подходы
Разработчики, конечно, очень изобретательны, что может привести их к появлению новых нестандартных мнемоник, таких как…

“ tar -xzf merc.tgz что за чертовщина

как, черт возьми, вы, люди, помните это дерьмо?

просто подумайте с немецким акцентом

XTRACT ZE FILES” еще один способ

“Ну, одна вещь, о которой я часто забывал, - это убедиться, что я правильно открыл дескриптор файла, потому что это могло привести к тому, что мой код забавно зависал, поэтому я напомнил себе об этом

открой FH”,

и я никак не мог вспомнить, что это была за специальная переменная, пока мне в голову не пришла мысль, что, когда я заставляю свою программу вот так умирать, я с треском ее устраняю. “ brianarn

Наконец, моя самая любимая мнемоника не имеет никакого отношения к программированию, но я все равно хотел поделиться ею здесь. В детстве я был большим поклонником телешоу “Cheers”, и всякий раз, когда я слышу слово “Албания”, у меня в голове всегда всплывает знаменитая фраза тренера по вокалу "Албания".

Помимо этого, когда мы что-то отрабатываем на практике, задействуется куда больше отделов нашего мозга. Учим теорию — работают только те отделы мозга, которые отвечают за зрение и запоминание. Используем изученную технологию или программу -> работаем руками —> задействуем отделы мозга, отвечающие за движение конечностей, за обработку информации, конвертацию ее в результат. Таким образом, нейронные связи начинают формироваться крепче и качественнее, мозг в процессе обработки сам запускает процесс неоднократного повторения, а значит — и запоминания. Потому не стоит недооценивать этот простой, но важный совет: изучаем — пробуем сделать.

Считаю, чем больше у тебя формируется новых образов, которые ты можешь связать с существующими концептами, тем проще будет усвоить что-то новое и пробраться к имеющимся знаниям через туннели памяти. А еще я заметил, что в дни, когда активно что-то учу, мозг будто дает больше доступов: запоминать и вспоминать получается гораздо лучше, чем обычно. 
Создавайте ассоциации и зрительные образы
Соедините новые данные с информацией, которую вы уже помните. Неважно, если это совсем новый материал или что-то, чего вы уже касались. Установив взаимосвязь между новыми понятиями и ранее существовавшими знаниями, вы повышаете вероятность запоминания изученной информации.

Обращайте внимание на фотографии, диаграммы и другую графику в обучающих материалах. Если визуальных подсказок нет, то попробуйте создать собственные. Добавьте рисунки на полях, используйте маркеры разных цветов, чтобы сгруппировать идеи.


 Максим Кузнецов, старший фронт-энд разработчик в «Кибер-Ром».  
Осознать образы, которые вкладывал мастер, когда заносил строки на бумагу, прочувствовать эмоции, блин… Такое точно оставит новые образы в голове. Думаю, чем осмысленнее и детальнее ты что-то познаешь, тем круче становится твоя суперсила эффективно усваивать «чужую» информацию и делать ее «собственной». 

Структурируйте и организуйте
Структурируйте материалы, которые вы изучаете. Попробуйте сгруппировать схожие концепты и термины, составьте систему из своих заметок и материалов из учебника. Это снизит нагрузку на память, так как идеи уже будут связаны между собой, и вам будет легче запомнить информацию.

Не зубрите в последний момент
Изучение материалов в несколько подходов даст мозгу время, необходимое для осознания и обработки информации. Студенты, которые занимаются регулярно, гораздо лучше усваивают материал, чем те, кто пытаются выучить все в один присест. Если вдруг столкнулись с особенно сложной темой, уделите дополнительное время ее изучению.

По теме
Как научиться кодить и не умереть: 3 способа стать программистом без боли
Как научиться кодить и не умереть: 3 способа стать программистом без боли
Вдавайтесь в детали постепенно 
Один из наиболее эффективных методов запоминания и тренировки памяти состоит в повторении и затем дополнении информации. Сначала вы изучаете общее понятие, затем переходите к определению, а потом знакомитесь с подробным описанием того, что термин означает. Повторив этот процесс несколько раз, вы заметите, что уложить информацию в голове стало легче.

Читайте, учите и пишите стихи
Это, пожалуй, самый частый совет, который мы слышали еще в школе. Чтение стихов помогает не только улучшить память человека, но и помогает с усвоением информации. Ведь материал в поэтической форме, как правило, легче запомнить.  

Старайтесь высыпаться 
Исследователи из Беркли связали плохое качество сна с ухудшением памяти. Они обнаружили, что во время глубокого сна мозговые волны передают воспоминания из гиппокампа в префронтальную кору, где они затем и хранятся. Но способность входить в глубокий сон часто ухудшается с возрастом, что негативно влияет на память. 

Недосып также вызывает когнитивные проблемы: снижается бдительность и концентрация, нарушается логическое мышление. Для качественного отдыха взрослым необходимо от 7,5 до 8,5 часов сна в сутки.
 
По теме
Как защититься от овертаймов, которые навязывают лиды: 6 практических советов
Как защититься от овертаймов которые навязывают лиды: 6 практических советов
Тренируйте память и внимание
Вот два теста, которые обычно используются нейропсихологами для диагностики памяти и внимания, но также отлично подойдут для тренировки когнитивных способностей. 

Но существуют вещи в программировании, которые действительно необходимо выучить по двум причинам. Во-первых, чтобы успешно пройти собеседование, продемонстрировав свои навыки, а во-вторых, просто для того, чтобы не тратить своё время на поиск одной и той же информации. К таким вещам относятся, например, основные алгоритмы и шаблоны (паттерны) проектирования, а также синтаксис и основные функции языка программирования, на котором вы собираетесь писать основную часть времени.

Как же лучше всего выучить эти вещи? Просто вызубрить, не вникая в суть? Вряд ли. Можно либо найти в интернете тренировки для памяти и выполнять упражнения «запомни ряд слов и повтори», «запомни цифры и повтори», либо учить стихи. Да, это бесспорно пойдёт вам и вашему мозгу на пользу, но сделает ли это из вас великого программиста? Скорее всего, нет. А вот что действительно может помочь, так это постоянная практика. Если вы будете каждый день хотя бы по паре часов писать код на своём любимом языке программирования (или на том, с которым вы хотите работать в дальнейшем) и не просто бездумно копировать код с таких сайтов, как StackOverflow, а именно писать, понимая, что делает каждый символ вашего кода, то очень скоро вы поймаете себя на мысли, что пишете по памяти, и вам не приходится каждую конструкцию подсматривать в учебнике/документации.

Кроме того, могу посоветовать «сохранять себе в копилку» интересные конструкции и фрагменты кода для того, чтобы в будущем не писать повторно тот же алгоритм, а подсмотреть у себя же. Такие кусочки принято называть сниппетами кода, от английского snippet — отрывок, фрагмент. Существуют и бесплатные сервисы для хранения таких кусочков кода, например GitHub Gist.

Подводя итог, хочу порекомендовать не заучивать всё подряд, а в первую очередь понимать, что вы пишете и почему ваш код работает именно так, а не иначе. Достаточно выучить самые основные и наиболее часто используемые вещи, и, скорее всего, они сами быстро запомнятся. Остальное важно уметь быстро найти в учебнике или в документации.
 
Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Каждый раз, когда человек начинает изучать нечто новое, он сталкивается с трудностями. Нужно выделить время для нового занятия, определить цель, преодолевать препятствия, забывать, заучивать и снова забывать новые знания. Дарья Абрамова, CEO онлайн-школы программирования «Кодабра», рассказывает о том, как лучше изучать новое с научной точки зрения.
Онлайн школа программирования для детей "Кодабра"
Блоги
Теги:
Нетленка
Исследование
Мозг
Физика
Спорт
Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Прокачиваем память и внимание
Выберите свою технику для запоминания информации. Чаще всего в обучении используют интервальные повторения, систему Лейтнера и активное вспоминание.

Техника интервальных повторений основана на теории Эбингауза — изученная информация постепенно забывается, если не повторять ее в нужное время. Ученые периодически пытаются вычислить самые эффективные «точки» для повторений. Пока стоит пользоваться схемой «1-7-16-35», то есть повторять материал через день, неделю, 16 и 35 дней.

Система Лейтнера — это усложненный метод интервальных повторений. Он удобен для запоминания сложных терминов или иностранных языков. Также с его помощью можно выучить команды и функции, используемые в программировании. Ученику нужно завести 3 коробки. Сначала в первую коробку складываются слова, которые ученик не знает или знает плохо. Их нужно повторять каждый день. Как только ученик выучил слово, он складывает его во вторую коробку. Слова из второй коробки повторяют каждые три дня. Успешно выученные слова отправляют в третью коробку, невыученные в первую. Слова из третьей коробки повторяют каждые пять дней. Практику продолжают до тех пор, пока все слова не окажутся в третьей коробке.

Активное вспоминание проще всего использовать не для запоминания конкретных терминов, а для изучения большой темы. Нужно прочитать несколько раз учебный материал, а затем не механически повторять его, а запоминать активно. Например, можно написать эссе по прочитанному материалу, пересказать его другу или составить список вопросов, основанный на материале и отвечать на него.

Стройте связи между изученными понятиями. Исследования показывают, что быстрее обучаются те, кто устанавливает связи между изученными идеями. Для этого проще всего использовать майнд-карты, но можно действовать и по-другому. Главное — постоянно включать изученные термины и определения в общий контекст. Например, можно составить словарь из изученных терминов и записать их на одном листе — это уже помогает образованию связей между понятиями.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Помогайте своему вниманию. С одной стороны, для интенсивного обучения, нужно отвлечься от всех раздражителей и сосредоточиться на занятиях. С другой стороны, воля и внимание — исчерпаемые ресурсы и чем дольше вы концентрируетесь на одном предмете, тем сложнее это получается. Поэтому стоит постоянно менять техники обучения и даже изучать несколько тем параллельно. Переключайтесь — решите задачу по программированию, потом повторите несколько сложных команд, а потом напишите простое приложение или функцию. Также можно изучать два языка программирования параллельно — это также поможет переключаться, а заодно станут понятны общие принципы программирования и взаимосвязи между языками.


pixabay.com
Используем педагогические техники
Занимайтесь даже если достигли успеха. Обучение это бесконечный процесс, поэтому не стоит останавливаться, если кажется, что вы уже освоили навык. Если не повторять его регулярно, он забудется или ухудшится. Исследования показывают, что у людей, изучающих жонглирование, увеличилось количество серого вещества в долях, отвечающих за зрительную память. Когда они перестали практиковать новый навык, количество вещества уменьшилось.

Используйте предыдущие навыки, чтобы освоить новые. Причем эти навыки могут быть из совершенно разных областей. Понятно, что, изучив один язык программирования, не так сложно освоить следующий. Но также вам пригодятся знания по математике, физике, английские слова, а может быть и что-то еще.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Объясняйте то, что узнали, другим людям. Исследования показывают, что студенты лучше запоминают информацию, когда знают, что ее придется пересказать кому-то. Да не просто пересказать, а сделать так, чтобы тот другой запомнил информацию и хорошо ориентировался в ней. Такие студенты более вовлечены в обучении и инстинктивно используют лучшие мнемонические техники. Поэтому найдите себе «ученика», хорошо запомните информацию и постарайтесь рассказать ее максимально понятно. Тогда скорее всего вы поймете ее сами.

Чаще проходите тесты. Исследования показывают, что тесты помогают актуализировать выученную информацию, причем не только ту, что встречается в тесте. Это не значит, что к тестам нужно усиленно готовиться — достаточно начать отвечать на вопросы и мозг сам подгрузит нужную информацию.


Организовываем учебный процесс
Поймите, как вам удобнее учиться. Чтобы заниматься эффективно, нужно определить режим занятий, интенсивность, выбрать лучшие способы. Для этого стоит вспомнить все предыдущие начинания и отследить, какие из них прошли успешно и что вы для этого делали. Может быть, вам удобнее заниматься утром и выделять на это час, а, может быть, вы любите учиться несколько раз в неделю, но с большей интенсивностью. Замечайте, получается ли у вас заниматься дома или для этого нужен воркспейс, библиотека или даже кафе. Чем спокойнее и приятнее вам будет заниматься, тем больших успехов вы достигнете.
Избавляйтесь от раздражителей. В принципе, можно заниматься, отвлекаясь на работу или социальные сети. Студенты часто слушаю лекции, параллельно общаясь с однокурсниками. Ученые называют это занятиями с низкой интенсивностью. Они также приводят к успеху, но времени приходится тратить во много раз больше. Лучше найти укромное место, отключить уведомления в телефоне и заниматься. Даже если у вас есть только полчаса, они будут потрачены с пользой.

Смените обстановку. Постарайтесь заниматься не там, где вы работаете. Особенно это важно для тех, кто работает удаленно. Мозг запоминает эмоции, связанные с рабочим местом и, когда вы сядете за учебу, вам покажется, что вы снова работаете, то есть занимаетесь сложными задачами. Найдите другой стол, поменяйте комнату, занимайтесь даже на полу — пусть мозг привыкнет к новой зоне, выделенной специально для учебы.

Занимайтесь спортом. Во время тренировок усиливается обмен веществ, повышается настроение — если поймать это состояние, можно заниматься эффективнее, чем обычно. Но даже если не получается сделать именно так, занимайтесь спортом в любом случае, особенно на свежем воздухе. Это укрепляет организм и помогает ему лучше заниматься.

Чаще читайте бумажные книги. Конечно, IT-навыки проще получить, ища подсказки на интернет-форумах, просматривая видеоролики, но не стоит полностью пренебрегать бумажными книгами. Исследования показывают, что студентам требуется меньше повторений для запоминания информации, если они читают материал с листа, а не с экрана компьютера.

 Не так важно, кому вы будете пересказывать, речевые процессы для нашего организма работают одинаково в любых ситуациях. Если у вас хорошо развита способность диалога с самим собой, вы можете пересказывать знания вслух в пустой комнате. Это будет эффективно.

***
 
 Яркие краски и абсурдность
Что вы помните из своего детства? Вряд ли — как вас учили держать ручку или карандаш? Зато почти наверняка сможете вспомнить, как учились кататься на роликах и велосипеде. Вы помните это еще лучше, если процесс обучения сопровождался падениями или, наоборот, веселым задором и огромным желанием научиться! Мы — эмоциональные существа, и хорошо помним свои эмоции и чувства, как бы давно ни испытывали их. Попробуйте скрасить свое времяпрепровождение хорошими эмоциями, например, просмотром чего-то запоминающегося в перерывах: веселым роликом или забавной картинкой. Вы запомните не только то, что принесло вам радость, но и то, что происходило в тот момент, и изучение чего-то нового будет веселее и продуктивнее.

Однако, поднимать настроение можно не только в перерывах, но и в момент изучения. Давайте я попробую рассказать, что такое Event Loop в языке JavaScript, дополнив повествование коротким рассказом.

Для начала, Event Loop — это механизм языка программирования, помогающий ему исполнять код, который не обязательно должен быть выполнен прямо сейчас, он может быть отложен. Механизм этот позволяет имитировать асинхронную деятельность и оптимизировать выполнение некоторых затратных задач. Но на что это похоже?

Я :)
Давайте представим владельца одного ларька, который открылся неподалеку и захотел немного улучшить процесс образования очередей в своем магазине, чтобы все уходили от него чуть более довольным. Он смотрит на своих клиентов и предлагает быстрее сделать покупки тем, кто сейчас торопится, кому нужно скорее все купить и отправиться по делам. Он старается скорее обслуживать таких клиентов (синхронный код), выполняя их поручения сразу, как только они подошли к нему.

Но вот в очередь встает молодой человек, не торопящийся никуда. У него только что закончились пары в универе, и он не сильно торопится домой. Он может и готов подождать. Этого парня зовут Микрозадача (в JS — промисы и запросы на анимации), и сегодня он чуть дольше полюбуется хорошей погодой и постоит в очереди. Владелец ларька вежливо предлагает ему встать в заранее подготовленную отдельную очередь, а сам возвращается к основному наплыву клиентов.

Он продолжает работать, помогает нескольким торопящимся покупателям, направляет молодую девушку-волонтера в уже знакомую, «несрочную» очередь. Девушка решает быть предупредительной и уступает свое место другим. Поэтому теперь она — за парнем-студентом, так как пришла после него.

Затем к продавцу подходит доброжелательный мужчина, который тоже готов ждать. Но есть небольшая проблема: у него многодетная семья и длинный список покупок, который любезно составила для него жена. Продавец понимает, что это займет немало времени, поэтому принимает оригинальное решение. Взяв кусок мела, он рисует еще одну линию для тех, кому требуется время, и приветствует там нашего гостя — Макрозадачу.

Как улучшить память IT-специалисту
В конце концов очередь из торопящихся заканчивается, и владелец магазина, вытирая пот со лба, подходит ко второй очереди и приглашает на кассу первого покупателя из неё.

 Итак, записывай то, что тебе НЕ подскажет ChatGPT:

Всегда говори правду. Помни: даже самая маленькая ложь может обернуться большими неприятностями. Например, если ты не знаешь ту или иную технологию, фреймворк и т.п., не делай вид, что разбираешься, в надежде, что об этом не вспомнят. Тебе могут поверить на слово и впоследствии дать задачу на проекте, которую ты не сможешь выполнить.
Не бойся говорить «Я не знаю». Если ты не можешь ответить на вопрос – скажи об этом прямо. Это не снижает шансы на успех, а наоборот способствует установлению доверия между тобой и интервьюером. А еще показывает, что ты не боишься признавать свои слабые стороны и не пытаешься их скрыть.
Воспринимай собеседование как бизнес-встречу, а не экзамен. Компания, со своей стороны, предлагает тебе задачи и компенсацию, а ты предлагаешь свою экспертизу, навыки и усилия.
Не попадайся в ментальную ловушку неполноценности: «большая корпорация – маленький я». Если в компанию с тысячами сотрудников требуется кто-то с твоими навыками и на вакантную позицию рассматривают именно твою кандидатуру, значит тебе нужны компании не меньше, чем она тебе.
Не бойся озвучивать свои идеи, подходы и ценность твоих навыков для компании. Представь, что ты обсуждаешь бизнес-идею с потенциальным партнером и делишься мыслями, чем каждый из вас может быть полезным для общего проекта.
Развивай коммуникационные навыки. Для многих, даже довольно квалифицированных, специалистов так называемый small talk в начале собеседования является самым большим стресс-фактором, которые может разрушить дальнейший ход разговора. Практикуйся в коммуникации, чтобы избежать этого.
Заканчивай интервью интересным вопросом. Это поможет тебе выделиться среди других кандидатов и будет свидетельствовать о реальной заинтересованности в позиции и компании.
Для того чтобы преодолеть волнение, представь, что... «все уже пошло не так». Допустим, ты не ответил-(а) ни на один вопрос, не справился (-ась) с тестовым заданием и в итоге провалил (-а) интервью. Теперь спроси себя, а что изменилось бы, если бы этот ужасный на ваш взгляд сценарий осуществился? Ничего. В худшем случае ты останешься в той же ситуации, в которой находишься – до нового шанса.
Не принимай предложение о работе, которое тебе не по душе. Помни: ты работаешь В компании, а не НА компанию.
А теперь несколько советов на долгосрочную перспективу:

Развивай антихрупкость, делая непривычные, даже некомфортные для тебя вещи. Изучение нового фреймворка сделает тебя НЕМНОГО лучшим разработчиком, в то время как освоение навыков за пределами твоего стека, а то и из совсем других отраслей, сделает тебя ЗНАЧИТЕЛЬНО более профессиональным. Если ты вправду хочешь бросить себе вызов, почему бы не записаться, например, на занятия танцами?
«Прокачивай» гибкие навыки. Современные разработчики практически никогда не работают в одиночестве за компьютером. Помни: наиболее распространенная причина провальных проектов не отсутствие нужных технических навыков, а неэффективная коммуникация в команде. Кстати, подавляющее большинство разработчиков ненавидят проводить демо даже собственных продуктов. Причина та же – недостаточно развитые soft skills. Но после 10-20 демо-сессий ты будешь гораздо более искусным оратором и перестанешь воспринимать перспективу публичного выступления как пытки.
Читай книги. Много книг. Это самый легкий и быстрый способ изменить свой образ мыслей и выйти на новый уровень развития. Кроме профессиональной литературы, выбирай книги, которые заставляют задуматься над философскими вопросами. Обрати внимание на книгу Нассима Талеба «Антихрупкость», которая может коренным образом изменить твое мировоззрение, и «12 правил жизни» Джордана Питерсона (спойлер: одно из правил гласит: «Если встретите на улице кота, погладьте его»).

Завершая работу в основной очереди, продавец слышит шум и бежит к первой, «срочной» — «отпускает» покупателей из неё, затем возвращается на прежнее место. Проходит время, к концу подходит очередь «микрозадач», и, наконец, появляется возможность приступить к решению потребностей покупателей из очереди «макрозадач». Там все еще ожидает обслуживания мужчина с большим списком покупок, еще несколько покупателей плюс другие клиенты.

Справедливая ли это очередь? Решать каждому читателю для себя. Однако, если короткий рассказ смог вызвать у вас улыбку, то, я уверен, вы сможете вспомнить его, а также о каком механизме шла речь, и спустя долгое время после. Старайтесь на любые сложные для изучения темы придумывать сопроводительные истории или картины. Они улучшат как понимание, так и запоминаемость. При этом не всегда важна правдоподобность, не ограничивайте свою фантазию только реалистичными образами.

 Каких ошибок избегать, составляя резюме?
Вот несколько типичных для новичков ошибок в резюме, которые могут испортить впечатление рекрутера о вас:

Адрес электронной почты, который выглядит непрофессионально. Ваш личный электронный адрес может быть не подходящим для резюме. В таком случае создайте новый адрес с вашим именем и фамилией, чтобы рекрутеру было легче идентифицировать вас и связаться с вами.
Злоупотребление софт-скиллами. Если вам нечего написать о своих личных качествах кроме того, что вы стрессоустойчивы и доброжелательны, лучше пропустите этот раздел. Рекрутер в любом случае будет проверять ваши софт-скиллы во время собеседования.:)
Преувеличение, приукрашивание фактов. Не пишите про опыт, которого на самом деле у вас нет и не «добрасывайте» больше технологий, чтобы приукрасить свой профиль. Такие выдумки легко проверить, а нам в команде нужны люди, достойные доверия. Лучше потренируйтесь рассказывать о себе и подчеркивать свои сильные стороны.
На собеседовании
Подготовьте рассказ о себе. Довольно часто разговор с рекрутером начинается с фразы «Расскажите, пожалуйста, о себе.». Это ваша первая возможность произвести хорошее впечатление, поэтому некоторая подготовка обязательна.

Настоятельно советую составить короткий рассказ о себе на пару минут. Поделитесь основной информацией: ваша профессия, опыт (коротко), мотивация, почему вы претендуете на эту должность и чего ожидаете от интервью.

Помните, в какую компанию и на какую позицию вы подали резюме. Узнайте, хотя бы, основные факты о компании и специфику должности. Если вы что-то забудете или перепутаете, ваше собеседование, конечно, не закончится, но это важный момент в общении, когда рекрутер понимает серьезно ли вы относитесь к этой работе.

Обновите свое резюме. Проверьте, указали ли вы в резюме актуальную информацию о своем опыте. Вы уволились с последнего места работы два года назад? Уверена, что вы были чем-то заняты все это время! Если это ошибка и у вас есть более свежий опыт работы, добавьте его в резюме. Если нет, стоит указать курсы, которые вы закончили или проекты, над которыми работали в этот период.

Комфортная обстановка важна. Если вы находитесь на оживленной, шумной улице или в транспорте, вряд ли у вас выйдет полностью сосредоточиться на разговоре. Найдите тихое место, где вас никто не побеспокоит. Приготовьте стакан воды и несколько фраз, чтобы выиграть время, когда не можете быстро найти ответ: 

Повторите, пожалуйста, вопрос.
Мне нужна минутка, чтобы подумать.
Я немного нервничаю. Дайте, пожалуйста, минуту, чтобы собраться с мыслями.
Впрочем, помните, что мы все люди, и интервьюер тоже понимает ваши чувства. Вы совершенно спокойно можете взять паузу, чтобы успокоиться, запнуться, из-за стресса забыть ответ на элементарный вопрос. Это не должно помешать вам произвести наилучшее впечатление!

Подготовьтесь к техническим вопросам. Рекрутеры вряд ли будут проводить вам полноценное техническое собеседование, однако могут задать несколько простых вопросов, чтобы проверить вашу квалификацию. Вам не о чем волноваться, разве что вы немного «приукрасили» свое резюме (а это всегда плохая идея).

Вопросы, к которым стоит подготовиться.
Какой у вас уровень владения английским? Прежде чем проверять ваши технические навыки рекрутер выяснит какой у вас уровень владения английским языком; для программ EPAM Training Center он должен быть не ниже В1 (Intermediate). Поэтому можете рассчитывать на короткий разговор на английском уже на первом интервью.

Почему вы зарегистрировались на эту программу? Продуманный ответ почему вы выбрали именно это направление, почему зарегистрировались в EPAM Training Center и почему вообще собрались в IT, покажет вашу мотивацию и готовность к собеседованию. Лучше определите свои цели и приоритеты заранее.

Какие у вас хобби? Иногда, когда я вижу, что человеку сложно открыться мне, я могу задать личный вопрос, чтобы помочь ему расслабиться. Это также хороший вопрос для проверки английского.

Какие у вас обязанности на текущем месте работы? Вас будут спрашивать о вашем опыте часто. Если рекрутера заинтересует ваша текущая работа, будьте готовы рассказать о своих повседневных обязанностях, проблемах, с которыми вы сталкиваетесь, о своих самых ценных достижениях или даже о своих самых неловких ошибках и, конечно же, о том, как вы их исправили.

Какие у вас карьерные планы? Ваши стремления и планы интересуют рекрутера не меньше вашего предыдущего опыта. Расскажите, каким вы видите свой карьерный путь, какие технологии хотели бы изучить и почему.

 Для эффективного делового общения нужны как вербальные, так и невербальные коммуникативные навыки: умение четко изъясняться, обмениваться идеями, делиться информацией, вести переговоры и разрешать конфликты. 
Используй технику активного слушания, чтобы улучшить свои навыки общения: перефразируй, уточняй, обобщай основные моменты и общайся эмпатично.  
Чтобы достичь успеха в активном слушании, расширяй свой словарный запас, чтобы лучше перефразировать, учись эффективно разъяснять, задавать вопросы, определять главные моменты разговора и подводить итоги, а также выражать эмпатию, запомни вдохновляющие фразы и используй невербальные сигналы.  
Для укрепления доверия старайся общаться с коллегами вне работы, практикуйся начинать и поддерживать разговоры на отвлеченные темы, избегай осуждающего отношения, высказывайся четко и выясняй непонятные моменты. 
Если ты когда-нибудь разойдешься во мнениях с кем-либо, задавая вопросы, ты сможешь перевести спор в здоровую дискуссию. Продуктивная коммуникация предполагает способность обращаться за дополнительными разъяснениями.  
Одна из самых эффективных стратегий разрешения конфликтов – избегать предвзятого отношения. Попробуй посмотреть на ситуацию с точки зрения другого человека, и ты заметишь, что тебе станет легче найти взаимовыгодное решение.  
Очень важно развивать навыки эмпатии, чтобы повысить стрессоустойчивость и лучше справляться с напряженными ситуациями. Эмпатия, как компонент эмоционального интеллекта, может быть полезным инструментом в преодолении стрессовых обстоятельств.  
Если ты окажешься в токсичном окружении, тебе пригодятся техники ненасильственного общения. Вместо того чтобы негативно реагировать на агрессивные выпады, попробуй мысленно перевести их в более позитивные и вежливые высказывания.  
Мы все больше переходим на удаленную работу и цифровое общение, поэтому стоит помнить, что попросить кого-то повторить совершенно нормально. Без колебаний обращайся за необходимыми разъяснениями, поскольку это помогает избежать недоразумений и обеспечить точность коммуникации.  
Чтобы завершать разговор на профессиональном уровне, планируй встречи заранее, устанавливай временные рамки и подытоживай ключевые моменты после обсуждения. Не забывай благодарить собеседника.  
