дочитать 
https://vc.ru/hr/772526-kak-uluchshit-pamyat-it-specialistu#comments
https://tproger.ru/experts/boost-your-memory
https://bbbl.dev/articles/it-memory
https://campus.epam.kz/ru/blog/539
https://www.marieclaire.ru/karera/metod-feinmana-kak-vyuchit-chto-ugodno-i-nikogda-ne-zabyvat/
https://habr.com/ru/companies/first/articles/861506/
https://habr.com/ru/companies/ruvds/articles/908884/
Чертоги разума (дворец памяти)

Изучил сам — расскажи другу
Когда вы изучаете что-то новое, постарайтесь относиться к своим знаниям не как к секретам и «своей прелести», а наоборот. Вы сделаете себе очень ценный подарок, если после прочтения новой документации или прослушивания лекции, попробуете пересказать его содержание своим друзьям. В тот момент, когда вы что-то рассказываете другим, происходит два очень важных для вас процесса.

Во-первых, ваши знания проходят через речевой аппарат вашего организма, который находится в близких отношениях с человеческой памятью. Когда мы говорим, мы активно работаем нашей памятью, удерживаем мысли о том, что хотим сказать, а также переносим «резюме» беседы на длительное хранение в мозг. Озвучивание информации — очень полезно для запоминания.

Вторым же важным процессом является то, что формирование речи — трудоемкий процесс для мозга, подвергающий информацию различным процессам преобразования и обработки. Мы редко говорим бессмысленный набор слов. Наша речь — это структурированная последовательность слов и мыслей. Знания, подвергнутые этому процессу обработки — более систематизированы, в них выделены важные и не очень мысли, они лучше подготовлены к запоминанию, а значит, и к более эффективному хранению в памяти, что в сумме, в значительной степени помогает нам в достижении исходной цели.

Разработчикам программного обеспечения, независимо от возраста, есть чему поучиться и что запомнить. Даже лучшие разработчики могут забыть такие вещи, как имена специальных переменных, значения команд и тонкости синтаксиса, специфичного для конкретного языка, независимо от того, сколько раз они их используют. Поэтому неудивительно, что разработчики часто придумывают свои собственные уникальные методы, чтобы освежить свою память и избавить от необходимости искать что-то в документации.

Недавно я просмотрел Интернет, чтобы узнать, какие мнемотехнические средства используют программисты для выполнения своей работы. Как и следовало ожидать, некоторые из них довольно просты, в то время как другие более креативны. Вот несколько примеров некоторых подходов к программированию мнемотехники.

Логика
Разработчики программного обеспечения - довольно логичные люди, поэтому неудивительно, что они часто полагаются на логическую мнемонику, чтобы запомнить что-то.

"rn или nr? Верните – R перед N” leigh_t

“/s — Позволяет " .* чтобы запомнить множество строк

/m — Позволяет ^ и $ совпадать в середине строки” blakem

“.unshift – увеличивает размер. Слово длиннее, чем .shift

.shift – уменьшает размер. Слово короче, чем .unshift" da02

Песня
Музыка и песни - это всегда отличный способ попытаться что-то запомнить или выучить. Разработчики также часто склонны к музыке, поэтому, естественно, некоторые используют мнемонику, основанную на песнях.

“У меня есть мелодии для обычных фрагментов кода. ‘public static void Main(string[] args)’, который является сигнатурой метода main по умолчанию в C#, представляет собой хип-хоп-бит. Операторы SQL - это всегда металлические мелодии. Javascript - это, как правило, инди-поп.” MichaelAza

Слоганы
Рекламодатели любят использовать слоганы, потому что они легко запоминаются и могут закрепиться в нашем мозгу, нравится нам это или нет. В таком случае нет причин, по которым их нельзя было бы использовать для программирования мнемотехники.

“Я никогда этого не запоминаю. = class и # = id в CSS, поэтому я использую ”скажи нет наркотикам", чтобы помнить, что "хэш - это не класс". hill79

Более креативные подходы
Разработчики, конечно, очень изобретательны, что может привести их к появлению новых нестандартных мнемоник, таких как…

“ tar -xzf merc.tgz что за чертовщина

как, черт возьми, вы, люди, помните это дерьмо?

просто подумайте с немецким акцентом

XTRACT ZE FILES” еще один способ

“Ну, одна вещь, о которой я часто забывал, - это убедиться, что я правильно открыл дескриптор файла, потому что это могло привести к тому, что мой код забавно зависал, поэтому я напомнил себе об этом

открой FH”,

и я никак не мог вспомнить, что это была за специальная переменная, пока мне в голову не пришла мысль, что, когда я заставляю свою программу вот так умирать, я с треском ее устраняю. “ brianarn

Наконец, моя самая любимая мнемоника не имеет никакого отношения к программированию, но я все равно хотел поделиться ею здесь. В детстве я был большим поклонником телешоу “Cheers”, и всякий раз, когда я слышу слово “Албания”, у меня в голове всегда всплывает знаменитая фраза тренера по вокалу "Албания".

Помимо этого, когда мы что-то отрабатываем на практике, задействуется куда больше отделов нашего мозга. Учим теорию — работают только те отделы мозга, которые отвечают за зрение и запоминание. Используем изученную технологию или программу -> работаем руками —> задействуем отделы мозга, отвечающие за движение конечностей, за обработку информации, конвертацию ее в результат. Таким образом, нейронные связи начинают формироваться крепче и качественнее, мозг в процессе обработки сам запускает процесс неоднократного повторения, а значит — и запоминания. Потому не стоит недооценивать этот простой, но важный совет: изучаем — пробуем сделать.

Считаю, чем больше у тебя формируется новых образов, которые ты можешь связать с существующими концептами, тем проще будет усвоить что-то новое и пробраться к имеющимся знаниям через туннели памяти. А еще я заметил, что в дни, когда активно что-то учу, мозг будто дает больше доступов: запоминать и вспоминать получается гораздо лучше, чем обычно. 
Создавайте ассоциации и зрительные образы
Соедините новые данные с информацией, которую вы уже помните. Неважно, если это совсем новый материал или что-то, чего вы уже касались. Установив взаимосвязь между новыми понятиями и ранее существовавшими знаниями, вы повышаете вероятность запоминания изученной информации.

Обращайте внимание на фотографии, диаграммы и другую графику в обучающих материалах. Если визуальных подсказок нет, то попробуйте создать собственные. Добавьте рисунки на полях, используйте маркеры разных цветов, чтобы сгруппировать идеи.


 Максим Кузнецов, старший фронт-энд разработчик в «Кибер-Ром».  
Осознать образы, которые вкладывал мастер, когда заносил строки на бумагу, прочувствовать эмоции, блин… Такое точно оставит новые образы в голове. Думаю, чем осмысленнее и детальнее ты что-то познаешь, тем круче становится твоя суперсила эффективно усваивать «чужую» информацию и делать ее «собственной». 

Структурируйте и организуйте
Структурируйте материалы, которые вы изучаете. Попробуйте сгруппировать схожие концепты и термины, составьте систему из своих заметок и материалов из учебника. Это снизит нагрузку на память, так как идеи уже будут связаны между собой, и вам будет легче запомнить информацию.

Не зубрите в последний момент
Изучение материалов в несколько подходов даст мозгу время, необходимое для осознания и обработки информации. Студенты, которые занимаются регулярно, гораздо лучше усваивают материал, чем те, кто пытаются выучить все в один присест. Если вдруг столкнулись с особенно сложной темой, уделите дополнительное время ее изучению.

По теме
Как научиться кодить и не умереть: 3 способа стать программистом без боли
Как научиться кодить и не умереть: 3 способа стать программистом без боли
Вдавайтесь в детали постепенно 
Один из наиболее эффективных методов запоминания и тренировки памяти состоит в повторении и затем дополнении информации. Сначала вы изучаете общее понятие, затем переходите к определению, а потом знакомитесь с подробным описанием того, что термин означает. Повторив этот процесс несколько раз, вы заметите, что уложить информацию в голове стало легче.

Читайте, учите и пишите стихи
Это, пожалуй, самый частый совет, который мы слышали еще в школе. Чтение стихов помогает не только улучшить память человека, но и помогает с усвоением информации. Ведь материал в поэтической форме, как правило, легче запомнить.  

Старайтесь высыпаться 
Исследователи из Беркли связали плохое качество сна с ухудшением памяти. Они обнаружили, что во время глубокого сна мозговые волны передают воспоминания из гиппокампа в префронтальную кору, где они затем и хранятся. Но способность входить в глубокий сон часто ухудшается с возрастом, что негативно влияет на память. 

Недосып также вызывает когнитивные проблемы: снижается бдительность и концентрация, нарушается логическое мышление. Для качественного отдыха взрослым необходимо от 7,5 до 8,5 часов сна в сутки.
 
По теме
Как защититься от овертаймов, которые навязывают лиды: 6 практических советов
Как защититься от овертаймов которые навязывают лиды: 6 практических советов
Тренируйте память и внимание
Вот два теста, которые обычно используются нейропсихологами для диагностики памяти и внимания, но также отлично подойдут для тренировки когнитивных способностей. 

 
Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Каждый раз, когда человек начинает изучать нечто новое, он сталкивается с трудностями. Нужно выделить время для нового занятия, определить цель, преодолевать препятствия, забывать, заучивать и снова забывать новые знания. Дарья Абрамова, CEO онлайн-школы программирования «Кодабра», рассказывает о том, как лучше изучать новое с научной точки зрения.
Онлайн школа программирования для детей "Кодабра"
Блоги
Теги:
Нетленка
Исследование
Мозг
Физика
Спорт
Наука обучения: как лучше усваивать новые знания в целом и IT-навыки в частности
Прокачиваем память и внимание
Выберите свою технику для запоминания информации. Чаще всего в обучении используют интервальные повторения, систему Лейтнера и активное вспоминание.

Техника интервальных повторений основана на теории Эбингауза — изученная информация постепенно забывается, если не повторять ее в нужное время. Ученые периодически пытаются вычислить самые эффективные «точки» для повторений. Пока стоит пользоваться схемой «1-7-16-35», то есть повторять материал через день, неделю, 16 и 35 дней.

Система Лейтнера — это усложненный метод интервальных повторений. Он удобен для запоминания сложных терминов или иностранных языков. Также с его помощью можно выучить команды и функции, используемые в программировании. Ученику нужно завести 3 коробки. Сначала в первую коробку складываются слова, которые ученик не знает или знает плохо. Их нужно повторять каждый день. Как только ученик выучил слово, он складывает его во вторую коробку. Слова из второй коробки повторяют каждые три дня. Успешно выученные слова отправляют в третью коробку, невыученные в первую. Слова из третьей коробки повторяют каждые пять дней. Практику продолжают до тех пор, пока все слова не окажутся в третьей коробке.

Активное вспоминание проще всего использовать не для запоминания конкретных терминов, а для изучения большой темы. Нужно прочитать несколько раз учебный материал, а затем не механически повторять его, а запоминать активно. Например, можно написать эссе по прочитанному материалу, пересказать его другу или составить список вопросов, основанный на материале и отвечать на него.

Стройте связи между изученными понятиями. Исследования показывают, что быстрее обучаются те, кто устанавливает связи между изученными идеями. Для этого проще всего использовать майнд-карты, но можно действовать и по-другому. Главное — постоянно включать изученные термины и определения в общий контекст. Например, можно составить словарь из изученных терминов и записать их на одном листе — это уже помогает образованию связей между понятиями.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Помогайте своему вниманию. С одной стороны, для интенсивного обучения, нужно отвлечься от всех раздражителей и сосредоточиться на занятиях. С другой стороны, воля и внимание — исчерпаемые ресурсы и чем дольше вы концентрируетесь на одном предмете, тем сложнее это получается. Поэтому стоит постоянно менять техники обучения и даже изучать несколько тем параллельно. Переключайтесь — решите задачу по программированию, потом повторите несколько сложных команд, а потом напишите простое приложение или функцию. Также можно изучать два языка программирования параллельно — это также поможет переключаться, а заодно станут понятны общие принципы программирования и взаимосвязи между языками.


pixabay.com
Используем педагогические техники
Занимайтесь даже если достигли успеха. Обучение это бесконечный процесс, поэтому не стоит останавливаться, если кажется, что вы уже освоили навык. Если не повторять его регулярно, он забудется или ухудшится. Исследования показывают, что у людей, изучающих жонглирование, увеличилось количество серого вещества в долях, отвечающих за зрительную память. Когда они перестали практиковать новый навык, количество вещества уменьшилось.

Используйте предыдущие навыки, чтобы освоить новые. Причем эти навыки могут быть из совершенно разных областей. Понятно, что, изучив один язык программирования, не так сложно освоить следующий. Но также вам пригодятся знания по математике, физике, английские слова, а может быть и что-то еще.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Объясняйте то, что узнали, другим людям. Исследования показывают, что студенты лучше запоминают информацию, когда знают, что ее придется пересказать кому-то. Да не просто пересказать, а сделать так, чтобы тот другой запомнил информацию и хорошо ориентировался в ней. Такие студенты более вовлечены в обучении и инстинктивно используют лучшие мнемонические техники. Поэтому найдите себе «ученика», хорошо запомните информацию и постарайтесь рассказать ее максимально понятно. Тогда скорее всего вы поймете ее сами.

Чаще проходите тесты. Исследования показывают, что тесты помогают актуализировать выученную информацию, причем не только ту, что встречается в тесте. Это не значит, что к тестам нужно усиленно готовиться — достаточно начать отвечать на вопросы и мозг сам подгрузит нужную информацию.


pixabay.com
Организовываем учебный процесс
Поймите, как вам удобнее учиться. Чтобы заниматься эффективно, нужно определить режим занятий, интенсивность, выбрать лучшие способы. Для этого стоит вспомнить все предыдущие начинания и отследить, какие из них прошли успешно и что вы для этого делали. Может быть, вам удобнее заниматься утром и выделять на это час, а, может быть, вы любите учиться несколько раз в неделю, но с большей интенсивностью. Замечайте, получается ли у вас заниматься дома или для этого нужен воркспейс, библиотека или даже кафе. Чем спокойнее и приятнее вам будет заниматься, тем больших успехов вы достигнете.

РЕКЛАМА – ПРОДОЛЖЕНИЕ НИЖЕ
Избавляйтесь от раздражителей. В принципе, можно заниматься, отвлекаясь на работу или социальные сети. Студенты часто слушаю лекции, параллельно общаясь с однокурсниками. Ученые называют это занятиями с низкой интенсивностью. Они также приводят к успеху, но времени приходится тратить во много раз больше. Лучше найти укромное место, отключить уведомления в телефоне и заниматься. Даже если у вас есть только полчаса, они будут потрачены с пользой.

Смените обстановку. Постарайтесь заниматься не там, где вы работаете. Особенно это важно для тех, кто работает удаленно. Мозг запоминает эмоции, связанные с рабочим местом и, когда вы сядете за учебу, вам покажется, что вы снова работаете, то есть занимаетесь сложными задачами. Найдите другой стол, поменяйте комнату, занимайтесь даже на полу — пусть мозг привыкнет к новой зоне, выделенной специально для учебы.

Занимайтесь спортом. Во время тренировок усиливается обмен веществ, повышается настроение — если поймать это состояние, можно заниматься эффективнее, чем обычно. Но даже если не получается сделать именно так, занимайтесь спортом в любом случае, особенно на свежем воздухе. Это укрепляет организм и помогает ему лучше заниматься.

Чаще читайте бумажные книги. Конечно, IT-навыки проще получить, ища подсказки на интернет-форумах, просматривая видеоролики, но не стоит полностью пренебрегать бумажными книгами. Исследования показывают, что студентам требуется меньше повторений для запоминания информации, если они читают материал с листа, а не с экрана компьютера.
